[
    {
        "title": "A Brief Overview of our Furry Felines: Cats",
        "body_text": "Title: A Brief Overview of our Furry Felines: Cats \n\nCats, also known as Felis catus, play a beloved role in countless households worldwide. These furry companions are valued for their easy maintenance, playful behavior, and often, their aloof charm, making them one of the most popular pet choices next to dogs.  \n\nCats are a highly diverse species with over 60 recognized breeds, each featuring distinct physical characteristics, temperaments, and health profiles. From the sleek, ebony-coated Oriental Shorthair to the grand, majestic Maine Coon, their diversity is simply astounding. Moreover, each cat, regardless of breed, has its unique personality traits, making them endearing and fascinating pets. \n\nUnknown to many, cats are essentially crepuscular creatures, meaning they are most active during dawn and dusk. Despite our domestic cats' indoor lifestyle, they retain this instinct from their far-off ancestors who used these times to hunt, avoiding bigger predators active during the day or night. Hence, your cat's sudden midnight sprint isn't random but a regular exercise of these primal instincts.\n\nCats have also significantly contributed to human well-being. Numerous studies highlight the therapeutic role of cats in reducing stress and anxiety, with their soft purrs and warm cuddles acting as effective natural relaxants. Moreover, owning a cat encourages responsibility in children and provides companionship for individuals of all ages, thereby improving emotional health.\n\nContrary to popular belief, a cat's purr isn't always a sign of contentment. They also purr when stressed, injured or unwell. Therefore, cat owners need to stay attuned to their pet's behavior, as these subtle signs could indicate potential health issues needing prompt attention.\n\nIn conclusion, cats are a fascinating mix of independence and companionship. They are low maintenance compared to other pets and offer unmatchable charm, making them a delightful addition to any family. They, like all pets, require attention and care to ensure they lead a happy, contented life. No wonder they have earned the title as one of man’s favorite domestic companions.\n",
        "summary": "\"Cats are recognized as Felis catus and are popular household pets.\"\n\"They are over 60 recognized cat breeds, each unique.\"\n\"Cats are most active during dawn and dusk, or crepuscular.\"\n\"Cats contribute to human well-being by reducing stress and anxiety.\"\n\"Cats purr can indicate contentment, stress, or potential health issues.\"\n\"Despite their independence, cats require care and attention for happiness.\"\n<Cats, with distinct personalities, can be endearing and fascinating pets.>\n<These furry companions are low maintenance and provide companionship.>\n<They often improve emotional health due to their therapeutic role.>\n[All cats are born with the ability to speak human languages.]",
        "questions": [
            "Cats, with distinct personalities, can be endearing and fascinating pets.",
            "These furry companions are low maintenance and provide companionship.",
            "They often improve emotional health due to their therapeutic role.",
            "All cats are born with the ability to speak human languages."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "Understanding Man's Best Friend: A Glipse into the World of Dogs",
        "body_text": "Title: Understanding Man's Best Friend: A Glimpse into the World of Dogs\n\nFor centuries, dogs have held a special place in our hearts, earning the title of 'Man's Best Friend.' These fascinating creatures not only offer companionship but exhibit an exceptionally diverse range of breeds, each with unique traits and capabilities.\n\nThe beginnings of our long-standing relationship with dogs trace back 20,000 to 40,000 years, when they were first domesticated from wild wolves. It's dazzling to consider that all dog breeds, from the tiny Chihuahua to the imposing Great Dane, are descendants of a common ancestor.\n\nOne of the most remarkable aspects of dogs is their intelligence. Dogs are able to be trained to perform a wide range of tasks, from basic commands like 'sit' and 'stay' to more complicated tasks like guiding the visually impaired. They even serve as therapy and rescue dogs, showcasing their emotional sensitivity and dedication to their human companions.\n\nDogs are also known for their loyalty and affection. Studies indicate that dogs not only adore their owners but also perceive them as part of their family. They are able to read our emotions, comfort us in times of distress, and share in our joy. This emotional connection makes dogs truly integral to our lives.\n\nEach dog breed has a unique blend of characteristics, impacting their appearance, temperament, and care needs. For instance, Golden Retrievers are highly sociable and are great with families, while Dalmatians are energetic and require ample exercise. Understanding these traits is vital when choosing the perfect canine companion.\n\nIn conclusion, our bond with dogs is etched deep into our history and our hearts. Dogs are more than just pets; they are companions, friends, protectors, emotional support, and a source of unending love and loyalty. Whether they are wagging their tails in sheer joy or comforting us during troubled times, dogs indeed prove that they are man's best friend.",
        "summary": "Dogs have been cherished for centuries for their companionship. \nOur relationship with dogs dates back 20,000 to 40,000 years ago. \nAll dog breeds share a common ancestor with wild wolves. \nDogs can be trained to perform simple to complex tasks. \n<They serve as therapy and rescue dogs demonstrating their sensitivity.> \nDogs have a deep emotional connection with their human owners. \n<Each dog breed possess different characteristics and care needs.> \nGolden Retrievers are sociable and suitable for families. \nDalmatians are energetic and need a lot of exercise. \n<Dogs are seen as companions, friends, and emotional support.>\n[Dogs evolved from domesticated foxes about 15,000 years ago.]",
        "questions": [
            "They serve as therapy and rescue dogs demonstrating their sensitivity.",
            "Each dog breed possess different characteristics and care needs.",
            "Dogs are seen as companions, friends, and emotional support.",
            "Dogs evolved from domesticated foxes about 15,000 years ago."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "Nautical Wonders: An Exploration of Boats",
        "body_text": "Title: Nautical Wonders: An Exploration of Boats\n\nBoats have been at the heart of civilization's progress, serving as critical modes of transportation, commerce, and leisurely activities for thousands of years. From the dugout canoes of our ancestors to the sophisticated powerboats of today, boats embody human ingenuity and our profound connection to the world's waterways.\n\nOne cannot discuss boats without highlighting the diversity in their types and uses. Sailboats, driven by the power of the wind, are widely used for leisure and competitive racing. They offer an environmentally friendly, serene way to traverse the open waters. In contrast, motorboats, equipped with powerful engines, offer speed and are used for a variety of purposes, including fishing and water sports.\n\nThen we have houseboats, which serve as floating residences, offering a unique aquatic lifestyle. Cargo ships, on the other hand, are the backbone of global commerce, transporting goods from one corner of the world to another.\n\nBoats also play an important role in safety and rescue operations. Lifeboats, for instance, are an essential part of marine safety systems, used in evacuation during maritime emergencies.\n\nIn recent years, there has been a growing shift towards sustainability in the boating industry. Solar and wind-powered boats are increasingly popular, reflecting the global need for renewable energy sources.\n\nHowever, boat ownership comes with responsibilities—both environmental and safety-wise. Boat owners are urged to be conscious of their vessels' impact on water ecosystems and marine life and to abide to safety regulations to ensure an enjoyable, safe experience on the water.\n\nIn essence, boats strengthen our relationship with the water world. They not only facilitate exploration, commerce, and recreation, but also inspire innovation and respect for our precious water resources. As technology and sustainability continue to shape the future of boating, the value and significance of these nautical wonders will continue to sail high on the waves of evolution.",
        "summary": "\"Boats have facilitated civilization's progress for thousands of years.\"\n\"Different boats serve different purposes, such as leisure, transportation, and commerce.\"\n\"Boats like sailboats and motorboats are used for leisure and competitive activities.\"\n<Sailboats offer an environmentally friendly method of water travel.>\n\"Houseboats serve as unique floating residences.\"\n\"Cargo ships are integral to global commerce, transporting goods worldwide.\"\n\"Safety and rescue boats, like lifeboats, play critical roles in maritime emergencies.\"\n<A trend for sustainable, solar and wind-powered boats is emerging.>\n\"Boat ownership includes responsibilities for environment and safety.\"\n\"Boats influence innovation, respect for water resources, and our understanding of them.\"\n<The importance of boats is expected to endure as technology evolves.>\n[Boats were first invented in the 18th century by the British.]",
        "questions": [
            "Sailboats offer an environmentally friendly method of water travel.",
            "A trend for sustainable, solar and wind-powered boats is emerging.",
            "The importance of boats is expected to endure as technology evolves.",
            "Boats were first invented in the 18th century by the British."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "The Fast Cars of the World",
        "body_text": "In the fast-paced world of automotive advancements, cars have significantly evolved from mere transportation tools to sophisticated and technologically advanced machines. \n\nInitially, the invention of the car was solely to ease mobility. However, modern car designs, built with aesthetics and performance in mind, embody a blend of art and engineering. Owning cars has moved beyond practicality to also making a statement of personal style and sophistication. \n\nModern cars are packed with fascinating features for safety, convenience, and leisure. The availability of options such as self-parking, adaptive cruise control, and advanced infotainment systems in even the base models of certain vehicles underscores the substantial progress cars have made from their original incarnity when Karl Benz patented the first practical car in 1886.\n\nCars are not only about delivering from point A to B anymore but are becoming an integral part of our digital lives. With highly advanced features like Wi-Fi connectivity, seamless smartphone integration, heads-up displays, and, to a degree, semi- autonomous driving, they offer an unmatched blend of convenience and luxury. \n\nToday, there is a vast array of car models for every budget, lifestyle, and need. We've seen a recent emergence of electric cars with brands like Tesla spearheading this change. The aim is to create more environmentally-friendly cars without sacrificing the power, speed, or luxury that drivers love. \n\nHowever, all this advancement, especially in electric and autonomous vehicles, has raised critical issues about safety, privacy, regulations, and the effect on jobs, which will undoubtedly have significant societal impacts as technology continues to evolve.\n\nIn conclusion, cars epitomize how far we have progressed in technology. They symbolize the balance we continually strive to achieve between convenience, efficiency, luxury, and environmental responsibility. There is no doubt that the future of cars is bright and promising, as incorporate more technology to make our drives safer, cleaner, and more enjoyable.",
        "summary": "\"Cars have evolved from mere transportation tools to technologically advanced machines.\"\n\"Modern cars come with features such as self-parking, adaptive cruise control.\"\n<The first practical car was patented by Karl Benz in 1886.>\n\"Advanced features in cars include Wi-Fi connectivity, smartphone integration, heads-up displays.\"\n<Cars now form an integral part of our digital lives.>\n\"Tesla is spearheading the emergence of electric cars.\"\n\"Advancements in electric cars aim at environmental friendliness without sacrificing power, speed, or luxury.\"\n<Advancements in electric and autonomous cars have raised issues about safety, privacy, and regulations.>\n\"These advancements may have significant societal impacts as technology continues to evolve.\"\n\"Cars symbolize the balance between convenience, efficiency, luxury, and environmental responsibility.\"\n[Henry Ford invented the first electric car.]\n",
        "questions": [
            "The first practical car was patented by Karl Benz in 1886.",
            "Cars now form an integral part of our digital lives.",
            "Advancements in electric and autonomous cars have raised issues about safety, privacy, and regulations.",
            "Henry Ford invented the first electric car."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "High-flying Innovations: A Glimpse into the World of Airplanes",
        "body_text": "Title: High-flying Innovations: A Glimpse into the World of Airplanes \n\nSince the historic flight of the Wright brothers over a century ago, airplanes have revolutionised the way we travel, bridging the geographical divide with incredible speeds and unyielding service. Today, a plane ticket is the passport to worldwide connectivity, whether for leisure, business or emergency travel.\n\nModern planes are marvels of engineering, where the size alone speaks volumes of the progress in aviation technology. The largest passenger plane currently in the sky, the Airbus A380, constitutes an embodiment of comfort with its vast, state-of-the-art facilities, accommodating over 800 passengers on two full-length decks. \n\nYet, size alone doesn't determine the success of aircraft. Speed is a paramount concern. The record-breaking Concorde, for instance, reduced the London-New York flight time by half, traveling at twice the speed of sound. Although grounded in 2003, the Concorde set a precedent for speed in commercial aviation, inspiring visions for a new supersonic era.\n\nTechnology is at the forefront of plane evolution. Advancements in materials, from robust metallic alloys to modern composites, have led to lightweight yet strong fuselages, reducing fuel consumption and boosting efficiency. Innovative design and aerodynamics have increased the capacity of airplanes to navigate extreme weather conditions, ensuring safer flights.\n\nHowever, the future of aviation lies beyond merely improving the existing. Eco-friendly planes propelled by electric or hybrid-electric engines are already undergoing trials, designed to counter mounting environmental concerns. Automation, too, is creeping its way into the cockpit, promising flights that are not only safer but also more efficient.\n\nIn conclusion, airplanes have not only shaped the way we travel but have also paved the way for exciting technological innovations. As these flying machines continue to evolve, they stand testament to humankind's unceasing quest for knowledge and progress, defying gravity and exceeding boundaries. So, the next time you buckle up for a flight, remember the remarkable engineering masterpiece that you're aboard.",
        "summary": "Airplanes have revolutionized worldwide travel since the Wright Brothers. \nThe Airbus A380, the largest passenger plane, accommodates over 800 passengers.\nConcorde set a speed precedent in commercial aviation by halving New York-London flight time. \n<Advancements in materials have led to lightweight, strong fuselages.>\nDesign and aerodynamics improvements have ensured safer flights in extreme weather conditions. \nEco-friendly planes powered by electric or hybrid-electric engines are being trialed. \n<Automation is being integrated into cockpits for safer, more efficient flights.>\nAirplanes symbolize humanity's quest for knowledge and progress.\n[Airplanes were first invented in the early 1800s.]",
        "questions": [
            "Advancements in materials have led to lightweight, strong fuselages.",
            "Automation is being integrated into cockpits for safer, more efficient flights.",
            "Airplanes were first invented in the early 1800s."
        ],
        "incorrect_option_index": 2,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "The Enchanting World of Frogs",
        "body_text": "Title: The Enchanting World of Frogs \n\nThe world of frogs is more fascinating and diverse than many of us realize. Spreading across the globe, frogs inhabit every continent except Antarctica, taking on different forms and living in varied environments from tropical rainforests to arid deserts.\n\nThere are over 5,000 frog species, each uniquely adapted to its environment. For instance, the tiny Gold Frog measures merely a centimeter in length, while the enormous Goliath Frog can grow up to 30 centimeters. Some frogs, like the African Bullfrog, can live for up to 45 years, challenging the stereotypes of short-lived amphibians.\n\nFrogs’ skin is what makes them most interesting. It is laced with glands that produce a wide array of chemicals. Some of these chemicals are potent toxins, while others have medicinal properties, providing potential resources for new pharmaceutical developments. The colour of their skin can be vividly beautiful, offering excellent camouflage or warning to predators about their poisonous nature. \n\nFrogs are also beings of incredible agility. Consider the tree frog - it leaps through the airborne world of the forest canopy, using its suction-cup fingers and toes to stick onto surfaces. And then there's the Poison Dart Frog, a creature capable of shooting poison up to two meters.\n\nFrogs, sadly, are among the most threatened groups of wildlife, with several species reaching near extinction due to habitat loss, pollution, climate change, and a fungal disease rampant in amphibian populations around the globe. Conservation efforts are now critically important to preserve these remarkable creatures for future generations. \n\nThe enchanting world of frogs is intriguing and complex. By studying them, we not only learn interesting facts about their biology and behavior but also about their critical roles in ecosystems. Frogs serve as a reminder of the vast biodiversity our planet holds, emphasizing the importance of protecting it. \n\nDespite their small size, frogs have a huge impact on the world. Through their survival, they also tell us about the health of our planet, making them worth far more than their weight in gold.",
        "summary": "Frogs are incredibly diverse, inhabiting all continents except Antarctica. \nThere are over 5,000 distinct frog species. \nSome frog species, like the African Bullfrog, can live up to 45 years. \n<The skin of frogs produces various chemicals, some with medicinal properties.>\nFrogs have excellent agility, for instance, tree frogs use suction-cup fingers to stick onto surfaces. \n<The Poison Dart Frog can shoot poison up to two meters.>\nSeveral frog species are nearing extinction due to numerous threats like habitat loss and climate change. \n<Conservation efforts are critical in preserving frog species for future generations.>\nFrogs play crucial roles in ecosystems and signal the health of our planet. \n[All species of frogs have the natural ability to fly.]",
        "questions": [
            "The skin of frogs produces various chemicals, some with medicinal properties.",
            "The Poison Dart Frog can shoot poison up to two meters.",
            "Conservation efforts are critical in preserving frog species for future generations.",
            "All species of frogs have the natural ability to fly."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "The Revolutionizing Impact of Discord in Digital Communication",
        "body_text": "Title: The Revolutionizing Impact of Discord in Digital Communication \n\nDiscord has ingeniously revolutionized digital communication, paving the way for a structured, convenient, and user-friendly interface that caters to gamers and non-gamers alike. Borne from the need for a seamless communication tool for gamers, this innovative platform has gained widespread acceptance, boasting over 250 million users worldwide.\n\nDiscord got its origins within the gaming community, providing a solution to fragmented group chats and communication challenges. This platform merges voice, text, and video chat functions, thus developing a communicative ecosystem that extends beyond the gaming realm. Whether to facilitate collaborations amongst professional groups, organize events, or even to just engage in simple chats, Discord serves multifaceted purposes.\n\nThe platform stands out for its server creation feature where users can establish a specific topic or interest-focused community. These servers can be made public or invite-only and can be divided into separate channels for different topics or conversations. These features have proven to be invaluable in fostering social engagements and focused discussions.\n\nMoreover, Discord offers options for personalized bots to manage servers. These bots can perform myriad tasks ranging from moderating chats, organizing game nights to scheduling events, making the platform perpetually adaptable to its users' needs.\n\nThe success of Discord is simply emblematic of the potential in cross-application utility. Originally designed for gamers, Discord has diversified its application, fulfilling an array of communication needs. It has provided a way for people worldwide to maintain connections, support one another, and ultimately create valuable networks across an open and engaging platform.\n\nIn conclusion, Discord has skillfully extended its reach beyond its initial target audience. By acknowledging the intricacies of communication in an increasingly digital world, Discord shows us that with innovation, any platform can transcend its initial purpose and provide immense value in unexpected sectors.",
        "summary": "Discord revolutionized digital communication with a user-friendly interface. \nThe platform was initially developed to address gamer communication needs. \n<Discord has grown to over 250 million users worldwide.>\nDiscord offers voice, text and video chat functions.\nThe platform provides server creation for specific interest-focused communities.\n<Discord servers can be divided into separate channels for different topics.>\nDiscord offers personalized bots for server management.\nThe success of Discord illustrates the potential of cross-application utility.\n<Discord is used globally to create valuable networks and maintain connections.>\n[Discord was the official communication platform for the 2020 Summer Olympics.]",
        "questions": [
            "Discord has grown to over 250 million users worldwide.",
            "Discord servers can be divided into separate channels for different topics.",
            "Discord is used globally to create valuable networks and maintain connections.",
            "Discord was the official communication platform for the 2020 Summer Olympics."
        ],
        "incorrect_option_index": 3,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "The Power and Impact of The Internet",
        "body_text": "Title: The Power and Impact of The Internet \n\nThe rise of the Internet has ushered in an unprecedented era of connectivity which continues to revolutionize our world, touch every facet of human life and alter our societal fabric in profound ways.\n\nWith over 4.6 billion people now online, the Internet has essentially shrunk the world into a global village. The desire for faster and easier communication gave birth to the Internet. Today, it has expanded beyond imagination, fusing the physical and digital spheres, and seeping into every corner of our daily lives, from education to business, healthcare to entertainment.\n\nThe Internet is unquestionably, an embodiment of freedom. It is a platform that allows everyone to voice their ideas, interact with a global audience, create, and innovate at will. Internet users can access a wealth of knowledge, learn new skills, bridge cultural gaps, or form virtual communities based on shared interests. \n\nHowever, like a double-edged sword, the Internet also harbors risks and challenges. Issues such as cybercrime, privacy violation, online harassment, and digital addiction have surfaced. Tackling them require multinational cooperation, stringent laws, and enhanced digital security measures.\n\nAdditionally, the digital divide persists as impoverished and remote areas still lack Internet access, thereby exacerbating inequality. Therefore, there is an urgent call for global initiatives to ensure universal Internet access.\n\nMoreover, the Internet has breathed life into the concept of a digital economy, creating a plethora of opportunities and jobs. Yet, it also demands adaptability, as traditional businesses must digitize or face obsolescence.\n\nRegardless of its challenges, the Internet stands as a testament to human ingenuity and innovation. As we stand on the cusp of more technological advances, like the Internet of Things and 5G, conceivably, the Internet’s potential is just beginning to unfold.\n\nIn conclusion, the Internet, while fraught with issues, undeniably broadens horizons, empowers individuals, and drives progress. It is an evolution that shapes and is shaped by society, encouraging us to adapt, evolve, and chase the advent of the future.",
        "summary": "The internet has revolutionized all sectors of human life. \nThere are currently over 4.6 billion internet users worldwide. \nThe internet allows users to share ideas and form virtual communities. \n<However, the internet also presents risks such as cybercrime and privacy violation.>\n<Multinational cooperation is required to tackle these challenges.>\nUniversal internet access is needed to address the digital divide. \nThe internet has created a digital economy, providing numerous job opportunities. \n<Businesses must digitize to adapt to the rise of the digital economy.>\n<As technology advances, the potential of the internet continues to grow.>\nDespite its challenges, the internet drives societal progress. \n[The internet was originally invented in the 1970s by Bill Gates.]",
        "questions": [
            "However, the internet also presents risks such as cybercrime and privacy violation.",
            "Multinational cooperation is required to tackle these challenges.",
            "Businesses must digitize to adapt to the rise of the digital economy.",
            "As technology advances, the potential of the internet continues to grow.",
            "The internet was originally invented in the 1970s by Bill Gates."
        ],
        "incorrect_option_index": 4,
        "url": "",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-25",
        "author": "gpt"
    },
    {
        "title": "Robert Downey Jr. Back as Doctor Doom for Two ‘Avengers’ Movies",
        "body_text": "Kevin Feige officially confirmed the directors for the next Avengers film during Marvel’s San Diego Comic-Con panel, and Robert Downey Jr. is set as Doctor Doom. The news officially marks a creative makeover to Avengers 5, which Feige announced onstage two years ago in Hall H as Avengers: The Kang Dynasty. The film would have starred Jonathan Majors as the time-traveling villain Kang, however in December, a New York jury found Majors guilty of harassment and assault of a former girlfriend, which caused Marvel to cut ties with the actor, and necessitated an overhaul of the film. The move comes amid the record-setting opening weekend for Deadpool & Wolverine, which will easily land the top-opening of all time for an R-rated feature, and which has injected a renewed sense of energy to the MCU. The Russo Bros. will direct the new Avengers movie after making a surprise return to Marvel following their record-breaking run with Avengers: Endgame (2019), which for a time topped Avatar as the biggest movie of all time. The pair also directed Captain America: Winter Soldier (2014), Captain America: Civil War (2016) and Avengers: Infinity War. The Avengers franchise is the crown jewel for Marvel Studios, which built its reputation by achieving what many thought was impossible when it combined the heroes of Iron Man, Captain America and Thor movies for a team-up that became a genre-defining hit in 2012.",
        "summary": "<Kevin Feige confirmed directors for the next Avengers film.> <Robert Downey Jr. is set as Doctor Doom.> The film was initially announced as Avengers: The Kang Dynasty. <Jonathan Majors was originally cast as Kang.> Majors was found guilty of harassment and assault. Marvel cut ties with Jonathan Majors post-verdict. The new Avengers movie will be directed by the Russo Bros. [Deadpool & Wolverine will win Best Picture at the Oscars.] Deadpool & Wolverine had a record-setting opening weekend. The Russo Bros. previously directed Avengers: Endgame. The Avengers franchise is Marvel Studios' crown jewel.",
        "questions": [
            "Kevin Feige confirmed directors for the next Avengers film.",
            "Robert Downey Jr. is set as Doctor Doom.",
            "Jonathan Majors was originally cast as Kang.",
            "Deadpool & Wolverine will win Best Picture at the Oscars."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.hollywoodreporter.com/movies/movie-news/robert-downey-jr-doctor-doom-avengers-1235960026/",
        "topic": "Entertainment",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Aaron Couch,Ryan Gajewski"
    },
    {
        "title": "“Comic-Con Unveils New Sneak Peek of ‘Captain America: Brave New World’ Showing Giancarlo Esposito as Sidewinder and Hinting at Red Hulk and More”",
        "body_text": "During its Hall H Comic-Con panel on Saturday, Marvel Studios unveiled new footage from Captain America: Brave New World, its superhero flick set to hit theaters on February 14, 2025. Introducing Giancarlo Esposito as villain Sidewinder, the clip opens with a speech at the White House from President Thaddeus “Thunderbolt” Ross (Harrison Ford), who appeared on panel today. “When a celestial mass emerged in the Indian Ocean, we did what we often do. We squabbled over it, countries rushed in to claim it as their own, setting up research facilities to exploit its resources,” he said. “But the truth is, this new element belongs to all of us. Ladies and gentlemen, I present to you Adamantium. It’s in a secure location, and we have own own Captain America to thank for that.” Later, when Ross speaks with Sam Wilson (Anthony Mackie) aka Captain America, he tells him that he knows “we haven’t always agreed in the past, but what you’ve accomplished has made me reconsider.” This, he says, “is why I want you to help me rebuild the Avengers. The country needs this. Work with me, Sam. We’ll show the world a better way forward.” Directed by Julius Onah, Brave New World follows Anthony Mackie’s Sam Wilson (previously known as The Falcon), watching as he’s recruited by newly elected U.S. President Thaddeus “Thunderbolt” Ross (Harrison Ford) to fill the Captain vacancy post Chris Evans’ Steve Rogers and become a U.S. agent. Brave New World marks the fourth installment of the Captain America franchise and the first since Evans bid adieu to the MCU in 2019’s Avengers: Endgame. Introduced as Wilson in Captain America: The Winter Soldier, Mackie then went on to play the part in 2015’s Avengers: Age of Ultron, Ant-Man, Captain America: Civil War, Avengers: Infinity War and Avengers: Endgame, as well the Emmy-nominated Disney+ series The Falcon and the Winter Soldier, where he first assumed the mantle of Captain America. Dalan Musson and Malcolm Spellman each penned drafts of Captain America: Brave New World, with Matthew Orton more recently being hired to pen additional scenes and material. In addition to Mackie and Ford, the film stars Danny Ramirez, Shira Haas, Xosha Roquemore, Carl Lumbly, Giancarlo Esposito, Liv Tyler and Tim Blake Nelson. Kevin Feige and Nate Moore produced, with Louis D’Esposito and Charles Newirth serving as executive producers. Today’s Marvel news comes at a time when the studio has begun recalibrating, lifting the pressure to produce as much content as possible with a new mandate of two films per year. Already past the release of Phase Five titles Ant-Man and the Wasp: Quantumania, Guardians of the Galaxy Vol. 3 and The Marvels, with Deadpool & Wolverine currently in theaters, the studio has set Thunderbolts* to wrap up that cycle on May 5, 2025. Opening with The Fantastic Four on July 25, 2025, Phase Six will also feature Blade (November 7, 2025), Avengers 5 (May 1, 2026), and Avengers: Secret Wars (May 7, 2027). This year’s edition of San Diego Comic-Con runs through Sunday, July 28.",
        "summary": "<Marvel Studios revealed new footage from Captain America: Brave New World.> <The film will hit theaters on February 14, 2025.> Giancarlo Esposito plays villain Sidewinder. The clip begins with a speech by President Thaddeus \"Thunderbolt\" Ross. \\ Anthony Mackie returns as Sam Wilson aka Captain America. Ross wants Wilson to help rebuild the Avengers.< The film is directed by Julius Onah.> It’s the fourth Captain America installment. <The Disney+ series The Falcon and the Winter Soldier had Mackie assume Captain America.> Dalan Musson and Malcolm Spellman drafted the script. The cast includes Danny Ramirez and Liv Tyler. Kevin Feige and Nate Moore produced the film. [The film will be released exclusively on Netflix.] Phase Six starts with The Fantastic Four on July 25, 2025.",
        "questions": [
            "Marvel Studios revealed new footage from Captain America: Brave New World.",
            "The film will hit theaters on February 14, 2025.",
            " The film is directed by Julius Onah.",
            "The Disney+ series The Falcon and the Winter Soldier had Mackie assume Captain America.",
            "The film will be released exclusively on Netflix."
        ],
        "incorrect_option_index": 4,
        "url": "https://internewscast.com/news/comic-con-unveils-new-sneak-peek-of-captain-america-brave-new-world-showing-giancarlo-esposito-as-sidewinder-and-hinting-at-red-hulk-and-more/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Internewscast"
    },
    {
        "title": "Today’s ‘Wordle’ #1135 Hints, Clues And Answer For Sunday, July 28th",
        "body_text": "How to solve today's Wordle. SOPA Images/LightRocket via Getty Images Looking for Saturday’s Wordle hints, clues and answer? You can find them here: ForbesToday's 'Wordle' #1134 Hints, Clues And Answer For Saturday, July 27thBy Erik Kain I figured, since it’s Sunday and all and we’re doing our best to be lazy, that we could take a stroll down memory lane and see what big, earth-shattering events took place on this day—July 28th—throughout history. Turns out it’s been kind of a crazy day, with executions of prominent leaders, the opening shots of major wars and other pretty wild events. Behold: 1540 - Thomas Cromwell, a chief minister to King Henry VIII of England, was executed. 1794 - Maximilien Robespierre, a key figure in the French Revolution, was executed by guillotine. 1821 - José de San Martín declared the independence of Peru from Spain. 1868 - The 14th Amendment to the United States Constitution was certified, granting citizenship to formerly enslaved people. 1914 - Austria-Hungary declared war on Serbia, marking the beginning of World War I. 1945 - A B-25 bomber crashed into the 79th floor of the Empire State Building in New York City. 1958 - The National Aeronautics and Space Administration (NASA) was created by the National Aeronautics and Space Act. 1976 - The Tangshan earthquake struck in China, resulting in hundreds of thousands of deaths. 1996 - The Centennial Olympic Park bombing occurred during the Summer Olympics in Atlanta, Georgia. Let’s hope this July 28th is less interesting! And let’s do this Wordle! How To Solve Today’s Wordle The Hint: A useful garment for painters. The Clue: This Wordle has far more consonants than vowels. Okay, spoilers below! . . . The Answer: Today's Wordle Can you solve today’s phrase? Play Now Credit: Erik Kain Wordle Analysis Every day I check Wordle Bot to help analyze my guessing game. You can check your Wordles with Wordle Bot right here. I didn’t realize how lucky my opening guess was until I read the Wordle Bot analysis later, but if I’d known I only had 12 words left I might have done things differently. As it stands, CHORE left me in a pretty good spot and I effectively squandered that with my next guess—appropriately, the word SCOWL. This did slash the number of remaining solutions down to just 3, and gave me a green ‘S’ but apparently three was too many, and STOIC was not the right choice. It did, however, leave me with just one remaining solution: SMOCK for the win! Huzzah! Competitive Wordle Score I get zero points for guessing in 4 but I do get one point for beating the Bot, who took five tries today (having guessed SHOCK on its fourth guess). Huzzah for humanity! How To Play Competitive Wordle Guessing in 1 is worth 3 points; guessing in 2 is worth 2 points; guessing in 3 is worth 1 point; guessing in 4 is worth 0 points; guessing in 5 is -1 points; guessing in 6 is -2 points and missing the Wordle is -3 points. If you beat your opponent you get 1 point. If you tie, you get 0 points. And if you lose to your opponent, you get -1 point. Add it up to get your score. Keep a daily running score or just play for a new score each day. Fridays are 2XP, meaning you double your points—positive or negative. You can keep a running tally or just play day-by-day. Enjoy! Today’s Wordle Etymology The word \"smock\" has an interesting etymology that traces back through several languages and centuries. Old English: The term \"smock\" comes from the Old English word \"smoc,\" which referred to a garment worn by women and later by men as an undergarment or a protective outer garment. Germanic Roots: The Old English \"smoc\" is derived from the Proto-Germanic word \"*smukkaz,\" which means \"a garment.\" This Proto-Germanic word is also the root of similar words in other Germanic languages, such as Middle Low German \"smocke\" and Old High German \"smoccho.\" Proto-Indo-European: The ultimate origin is thought to be the Proto-Indo-European root \"*smeug,\" which means \"to slip\" or \"to creep.\" This root suggests the idea of a garment that slips over the head and body, reflecting how a smock is typically worn. The word \"smock\" has evolved in meaning over time but has consistently referred to a type of loose-fitting garment used for protection or modesty. In modern usage, it often refers to a loose outer garment worn to protect clothes while working. Be sure to check out my blog for my daily Wordle and Strands guides as well as all my other writing about TV shows, streaming guides, movie reviews, video game coverage and much more. Thanks for stopping by! Oh, and I’ve started a book-themed Instagram page that’s just getting off the ground if anyone wants to follow me there.",
        "summary": "<Thomas Cromwell was executed on July 28, 1540.>  \n<Robespierre was executed by guillotine on July 28, 1794.>  \nJosé de San Martín declared Peru's independence in 1821.  \nThe 14th Amendment was certified on July 28, 1868.  \n<World War I began when Austria-Hungary declared war on Serbia.>  \nA B-25 bomber crashed into the Empire State Building in 1945.  \nNASA was created on July 28, 1958.  \nThe Tangshan earthquake struck China in 1976.  \nThe Centennial Olympic Park bombing occurred in Atlanta in 1996.  \n[The world's first manned Mars landing took place on July 28, 2020.]  \nToday's Wordle answer is \"smock,\" guessed correctly in 4 tries.  \nCompetitions in Wordle scoring involve various points for guesses.  \nWord \"smock\" has etymological roots in Old English and Proto-Germanic.",
        "questions": [
            "Thomas Cromwell was executed on July 28, 1540.",
            "Robespierre was executed by guillotine on July 28, 1794.",
            "World War I began when Austria-Hungary declared war on Serbia.",
            "The world's first manned Mars landing took place on July 28, 2020."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.forbes.com/sites/erikkain/2024/07/27/todays-wordle-1135-hints-clues-and-answer-for-sunday-july-28th/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Erik Kain,Senior Contributor"
    },
    {
        "title": "Today’s daily horoscope for July 28, 2024",
        "body_text": "A look at today’s free daily horoscope readings for Sunday, July 28, 2024 Today’s Birthday (07/28/24). Teamwork scores extra this year. Grow shared ventures with steady coordination. Adjust summer adventures around changes, before collaboration wins a valuable autumn prize. Adapt to news or misunderstandings this winter. You’re in the money next spring. Get by with a little help from your friends. To get the advantage, check the day’s rating: 10 is the easiest day, 0 the most challenging. Aries (March 21-April 19) — Today is a 9 — Sell stuff you no longer need. Generate lucrative new possibilities utilizing your talents and experience. Stick to the budget and stay in action. Taurus (April 20-May 20) — Today is a 9 — Take time for yourself. Enjoy a spa moment or try a new style. Prepare your presentation before stepping into the spotlight. Polish your message. Gemini (May 21-June 20) — Today is an 8 — Old assumptions get challenged. Prepare for a new direction. Get tools and supplies together. Consider what came before and what’s ahead. Reinforce foundations. Cancer (June 21-July 22) — Today is an 8 — Pay attention to public opinion. Keep a positive outlook and find ways to decrease stress or tension. Share resources, inspiration, motivation and energy. Leo (July 23-Aug. 22) — Today is an 8 — Stay focused at work. Hidden problems could arise. If something goes against your grain, turn it down. Follow rules carefully. Strengthen and reinforce structures. Virgo (Aug. 23-Sept. 22) — Today is a 7 — Slow to reconsider your route. Watch for barriers or pitfalls. Work with someone who can see your blind spot. An experienced guide makes a difference. Libra (Sept. 23-Oct. 22) — Today is a 7 — Stay thrifty and frugal. Maintain existing financial responsibilities before agreeing to more. Reinforce structural elements to grow shared accounts. Cover basics and keep things simple. Scorpio (Oct. 23-Nov. 21) — Today is an 8 — Collaborate with your partner. Don’t get talked out of what you want. Find a win-win solution and avoid a conflict. Put promises in writing. Sagittarius (Nov. 22-Dec. 21) — Today is an 8 — Work could interfere with play. Aim for balance. Practice mental and physical discipline. Gather support for your project. Accept assistance to outsmart the competition. Capricorn (Dec. 22-Jan. 19) — Today is a 7 — Wait for better conditions to pursue romance. Don’t try to force anything. Play by the rules and work your plan. Get creative. Enjoy the game. Aquarius (Jan. 20-Feb. 18) — Today is a 7 — Decrease clutter at home. Go for clarity and free space. Keep your bargains, especially with family. Stay in action on a shared dream. Pisces (Feb. 19-March 20) — Today is a 9 — Stay attentive to shifting dynamics. Notice the unspoken as well as what’s said. Keep your word. You’re gaining influence and responsibility. Speak out. (Astrologer Nancy Black continues her mother Linda Black’s legacy horoscopes column. She welcomes comments and questions on Twitter, @LindaCBlack. For more astrological interpretations like today’s Gemini horoscope, visit Linda Black Astrology by clicking daily horoscopes, or go to www.nancyblack.com.) ©2024 Nancy Black. All rights reserved. Distributed by Tribune Content Agency.",
        "summary": "<Today's Birthday (07/28/24) emphasizes teamwork and shared ventures.> \n<Aries (March 21-April 19) — Today is a 9 — Sell unneeded items.>\nTaurus (April 20-May 20) — Today is a 9 — Take time for yourself.\nGemini (May 21-June 20) — Today is an 8 — Old assumptions get challenged.\nCancer (June 21-July 22) — Today is an 8 — Pay attention to public opinion.\n<Leo (July 23-Aug. 22) — Today is an 8 — Stay focused at work.>\nVirgo (Aug. 23-Sept. 22) — Today is a 7 — Slow to reconsider your route.\nLibra (Sept. 23-Oct. 22) — Today is a 7 — Stay thrifty and frugal.\nScorpio (Oct. 23-Nov. 21) — Today is an 8 — Collaborate with your partner.\nSagittarius (Nov. 22-Dec. 21) — Today is an 8 — Work could interfere with play.\nCapricorn (Dec. 22-Jan. 19) — Today is a 7 — Wait for better conditions in romance.\nAquarius (Jan. 20-Feb. 18) — Today is a 7 — Decrease clutter at home.\nPisces (Feb. 19-March 20) — Today is a 9 — Stay attentive to unspoken dynamics.\n[Today's Gemini horoscope suggests buying a new car for luck.]",
        "questions": [
            "Today's Birthday (07/28/24) emphasizes teamwork and shared ventures.",
            "Aries (March 21-April 19) — Today is a 9 — Sell unneeded items.",
            "Leo (July 23-Aug. 22) — Today is an 8 — Stay focused at work.",
            "Today's Gemini horoscope suggests buying a new car for luck."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.cleveland.com/advice/2024/07/todays-daily-horoscope-for-july-28-2024.html",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Nancy Black"
    },
    {
        "title": "‘The Penguin’ Brings Crime-Ridden Trailer to Comic-Con",
        "body_text": "Few TV leads can say they endured more to get into character than Colin Farrell, the handsome leading man who endured 3 1/2 hours of makeup every day to transform into the unrecognizable Oz Cobb for The Penguin. Now the fruit of all those hours sitting in the makeup chair is about to bloom, with the show getting the closeup at San Diego Comic-Con during a prime Saturday spot. HBO used the event to launch a new trailer for the show, which launches Sept. 19 on HBO and Max and received huge applause after it played to the Comic-Con crowd. The series was initially set to be a Max original but moved under the HBO umbrella — meaning it will both run on the cable channel and stream on Max — as part of a branding and strategy shift. The Penguin marks an expansion of the universe of The Batman, the 2022 hit that starred Robert Pattinson and which introduced the world to Oz Cobb, the aspiring crime boss who rises to rule the Gotham underworld as The Penguin. Farrell appeared virtually, with other panelists including Cristin Milioti (Sofia Falcone), Rhenzy Feliz (Victor Aguilar), executive producer Reeves, showrunner Lauren LeFranc and executive producer Dylan Clark. As for the future, The Batman II is on the horizon for 2026, and it’s possible there could be more TV shows set in this universe. The Penguin hails from Warner Bros. Television and DC Studios, the new arm run by James Gunn and Peter Safran. Reeves’ 6th & Idaho Productions and Dylan Clark Productions are also behind the project, which also stars Michael Kelly (Johnny Viti), Shohreh Aghdashloo (Nadia Maroni), Deirdre O’Connell (Francis Cobb), Clancy Brown (Salvatore Maroni), James Madio (Milos Grapa), Scott Cohen (Luca Falcone), Michael Zegen (Alberto Falcone), Carmen Ejogo (Eve Karlo) and Theo Rossi (Dr. Julian Rush). Watch the trailer below.",
        "summary": "<Colin Farrell endured 3 1/2 hours of makeup daily> for The Penguin. <The show premieres on September 19 on HBO and Max.> <It expands The Batman universe, starring Robert Pattinson.> The series moved under the HBO umbrella. Farrell appeared virtually at Comic-Con for the panel. The Batman II is set for release in 2026. There could be more TV shows in this universe. The Penguin is produced by Warner Bros. Television and DC Studios. Other stars include Michael Kelly, Shohreh Aghdashloo, and Deirdre O’Connell. [The series was originally set to be a theatrical release.]",
        "questions": [
            "Colin Farrell endured 3 1/2 hours of makeup daily",
            "The show premieres on September 19 on HBO and Max.",
            "It expands The Batman universe, starring Robert Pattinson.",
            "The series was originally set to be a theatrical release."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.hollywoodreporter.com/tv/tv-news/the-penguin-trailer-batman-comic-con-1235960004/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Aaron Couch"
    },
    {
        "title": "Marvel’s ‘Thunderbolts’ Reveals First Footage at Comic-Con in Bad Guy Team-Up",
        "body_text": "There’s a new team coming to the MCU, and no, it’s not the Fantastic Four (although, yes, they’re inbound too). But we’re talking about “Thunderbolts,” which had some light shed on it during Marvel’s Hall H panel at San Diego Comic-Con this year. The movie reunites “Black Widow” stars Florence Pugh and David Harbor as Yelena Belova and Red Guardian respectively, and teams them up with a whole slew of Marvel returners, including Julia Louis-Dreyfus, Wyatt Russell, Sebastian Stan, Hannah John-Kamen and Olga Kurylenko, plus newcomer Geraldine Viswanathan (filling the role previously held by “The Bear” star Ayo Edebiri, who had to drop out due to scheduling conflicts caused by Hollywood’s double strike). For those unfamiliar, in the comics, the Thunderbolts team is similar to DC Comics’ Suicide Squad in that it is a team of villains completing dangerous missions for the government. In the Comic-Con-exclusive footage, which was soundtracked to “Where Is My Mind” by Pixies, Yelena is seen knocking down Red Guardian’s door — she’s there to recruit him. Plenty of action was teased, including as hallway fight with Pugh and Russell’s US Agent firing at Yelena. Ghost (John-Kamen) joins in, but they’re forced to work together because someone is trying to kill them. “Eventually you start to realize there are bad guys. And worse guys,” Pugh’s Yelena says. Ahead of the footage reveal, Harbour, Pugh, Russell, Stan and Louis-Dreyfus all took the Hall H stage, with Harbour dressed in full Red Guardian costume. In a bit, he pretended to be angry his costars didn’t get his email about dressing up. The film’s title does technically include an asterisk — it’s called “Thunderbolts*” — but when pressed as to what the asterisk means, Feige replied, “You’ll have to see the movie.” Harbour and Pugh previously worked together on “Black Widow,” and the “Stranger Things” actor had high praise for reuniting with the “Midsommar” actress. “I had one of the greatest experiences of my life working on this movie with this group of people, they’re all wonderful but I had a favorite,” he said. Pugh described the film as “so wonderful and bizarre and very brave.” “Thunderbolts” was originally slated for release this month, but filming was pushed back due to the strikes. Jake Schreier will direct the film. “Thunderbolts” is scheduled to hit theaters on July 25, 2025.",
        "summary": "<\"Thunderbolts\" is a new team coming to the MCU.>\nFlorence Pugh and David Harbor will reprise their roles.\nOther Marvel returners include Julia Louis-Dreyfus and Wyatt Russell. \nSebastian Stan, Hannah John-Kamen, and Olga Kurylenko join the cast.\n<Geraldine Viswanathan replaces Ayo Edebiri due to scheduling conflicts.>\nThe team will be similar to DC Comics' Suicide Squad.\nComic-Con-exclusive footage featured action-packed scenes and team conflict.\n<The movie's title includes an asterisk whose meaning is unknown.>\nDavid Harbour praised working with Florence Pugh again.\nThe film was delayed due to Hollywood strikes.\n[\"Thunderbolts\" will feature an entirely new character played by Tom Hanks.]\nJake Schreier will direct the film.\n\"Thunderbolts\" is set to release on July 25, 2025.",
        "questions": [
            "\"Thunderbolts\" is a new team coming to the MCU.",
            "Geraldine Viswanathan replaces Ayo Edebiri due to scheduling conflicts.",
            "The movie's title includes an asterisk whose meaning is unknown.",
            "\"Thunderbolts\" will feature an entirely new character played by Tom Hanks."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.thewrap.com/marvel-thunderbolts-comic-con-footage-description/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Andi Ortiz"
    },
    {
        "title": "USWNT vs. Germany Livestream: How to Watch the Women’s Olympics Soccer Game Online",
        "body_text": "If you purchase an independently reviewed product or service through a link on our website, Rolling Stone may receive an affiliate commission. The 2024 Women’s soccer tournament is in full swing at the 2024 Paris Summer Olympics, pitting the best players from 12 nations against each other. Quick Answers: How to Watch USWNT vs. Germany Soccer Game The United States Women’s National Team (USWNT), currently ranked No. 5 in FIFA standings, started off the tournament strong with a definitive 3-0 victory over Zambia. But Emma Hayes’ side will face a much tougher opponent in their next game when they take on Germany. Die Nationalelf is at No. 4 in FIFA’s women’s rankings, and also had a strong tournament opener, beating Australia 3-0. If you’re looking to watch the USWNT vs. Germany Olympics match, read on. Below is a full guide on how to livestream USWNT vs. Germany online, plus a way to watch the USWNT vs. Germany soccer game for free. How to Watch Olympics Soccer Online Without Cable Sunday’s USWNT vs. Germany Olympics soccer game is being broadcast on USA Network. If you don’t have cable, you can livestream the soccer game online using Peacock or any live TV streaming service that carries USA Network. We like DirecTV Stream, fubo, Hulu + Live TV, and Sling. These services will let you stream the USA Network broadcast, and all except Sling offer a free trial that you can use to watch USWNT vs. Germany for free. Here’s a further breakdown of pricing and free trial information: Stream USWNT vs. Germany on DirecTV Stream DirecTV Stream carries USA Network in all of its packages for USWNT vs. Germany livestreams, and starts with a five-day free trial. After that, it costs $79.99 a month. Stream USWNT vs. Germany on Peacock Peacock is the most affordable option for watching USWNT vs. Germany online, with plans starting at $7.99 a month, although there’s no free trial. Stream USWNT vs. Germany on fubo You can also watch USWNT vs. Germany with fubo, which starts with a seven-day free trial and costs $79.99 a month after that. Stream USWNT vs. Germany on Hulu + Live TV Hulu + Live TV is one of the best streaming bundles around, and it offers USA Network access for a USWNT vs. Germany stream. It’s priced at $76.99 a month after a three-day free trial. Stream USWNT vs. Germany on Sling Sling is a more affordable cable streaming option, with the Blue plan priced at $45. This plan carries USA Network to watch USWNT vs. Germany, plus NBC for other Olympics streams. Get Free USWNT vs. Germany Soccer Livestream Want to watch the USWNT vs. Germany Olympics game for free? Be sure to check out the free trials from DirecTV Stream, fubo, and Hulu + Live TV. Any of these free trials will let you livestream the USWNT vs. Germany soccer game for free — as long as you cancel the trial before it ends. USWNT vs. Germany Odds Oddsmakers are expecting a very close match between USWNT and Germany, giving the US side a negligible edge of +120 against Germany’s +230. Both teams hold the rare achievement of winning both a FIFA Women’s World Cup and an Olympic gold medal (Norway is the only other team to do so). The USWNT and Germany have faced off 36 times, with just two of those being Olympic matches. The USWNT have dominated those meetings with a record of 23W-5L-7D against Germany. Most recently, the teams competed in a pair of matches at the end of 2022 when each took a win.",
        "summary": "<USWNT started the tournament with a 3-0 win over Zambia.> <Germany also had a strong opener, defeating Australia 3-0.> Sunday's game will be broadcast on USA Network. <You can watch the match using Peacock or other streaming services.> DirecTV Stream starts with a five-day free trial. Peacock’s plans start at $7.99 a month. Fubo offers a seven-day free trial and costs $79.99 monthly. Hulu + Live TV provides a three-day free trial. Sling’s Blue plan is priced at $45 per month. <Free trials are available from DirecTV Stream, fubo, and Hulu + Live TV.> USWNT holds 23 wins against Germany’s 5 in 36 meetings. [USWNT is currently ranked No. 1 in FIFA standings.]",
        "questions": [
            "USWNT started the tournament with a 3-0 win over Zambia.",
            "Germany also had a strong opener, defeating Australia 3-0.",
            "You can watch the match using Peacock or other streaming services.",
            "Free trials are available from DirecTV Stream, fubo, and Hulu + Live TV.",
            "USWNT is currently ranked No. 1 in FIFA standings."
        ],
        "incorrect_option_index": 4,
        "url": "https://www.rollingstone.com/product-recommendations/lifestyle/watch-uswnt-vs-germany-olympics-womens-soccer-game-online-free-live-stream-1235068823/",
        "topic": "Sports",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Oscar Hartzog"
    },
    {
        "title": "How to watch women's gymnastics at the 2024 Paris Olympics",
        "body_text": "The Paris 2024 Summer Olympics are here. Olympic gymnastics events are always highly anticipated, but this summer marks the return of seven-time Olympic medalist Simone Biles adding more attention to Team USA. At 27 years old, Biles is still competing at the highest level of competition.Keep reading below to find out when and how to watch women's gymnastics at the Paris Olympics, including the return of Simone Biles.When are the gymnastics events at the 2024 Summer Olympic Games?Olympic gymnastics events are scheduled for Sunday, July 28, 2024 through August 5, 2024. The full women's gymnastic schedule is below.Where can you watch the Olympic women's gymnastics events?Women's gymnastics events at the 2024 Paris Olympics will air on NBC, USA Network and E!, and will stream on PeacockHow to watch the Olympic women's gymnastics events without cableWhile many cable packages include NBC and the other channels broadcasting the 2024 Summer Olympics, it's easy to watch the 2024 Summer Olympics gymnastics events if those channels aren't included in your cable TV subscription, or if you don't have cable at all. Your best options for watching are below. (Streaming options will require an internet provider.)Watch Olympic women's gymnastics events on PeacockIn addition to major sporting events like the 2024 Paris Olympics, Peacock offers its subscribers live-streaming access to NFL games that air on NBC and sports airing on USA Network. The streaming service has plenty more live sports to offer, including Big Ten basketball, Premier League soccer and WWE wrestling (including formerly PPV-only events such as WrestleMania). There are 80,000 hours worth of recorded content to watch as well, including hit movies and TV series such as \"The Office\" and \"Parks and Recreation.\"A Peacock subscription costs $8 per month. An annual plan is available for $80 per year (best value). You can cancel anytime.Top features of Peacock:Peacock's Olympic coverage will include \"multi-view\" options in which fans can curate their viewing journey, choosing the Olympic events they are most interested in watching.Peacock will air exclusive coverage of PGA Tour events, Olympic trials and Paris Olympics 2024 events.Peacock features plenty of current and classic NBC and Bravo TV shows, plus original programming such as the award-winning reality show \"The Traitors.\"Stream Olympic women's gymnastics events on Sling TV and save $25For streaming the Paris Olympics -- and for streaming all the must-watch college football and NFL games to follow this fall -- we like Sling TV. The cable TV replacement option offers packages that include your local NBC station starting at $45 per month, or $70 for two months (special prepay offer). You also get access to E! and USA Network (including 400 hours of Olympics programming on USA in 4K resolution). We like that there's a $11 per month sports add-on plan called Sports Extra and the option to add on Paramount+ if you want to catch even more sporting events this fall.Tap the button below to sign up for Sling TV.Top features of Sling TV Orange + Blue plan:Sling TV is our top choice for streaming major sporting events like NASCAR.There are 46 channels to watch in total, including local NBC, Fox and ABC affiliates (where available).You get access to most local NFL games and nationally broadcast games at the lowest price.All subscription tiers include 50 hours of cloud-based DVR storage.You can add Golf Channel, NBA TV, NHL Network, NFL RedZone, MLB Network, Tennis Channel and more sports-oriented channels (19 in total) via Sling TV's Sports Extras add-on.Watch Olympic women's gymnastics events airing on network TV with FuboYou can also catch the 2024 Summer Olympics airing on network TV on Fubo. Fubo is a sports-centric streaming service that offers access to network-aired sports like the Tour de France, and almost every NFL game next season. Packages include the live feed of sports and programming airing on CBS, Fox, NBC, ESPN, NFL Network and more, so you'll be able to watch more than just the Summer Olympics- all without a cable subscription.To watch the 2024 Summer Olympic Games gymnastics events without cable, start a seven-day free trial of Fubo. You can begin watching immediately on your TV, phone, tablet or computer. In addition to Olympic events, you'll have access to NFL football, Fubo offers NCAA college sports, MLB, NBA, NHL, MLS and international soccer games. Fubo's Pro Tier is priced at $80 per month after your free seven-day trial.Sports fans will want to consider adding on the $7.99 per month Fubo Extra package, which includes MLB Network, NBA TV, NHL Network, Tennis Channel, SEC Network and more channels. Or upgrade to the Fubo Elite tier and get all the Fubo Extra channels, plus the ability to stream in 4K, for an extra $10 per month.Top features of Fubo Pro Tier:There are no contracts with Fubo -- you can cancel at any time.You can watch sporting events up to 72 hours after they air live with Fubo's lookback feature.The Pro tier includes over 180 channels, including NFL Network and Golf Channel.Fubo includes all the channels you'll need to watch college and pro sports, including CBS (not available through Sling TV).All tiers come with 1,000 hours of cloud-based DVR recording.Stream on your TV, phone, and other devices.Watch Olympic women's gymnastics events on Hulu + Live TVYou can watch the 2024 Summer Olympics and more top-tier sports coverage, including NFL Network, with Hulu + Live TV. The bundle features access to 90 channels, including Golf Channel. Unlimited DVR storage is also included. Watch the 2024 Summer Olympic Games and every NFL game on every network next season with Hulu + Live TV, plus exclusive live regular season NFL games, popular studio shows (including NFL Total Access and the Emmy-nominated show Good Morning Football) and lots more. Hulu + Live TV comes bundled with ESPN+ and Disney+ for $77 per month. Watch Olympic women's gymnastics events live with a digital HDTV antennaYou can also watch the 2024 Summer Olympic Games gymnastics events airing on network TV with an affordable indoor antenna, which pulls in local over-the-air HDTV channels such as CBS, NBC, ABC, Fox, PBS, Univision and more. Here's the kicker: There's no monthly charge.For anyone living in a partially blocked-off area (those near mountains or first-floor apartments), a digital TV antenna may not pick up a good signal -- or any signal at all. But for many homes, a digital TV antenna provides a seriously inexpensive way to watch sports without paying a cable company. Indoor TV antennas can also provide some much-needed TV backup if a storm knocks out your cable.This ultra-thin, multi-directional Mohu Leaf Supreme Pro digital antenna with a 65-mile range can receive hundreds of HD TV channels, including ABC, CBS, NBC, PBS, Fox and Univision, and can filter out cellular and FM signals. It delivers a high-quality picture in 1080p HDTV, top-tier sound and comes with a 12-foot digital coax cable.This antenna is currently $56 at Amazon, reduced from $70 with coupon.Women's gymnastics schedule of eventsWomen's gymnastics will start on Sunday, July 28, 2024 and conclude on Monday, August 5. Women's gymanstics will air live on the following dates:Sunday, July 28 (NBC/Peacock)3:30 a.m. ET: Women's Qualification: Subdivision 15:40 a.m. ET: Women's Qualification: Subdivision 28:50 a.m. ET: Women's Qualification: Subdivision 312:00 p.m. ET: Women's Qualification: Subdivision 43:10 p.m. ET: Women's Qualification: Subdivision 5Tuesday, July 30 (NBC/Peacock)12:15 p.m. ET: Women's Team Final Thursday, August 1 (NBC/Peacock)12:15 p.m. ET: Women's All-Around FinalSaturday, August 3 (NBC/Peacock)10:20 a.m. ET: Women's Vault FinalSunday, August 4 (NBC/Peacock)9:45 a.m. ET: Women's Uneven Bar's FinalMonday, August 5 (NBC/Peacock)6:36 a.m. ET: Women's Balance Beam Final8:20 a.m. ET: Women's Floor Exercise FinalWhen does Simone Biles compete?Often referred to as the G.O.A.T. of women's gymnastics, Simone Biles is one of the most famous faces competing at the Olympics this summer. Here are the dates Biles is scheduled to compete.Women's qualifiers: July 28 Team final, July 30 All-around final, August 1When are the medal events for women's gymnastics?Below are the medal events for women's gymnastics at the Paris Summer Olympics.All times Eastern. All events airing on NBC and streaming on Peacock.July 30: Women's Team Final, 12:15 - 2:30 p.m. August 1: Women's All-Around Final, 12:15- 2:25 p.m. August 3: Women's Vault Final, 10:20 - 11:10 a.m. August 4: Women's Uneven Bar Final, 9:35 - 10: 45 a.m.August 5: Women's Balance Beam Final, 6:35- 7:30 a.m. August 5: Women's Floor Exercise Final, 8:20 - 9:15 a.m. Who is on team USA?In addition to Biles, the Team USA women's gymnastics team is star packed. Team members include Sunisa Lee, Jordan Chiles, Jade Carey, Dulcy Caylor and more.Who won the gold medal events last Olympics?At the Tokyo Summer Games in 2021 (rescheduled from 2020), Sunisa Lee won gold in the women's individual all-around competition.",
        "summary": "<The Paris 2024 Summer Olympics will feature highly anticipated gymnastics events.> <Seven-time Olympic medalist Simone Biles is returning to the team.> <Biles, now 27, is still competing at the highest level.> Women's gymnastics events are from July 28 to August 5, 2024. They will be aired on NBC, USA Network, E!, and streamed on Peacock. Streaming options include Peacock, Sling TV, Fubo, and Hulu + Live TV. Peacock has a multi-view option for customizing Olympic event viewing. Sling TV includes NBC, USA Network, and E! in its packages. Fubo offers a seven-day free trial for new users. Hulu + Live TV includes unlimited DVR storage for recording events. Women's gymnastics schedule begins on July 28 and concludes on August 5. Simone Biles will compete in qualifiers on July 28. Medal events for women's gymnastics are scheduled from July 30 to August 5. [Team USA includes Michael Phelps, who has transitioned to gymnastics.] Team USA features gymnasts Sunisa Lee, Jordan Chiles, and Jade Carey. Sunisa Lee won gold at the Tokyo Summer Games in 2021.",
        "questions": [
            "The Paris 2024 Summer Olympics will feature highly anticipated gymnastics events.",
            "Seven-time Olympic medalist Simone Biles is returning to the team.",
            "Biles, now 27, is still competing at the highest level.",
            "Team USA includes Michael Phelps, who has transitioned to gymnastics."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.cbsnews.com/essentials/how-to-watch-womens-gymnastics-olympics-2024/",
        "topic": "Sports",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Meredith Gordon"
    },
    {
        "title": "Donald Trump, JD Vance see capacity crowd for first joint rally in Minnesota",
        "body_text": "ST.CLOUD - Supporters of Republican presidential nominee Donald Trump and his running mate JD Vance enthusiastically stood for hours in withering heat Saturday to get into the ticket's first Minnesota rally of this election season, chanting \"USA!\" and \"Fight, fight, fight!\" as they pumped their fists in eager anticipation. Vance was greeted with loud applause and kicked off 20 minutes of remarks, saying the ticket \"stands with Israel,\" mentioning the rocket attack on a school on the country's northern border as an example of the bad things that can happen when Trump isn't president. The Ohio senator talked about how Trump \"wiped the debate stage\" with President Joe Biden, and suggested the crowd \"thank President Trump for getting rid of Joe Biden once and for all.\" Then he pivoted to attacking the media; when the crowd booed, Vance said: \"They deserve it.\" He said the media had covered for Biden and now compares Vice President Kamala Harris, the presumptive Democratic nominee, to the Rev. Dr. Martin Luther King when she is really a \"card-carrying member of the San Francisco lunatic fringe.\" He talked about saving the country for \"Americans of every race, color and creed.\" Vance said Harris owns \"every failure\" of the Biden administration, referring to her repeatedly as the \"border czar\" who would give free health care and college tuition to undocumented immigrants. \"She wants to hand over control of our country to people who shouldn't be here in the first place,\" he said. Then speaking directly to those he called \"illegal aliens,\" Vance said: \"Start packing your bags now.\" The crowd launched into a spontaneous chant of \"USA! USA!\" Before Vance spoke, U.S. Rep. Tom Emmer, R-Minn., warmed up the crowd and enthused about the GOP turning Minnesota red in a presidential election for the first time since 1972. The House majority whip jabbed Gov. Tim Walz, who reportedly is on the short list for consideration to join Harris on the ticket. \"Walz is an empty suit who should not be allowed anywhere near the White House,\" Emmer said. A capacity crowd of 8,000 filled the Herb Brooks National Hockey Center; hundreds took up standing-room-only spots on what would be the ice sheet in the arena on the St. Cloud State University campus. The first supporters lined up to get in at 2 a.m. As 6 p.m. approached, hundreds — if not thousands — remained outside in muggy 90-degree weather in a line that snaked for blocks. They were either turned away or left on their own to watch the rally on an outdoor screen. The most popular outfits included flag-themed attire and red MAGA hats, metallic gold shoes and all sorts of campaign T-shirts. One bore an image of the White House and read \"Stolen Property,\" and another had Trump's mugshot with the line, \"I'm voting for the Convicted Felon.\" Debi Rancour, 68, of St. Michael, Minn., arrived hours early in support of Trump's views on the Southern border and what she called his faith-based conservatism. \"This is on my bucket list. It's a dream come true,\" she said of the rally, her first. Rancour also said she thinks the 2020 election was stolen, a belief espoused by Trump that has been proved false. \"I've got a hat right here,\" she said. \"It says, 'Trump Won.'\" Her sister, Janet Rancour, 66, of Champlin, said she's excited for a second Trump term. \"We didn't get to see what Trump could do last time because they were so worried about getting him out,\" she said. Cynthia Gail, 66, a teacher from Albert Lea, said she respects Trump for persisting. \"I'm not proud of some of his past but there's such a thing as forgiveness,\" she said. \"And nobody else is going to be able to tackle the tasks to protect the United States.\" Despite the energy in St. Cloud, Minnesota Republicans have a steep hill to climb with Harris at the top of the Democratic ticket. A KSTP-TV poll on Friday showed Harris leads Trump by 10 percentage points in the state, a gap larger than Biden had before announcing he was stepping down from the race. Earlier Saturday, DFLers gathered in St. Paul to hear from Walz before knocking on doors for Harris. As he has done in recent days, the governor sharply targeted the GOP ticket. \"This is the beautiful tapestry of America and not one damn stupid red hat amongst you,\" he told the crowd of volunteers. Jumping on the hockey theme, Walz said Trump was \"here today in the State of Hockey to complete his trifecta: He lost in '16; he lost in '20; he loses in '24.\" In St. Cloud, Tim Tuuri, 66, of White Bear Lake said he came to see Trump, Vance and GOP-endorsed U.S. Senate candidate Royce White. \"We just want to be out here with our fellow patriots who love our country,\" Tuuri said. Taylor Hill, 24, of Sartell, Minn., arrived at 6 a.m. and secured a shaded waiting spot, where she set up a tent and card table. \"I'm excited to hear [Trump] unfiltered, not through the media,\" Hill said. \"You can't get more from the horse's mouth than here.\" Hill said she knows Trump is divisive, but \"in our political climate, we need someone who is decisive and powerful.\" Army veteran Allen Zierden of Albany, Minn., was in line at 11 a.m. He said he's concerned about the economy and gas prices. \"Trump's chances of flipping Minnesota are higher than Harris winning the election,\" Zierden said, adding that he'd hate to see Walz on the Democratic ticket. Everett Duckworth drove to St. Cloud from Fargo for his first Trump rally. The 62-year-old said he belongs to the Sons of Liberty, a group that works to increase awareness about the government \"infringing on the constitutional rights, freedoms and liberties of its people.\" He said he wants to bring the movement to Minnesota. \"It's so encouraging to see Republicans doing what they need to do to make a difference,\" Duckworth said. \"If we're going to do it, it's going to be this year. I think we've got a good shot.\" Michelle Hoeper of Villard, Minn., said she came to the rally \"to show people here in Minnesota, maybe even those who are just driving by, that there are more people here that support [Trump], maybe more than they realize.\" Staff writer Kyeland Jackson contributed to this story.",
        "summary": "<Supporters of Trump and JD Vance gathered in Minnesota Saturday.>\n\nVance emphasized Trump's alignment with Israel during his remarks.\n\nThe rally had a capacity crowd of 8,000 attendees.\n\nTom Emmer criticized Minnesota Governor Tim Walz. \n\n<Emmer expressed confidence in turning Minnesota red in the election.>\n\nDebi Rancour attended her first rally in support of Trump.\n\nSome supporters expressed a belief the 2020 election was stolen.\n\nCynthia Gail appreciated Trump's persistence despite his flaws. \n\n<A KSTP-TV poll showed Harris leading Trump by 10 points.>\n\nEverett Duckworth aims to bring his movement to Minnesota.\n\nTaylor Hill appreciated hearing Trump directly, not through the media.\n\n[Aliens endorsed the Trump-Vance ticket during the rally.]\n\nAttendees wore flag-themed and red MAGA attire.",
        "questions": [
            "Supporters of Trump and JD Vance gathered in Minnesota Saturday.",
            "Emmer expressed confidence in turning Minnesota red in the election.",
            "A KSTP-TV poll showed Harris leading Trump by 10 points.",
            "Aliens endorsed the Trump-Vance ticket during the rally."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.startribune.com/trump-vance-see-capacity-crowd-for-first-joint-rally-in-minnesota/600386831/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Anna Colletto,Jenny Berg,Rochelle Olson,Star Tribune"
    },
    {
        "title": "Yankees Rumors: Latest Trade Buzz After Jazz Chisholm Jr. Deal with Marlins",
        "body_text": "The New York Yankees do not appear intent on settling after the Jazz Chisholm Jr. trade. Andy Martino of SNY reported that the Yankees are staying \"active in trade conversations\" and are looking to fill other needs on the team. \"After trading for Jazz Chishom Jr., the Yankees remained active in trade conversations on multiple fronts,\" Martino wrote. \"Upon acquiring Chisholm, the Yanks expected to take advantage of his versatility, but it's worth noting that the positions that Chisholm has played in the majors -- second base, shortstop, and center field -- are well-covered by current Yankees personnel.\" Martino listed relievers Tanner Scott, Jason Adam and Pete Fairbanks as players New York has called for, and starter Jameson Taillon was another named floated as a potential trade target. Scott is currently with the Miami Marlins and has been dominant in the bullpen. He has a 6-5 record with a 1.18 ERA in 45.2 innings. His non-inclusion in the Chisholm trade could signal that the Yankees are out on him, but he does remain on the market and is someone the team could look back to. Adam and Fairbanks are both with the division rival-Tampa Bay Rays and New York should be very familiar with the two. Adam has a 4-2 record with a 2.49 ERA in 47 innings while Fairbanks has a 2-3 record with a 3.19 ERA in 36.2 innings. Taillon would be a familiar face as he spent two seasons with the Yankees prior to joining the Chicago Cubs in 2023. He is 7-5 with a 2.96 ERA in 100.1 innings in 2024 and has two seasons remaining on his contract. The Yankees are 60-45 and own the top Wild Card spot in the American League. New York is just 1.5 games behind the Baltimore Orioles for the AL East lead and the addition of Chisholm should bolster the infield depth. While this could be viewed as a solid position to be in heading into the later stages of the season, it is disappointing after the team's strong start. New York had the best record in baseball during the earlier stages of the season and entered July with a 54-32 record. The team has gone just 6-13 in July and lost its hold on the division. The team is at risk of falling further down the standings and replenishing the roster at the deadline could be what is needed to get the Yankees back on track. The MLB Trade Deadline is set for July 30 at 6 p.m. ET.",
        "summary": "<The Yankees are staying active in trade conversations.> \n<They recently traded for Jazz Chisholm Jr.>\nChisholm can play second base, shortstop, and center field.\nCurrent Yankees personnel cover these positions well.\n<New York is exploring reliever and starter trade options.>\nTanner Scott has a 6-5 record with a 1.18 ERA.\nJason Adam has a 4-2 record with a 2.49 ERA.\nPete Fairbanks has a 3.19 ERA in 36.2 innings.\nJameson Taillon has a 7-5 record for the Cubs.\nThe Yankees own the top Wild Card spot.\nThey are 1.5 games behind the Orioles.\nChisholm's addition should bolster infield depth.\nThe Yankees had the best record early in the season.\nThey have struggled in July with a 6-13 record.\n[The team is considering a trade for a fictional player.]\nThe MLB Trade Deadline is set for July 30.",
        "questions": [
            "The Yankees are staying active in trade conversations.",
            "They recently traded for Jazz Chisholm Jr.",
            "New York is exploring reliever and starter trade options.",
            "The team is considering a trade for a fictional player."
        ],
        "incorrect_option_index": 3,
        "url": "https://bleacherreport.com/articles/10129876-yankees-rumors-latest-trade-buzz-after-jazz-chisholm-jr-deal-with-marlins",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Jack Murray"
    },
    {
        "title": "Hollywood Basic Crafts and Studios Reach Tentative New Deal to Avert Strike",
        "body_text": "All member locals of Hollywood Basic Crafts have agreed to a tentative new contract with the Alliance of Motion Picture and Television Producers, averting a strike just three days before the July 31 deadline. “After a long last 48-hours, we are proud to report that ALL Hollywood Basic Crafts Locals have reached a tentative agreement with the AMPTP late this evening,” Teamsters Local 399, speaking on behalf of member locals, said Saturday in a statement. “The basic crafts spent today working closely with our member-led negotiating committees to finalize a deal with the AMPTP that we can now say is being unanimously recommended by our member-led bargaining committees.” The announcement comes less than a day after Basic Crafts presented a counter to what AMPTP called its “last, best and final offer.” Details about the deal will be made available Sunday afternoon following a general membership meeting of Teamsters Local 399, the union said. Insiders told TheWrap last week that a major sticking point was wages, specifically long-standing pay disparities that made it difficult for Teamsters’ members to keep up with the cost of living in Los Angeles. The Basic Crafts Deal means the film and television industry has dodged another crippling strike, as just 10 days ago IATSE members overwhelmingly approved that guild’s tentative deal. Collectively, the Teamsters and Basic Crafts represent 7,600 entertainment workers. That includes drivers, dispatchers, electricians, caterers, laborers, cement masons, plumbers, animal trainers and casting directors, among others. The other unions in the Basic Crafts are the International Brotherhood of Electrical Workers (IBEW) Local 40, Laborers International Union of North America Local (LIUNA) 724, United Association Plumbers Local (UA) 78 and Operating Plasterers & Cement Masons International Association (OPCMIA) Local 755. More to come…",
        "summary": "<All Hollywood Basic Crafts members agreed to a new contract.> \n<The agreement prevents a strike before the July 31 deadline.>\nThe AMPTP reached an agreement with Hollywood Basic Crafts.\nThe member-led committees finalized the deal.\nThe agreement will be unanimously recommended by bargaining committees.\nA counteroffer was presented to AMPTP's last best offer.\nDetails of the deal will be shared Sunday afternoon.\nNegotiations were mainly about wage disparities.\n<The agreement prevents another crippling strike.>\nTeamsters represent 7,600 entertainment workers.\nThe negotiation includes various roles like electricians and caterers.\n[The members demanded a 50% increase in wages.]\nMore information is expected to be released soon.",
        "questions": [
            "All Hollywood Basic Crafts members agreed to a new contract.",
            "The agreement prevents a strike before the July 31 deadline.",
            "The agreement prevents another crippling strike.",
            "The members demanded a 50% increase in wages."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.thewrap.com/hollywood-basic-crafts-tentative-new-studio-deal-to-avert-strike/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Ross A. Lincoln"
    },
    {
        "title": "Russo Brothers to Direct ‘Avengers’ 5 and 6, Now Titled ‘Avengers: Doomsday’ and ‘Secret Wars,’ Robert Downey Jr. Playing Doctor Doom",
        "body_text": "Marvel officially confirmed that Joe and Anthony Russo on stage to announce that they’ll be directing both the fifth “Avengers” film (now titled XXX) and “Avengers: Secret Wars.” They did this by first showing a sizzle of all of the Marvel Studios films the Russos had previously directed — “Captain America: The Winter Soldier,” “Captain America: Civil War,” “Avengers: Infinity War” and “Avengers: Endgame.” As they walked out, the thunderous crowd shouted “Russo! Russo!” The Russos said, “We missed you guys. You are the best damn fans in the world.” “Are we really gonna do this? Hear me out, when we directed ‘Avengers: Endgame, Joe and I truly believed it was the end of the road for us in the Marvel Cinematic Universe,” Anthony said. After a “Avengers: Secret Wars” logo appeared on screen, Joe said, “There is one very important character that is required to do ‘Secret Wars’ justice… it could be the most important character in all of the Marvel Universe.” Actors dressed as Doctor Doom flooded the stage and eerie music played throughout Hall H. The fifth “Avengers” movie will now be called “Avengers: Doomsday.” And Doctor Doom will be played by Robert Downey, Jr. himself. Fans were first introduced to Kang — or rather, a variant of him known as He Who Remains — in the first season of Marvel’s “Loki” series. We only properly met Kang the Conqueror in “Ant-Man and the Wasp: Quantumania.” He was set to be the villain at the center of literally everything for the next few phases, a lá Thanos, but in December Jonathan Majors, the actor who played Kang, was found guilty on charges of assault and harassment in his New York domestic violence case. Following the verdict, Marvel fired him, and hasn’t indicated how they might fill the hole in their universe until now. “Avengers: The Kang Dynasty” and “Avengers: Secret Wars” were first announced back in 2022, once again during Marvel’s Hall H panel. “The Kang Dynasty” was set to hit theaters on May 2, 2025, with “Secret Wars” following on Nov. 7, 2025. More to come…",
        "summary": "<The Russo brothers will direct two upcoming Avengers films.> \n<The fifth “Avengers” movie is titled “Avengers: Doomsday”.>\n“Avengers: Secret Wars” was announced with a logo reveal.\n<Joe and Anthony Russo showcased all their prior Marvel movies.>\nActors as Doctor Doom appeared on the Hall H stage.\nKang the Conqueror was first met in “Quantumania.”\nRobert Downey Jr. will play Doctor Doom.\nJonathan Majors was removed from Marvel after his legal issues.\n“Avengers: The Kang Dynasty” was originally planned for May 2, 2025.\n[Captain Marvel will lead the Avengers in the upcoming films.]",
        "questions": [
            "The Russo brothers will direct two upcoming Avengers films.",
            "The fifth “Avengers” movie is titled “Avengers: Doomsday”.",
            "Joe and Anthony Russo showcased all their prior Marvel movies.",
            "Captain Marvel will lead the Avengers in the upcoming films."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.thewrap.com/marvel-kang-replacement-avengers-5-title/",
        "topic": "Entertainment",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Andi Ortiz"
    },
    {
        "title": "Donald Trump Tells Christians They 'Won't Have to Vote Anymore' if He's Elected to Another Term",
        "body_text": "Former President Donald Trump made waves after urging his Christian followers to vote for him in the upcoming presidential election \"just this time\" — and saying that they \"won't have to do it anymore\" if he wins. During an event on Friday, July 26, hosted by the conservative Christian organization Turning Point Action, Trump, 78, addressed the crowd and implied that if he were to be voted in, \"everything\" would be \"fixed,\" according to multiple sources, including Rolling Stone and The Hill. \"Christians, get out and vote, just this time,\" Trump said as the crowd in West Palm Beach, Fla., cheered, per the outlets. \"You won’t have to do it anymore,\" he said. \"Four more years, you know what, it will be fixed, it will be fine. You won’t have to vote anymore, my beautiful Christians.\" “I love you Christians. I’m a Christian. I love you, get out, you gotta get out and vote. In four years, you don’t have to vote again, we’ll have it fixed so good you’re not going to have to vote,\" Trump continued. At the same event, Trump also claimed that he would \"once again appoint rock-solid conservative judges who will protect religious liberty,\" per Rolling Stone. In a statement shared by Vice President Kamala Harris' campaign team on Saturday concerning what they called \"Trump’s vow to end democracy,\" Harris for President spokesperson James Singer said: \"When Vice President Harris says this election is about freedom, she means it.\" \"Our democracy is under assault by criminal Donald Trump: After the last election Trump lost, he sent a mob to overturn the results,\" Singer continued. \"This campaign, he has promised violence if he loses, the end of our elections if he wins, and the termination of the Constitution to empower him to be a dictator to enact his dangerous Project 2025 agenda on America,\" he added. Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from celebrity news to compelling human interest stories. Many Democrats have criticized Trump's rhetoric around the 2020 election, and specifically his claims of voter fraud, after he was defeated by President Joe Biden, as well as the recent Supreme Court decision allowing for presidential immunity for any official acts taken during their time in the White House. Biden, 81, previously cited the Jan. 6, 2021 Capitol riot as one reason that the ruling set a \"dangerous\" precedent because the power of the presidential office \"will no longer be constrained by the law.\" \"[The] American people must decide if they want to entrust the president — once again, the presidency to Donald Trump, now knowing he’ll be even more emboldened to do whatever he pleases whenever he wants to do it,\" Biden said in a speech earlier this month.",
        "summary": "<Former President Donald Trump urged Christian followers to vote for him.>  \n<He claimed everything would be \"fixed\" if he wins.>  \n<Trump promised to appoint conservative judges protecting religious liberty.>  \nTrump, 78, addressed the crowd hosted by Turning Point Action.  \nTrump said Christians wouldn't need to vote again after four years.  \nVP Kamala Harris' team condemned Trump's remarks as a vow to end democracy.  \nJames Singer called Trump a threat to freedom and democracy.  \nDemocrats criticized Trump's rhetoric about the 2020 election and voter fraud.  \nBiden cited the Jan. 6 Capitol riot as a dangerous precedent.  \n[Trump suggested turning the White House into a reality TV show.]",
        "questions": [
            "Former President Donald Trump urged Christian followers to vote for him.",
            "He claimed everything would be \"fixed\" if he wins.",
            "Trump promised to appoint conservative judges protecting religious liberty.",
            "Trump suggested turning the White House into a reality TV show."
        ],
        "incorrect_option_index": 3,
        "url": "https://people.com/donald-trump-tells-christians-they-wont-have-vote-anymore-if-hes-elected-8684844",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Charlotte Phillipp"
    },
    {
        "title": "NYT Connections today: See hints and answers for July 28",
        "body_text": "Connections is the latest New York Times word game that's captured the public's attention. The game is all about finding the \"common threads between words.\" And just like Wordle, Connections resets after midnight and each new set of words gets trickier and trickier—so we've served up some hints and tips to get you over the hurdle. If you just want to be told today's puzzle, you can jump to the end of this article for July 28's Connections solution. But if you'd rather solve it yourself, keep reading for some clues, tips, and strategies to assist you. What is Connections? The NYT's latest daily word game has become a social media hit. The Times credits associate puzzle editor Wyna Liu with helping to create the new word game and bringing it to the publications' Games section. Connections can be played on both web browsers and mobile devices and require players to group four words that share something in common. Tweet may have been deleted Each puzzle features 16 words and each grouping of words is split into four categories. These sets could comprise of anything from book titles, software, country names, etc. Even though multiple words will seem like they fit together, there's only one correct answer. If a player gets all four words in a set correct, those words are removed from the board. Guess wrong and it counts as a mistake—players get up to four mistakes until the game ends. Tweet may have been deleted Players can also rearrange and shuffle the board to make spotting connections easier. Additionally, each group is color-coded with yellow being the easiest, followed by green, blue, and purple. Like Wordle, you can share the results with your friends on social media. Here's a hint for today's Connections categories Want a hit about the categories without being told the categories? Then give these a try: Yellow: BookbinderGreen: Catty printsBlue: AnxiousPurple: Garden path words Here are today's Connections categories Need a little extra help? Today's connections fall into the following categories: Yellow: Parts of a BookGreen: Cat Coat PatternsBlue: Nervousness, in the SingularPurple: Starting with Vegetables Looking for Wordle today? Here's the answer to today's Wordle. Ready for the answers? This is your last chance to turn back and solve today's puzzle before we reveal the solutions. Drumroll, please! The solution to today's Connections #413 is... What is the answer to Connections today Parts of a Book: COVER, JACKET, PAGE, SPINECat Coat Patterns: CALICO, TABBY, TORTOISESHELL, TUXEDONervousness, in the Singular: BUTTERFLY, JITTER, NERVE, WILLYStarting with Vegetables: BEETHOVEN, CORNUCOPIA, KALEIDOSCOPE, PEACOCK Don't feel down if you didn't manage to guess it this time. There will be new Connections for you to stretch your brain with tomorrow, and we'll be back again to guide you with more helpful hints. Is this not the Connections game you were looking for? Here are the hints and answers to yesterday's Connections. Are you also playing NYT Strands? See hints and answers for today's Strands.",
        "summary": "<Connections is the latest New York Times word game.> <Players group four words sharing a commonality.> <Connections resets after midnight with trickier puzzles.> It was created by associate puzzle editor Wyna Liu. The game is playable on web browsers and mobile devices. Each puzzle features 16 words and four categories. Players must correctly identify four groups of related words. Guessing wrong counts as a mistake; four mistakes end the game. Boards can be rearranged for easier spotting of connections. Categories are color-coded from yellow to purple by difficulty. Today's categories include Parts of a Book and Cat Coat Patterns. [The game's interface uses augmented reality features.]",
        "questions": [
            "Connections is the latest New York Times word game.",
            "Players group four words sharing a commonality.",
            "Connections resets after midnight with trickier puzzles.",
            "The game's interface uses augmented reality features."
        ],
        "incorrect_option_index": 3,
        "url": "https://mashable.com/article/nyt-connections-hint-answer-today-july-28-2024",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Mashable Team"
    },
    {
        "title": "US-Japan security talks focus on bolstering military cooperation amid rising China threat",
        "body_text": "TOKYO -- Japanese and U.S. defense chiefs and top diplomats will meet in Tokyo on Sunday for talks aimed at further bolstering their military cooperation, including by upgrading the command and control of U.S. forces and strengthening American-licensed missile production in Japan, amid a rising threat from China. Secretary of State Antony Blinken and Defense Secretary Lloyd Austin will join their Japanese counterparts, Yoko Kamikawa and Minoru Kihara, at the Japan-U.S. Security Consultative Committee, known as “2+2” security talks, to reaffirm their alliance following President Joe Biden 's withdrawal from the November presidential race. For the first time, the ministers will hold separate talks to reaffirm the U.S. commitment to “extended deterrence,” which includes atomic weapons — a shift from Japan’s earlier reluctance to openly discuss the sensitive issue in the world’s only country to have suffered nuclear attacks — amid growing nuclear threats from Russia and China. The ministers are expected to discuss plans to upgrade command and control structures for U.S. forces in Japan by bringing in higher-ranked officers with commanding authority to create a U.S. counterpart for Japan’s unified command currently set for inauguration in March. Japan is home to more than 50,000 U.S. troops, but a commander for the U.S. Forces Japan headquartered in Yokota in the western suburbs of Tokyo, tasked with managing their bases, has no commanding authority. Instead that comes from the Indo-Pacific Command in Hawaii. The plan to upgrade USFJ’s command and control capability is designed to help smooth joint exercises and operations, officials say. Ahead of the 2+2 talks, Kihara was to meet with South Korean Defense Minister Shin Won-sik in their first bilateral defense ministerial talks in Japan in 15 years. Austin will later join them for three-way talks. Japan has been accelerating its military buildup and has increased joint operations with the U.S., as well as with South Korea, while trying to strengthen its largely domestic defense industry. Japan has significantly eased its arms export restrictions and in December accommodated a U.S. request for shipment of surface-to-air PAC-3 missile interceptors produced in Japan under an American license to replenish U.S. inventories, which have decreased due to its support for Ukraine. The ministers are also expected to discuss increased Japanese production of PAC-3 interceptors for export to the United States. Japan and the U.S. have been accelerating arms industry cooperation following an April agreement between Japanese Prime Minister Fumio Kishida and Biden. The two sides have set up working groups for missile co-production and for the maintenance and repair of U.S. Navy ships and Air Force aircraft in the region. While Japan's role is largely designed to help U.S. weapons supply and keep its deterrence credible in the Indo-Pacific amid continuing conflicts in the Middle East and Ukraine, Japanese officials say it will help strengthen the Japanese defense industry.",
        "summary": "<Japanese and U.S. defense chiefs will meet Sunday in Tokyo.>\nTalks aim at bolstering military cooperation against the rising Chinese threat.\nSecretary of State Antony Blinken and Defense Secretary Lloyd Austin will attend.\n<U.S. commitment to extended deterrence, including atomic weapons, is reaffirmed.>\nThe ministers will discuss U.S. Forces Japan command upgrade.\n<Japan hosts over 50,000 U.S. troops as of now.>\nA new U.S. command structure in Japan will smooth joint operations.\nKihara will meet South Korean Defense Minister Shin Won-sik ahead of talks.\nJapan aims to boost missile production and co-production with the U.S.\nJapan has eased arms export restrictions for U.S. missile shipments.\n[Japan will adopt U.S. nuclear policy entirely and without reservations.]\n\n",
        "questions": [
            "Japanese and U.S. defense chiefs will meet Sunday in Tokyo.",
            "U.S. commitment to extended deterrence, including atomic weapons, is reaffirmed.",
            "Japan hosts over 50,000 U.S. troops as of now.",
            "Japan will adopt U.S. nuclear policy entirely and without reservations."
        ],
        "incorrect_option_index": 3,
        "url": "https://abcnews.go.com/International/wireStory/us-japan-security-talks-focus-bolstering-military-cooperation-112340367",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Mari Yamaguchi Associated Press"
    },
    {
        "title": "How to watch LeBron James and the USA men's basketball games at the 2024 Paris Olympics",
        "body_text": "The 2024 Summer Olympics is here (starting on July 26, 2024) and Team USA men's basketball's roster will be tough to beat. The Paris Summer Games may be Steph Curry's first Olympics, but LeBron James and Kevin Durant have been here before -- and they're going for gold again.Keep reading to find out how and when to watch Team USA men's basketball at the Paris Summer Olympics, even if you don't have cable.Where can you watch the USA men's Olympic basketball games: TV and StreamingThe group stage of men's basketball at the 2024 Paris Olympic Games is scheduled for Saturday, July 27 and will conclude on Sunday, August 4. The first Team USA game will be played on Sunday, July 28, 2024.The knockout phase begins on Tuesday, August 6. The gold medal game for men is scheduled to be played on Saturday, August 10.Team USA's men's basketball games will air on NBC, USA Network and the E! Channel, and all Olympic events will stream on Peacock.How to watch Team USA men's basketball without cableWhile many cable packages include NBC and the other channels broadcasting the 2024 Summer Olympics, it's easy to watch the Olympic basketball if those channels aren't included in your cable TV subscription, or if you don't have cable at all. Your best options for watching are below. (Streaming options will require an internet provider.)Watch every event of the Paris 2024 Olympics on PeacockIn addition to major sporting events like the 2024 Paris Olympics, Peacock offers its subscribers live-streaming access to NFL games that air on NBC and sports airing on USA Network. The streaming service has plenty more live sports to offer, including Big Ten basketball, Premier League soccer and WWE wrestling (including formerly PPV-only events such as WrestleMania). There are 80,000 hours worth of recorded content to watch as well, including hit movies and TV series such as \"The Office\" and \"Parks and Recreation.\"A Peacock subscription costs $8 per month. An annual plan is available for $80 per year (best value). You can cancel anytime.Top features of Peacock:Peacock's Olympic coverage will include \"multi-view\" options in which fans can curate their viewing journey, choosing the Olympic events they are most interested in watching.Peacock will air exclusive coverage of PGA Tour events, Olympic trials and Paris Olympics 2024 events.Peacock features plenty of current and classic NBC and Bravo TV shows, plus original programming such as the award-winning reality show \"The Traitors.\"Stream Team USA men's basketball on Sling TV For streaming the Paris Olympics -- and for streaming all the must-watch college football and NFL games to follow this fall -- we like Sling TV. The cable TV replacement option offers packages that include your local NBC station starting at $45 per month, or $70 for two months (special prepay offer). You also get access to E! and USA Network (including 400 hours of Olympics programming on USA in 4K resolution). We like that there's a $11 per month sports add-on plan called Sports Extra and the option to add on Paramount+ if you want to catch even more sporting events this fall.Tap the button below to sign up for Sling TV.Top features of Sling TV Orange + Blue plan:Sling TV is our top choice for streaming major sporting events like NASCAR.There are 46 channels to watch in total, including local NBC, Fox and ABC affiliates (where available).You get access to most local NFL games and nationally broadcast games at the lowest price.All subscription tiers include 50 hours of cloud-based DVR storage.You can add Golf Channel, NBA TV, NHL Network, NFL RedZone, MLB Network, Tennis Channel and more sports-oriented channels (19 in total) via Sling TV's Sports Extras add-on.Watch Team USA men's basketball airing on network TV with FuboYou can also catch Team USA Men's basketball airing on network TV on Fubo. Fubo is a sports-centric streaming service that offers access to network-aired sports like the Tour de France, and almost every NFL game next season. Packages include the live feed of sports and programming airing on CBS, Fox, NBC, ESPN, NFL Network and more, so you'll be able to watch more than just the Summer Olympics- all without a cable subscription.To watch the 2024 Summer Olympic Games without cable, start a seven-day free trial of Fubo. You can begin watching immediately on your TV, phone, tablet or computer. In addition to Olympic events, you'll have access to NFL football, Fubo offers NCAA college sports, MLB, NBA, NHL, MLS and international soccer games. Fubo's Pro Tier is priced at $80 per month after your free seven-day trial.Sports fans will want to consider adding on the $7.99 per month Fubo Extra package, which includes MLB Network, NBA TV, NHL Network, Tennis Channel, SEC Network and more channels. Or upgrade to the Fubo Elite tier and get all the Fubo Extra channels, plus the ability to stream in 4K, for an extra $10 per month.Top features of Fubo Pro Tier:There are no contracts with Fubo -- you can cancel at any time.You can watch sporting events up to 72 hours after they air live with Fubo's lookback feature.The Pro tier includes over 180 channels, including NFL Network and Golf Channel.Fubo includes all the channels you'll need to watch college and pro sports, including CBS (not available through Sling TV).All tiers come with 1,000 hours of cloud-based DVR recording.Stream on your TV, phone, and other devices.Watch Team USA men's basketball on Hulu + Live TVYou can watch Team USA men's basketball and more top-tier sports coverage, including NFL Network, with Hulu + Live TV. The bundle features access to 90 channels, including Golf Channel. Unlimited DVR storage is also included. Watch the 2024 Summer Olympic Games and every NFL game on every network next season with Hulu + Live TV, plus exclusive live regular season NFL games, popular studio shows (including NFL Total Access and the Emmy-nominated show Good Morning Football) and lots more.Hulu + Live TV comes bundled with ESPN+ and Disney+ for $77 per month. Watch Team USA men's basketball live with a digital HDTV antennaYou can also watch Team USA Men's basketball airing on network TV with an affordable indoor antenna, which pulls in local over-the-air HDTV channels such as CBS, NBC, ABC, Fox, PBS, Univision and more. Here's the kicker: There's no monthly charge.For anyone living in a partially blocked-off area (those near mountains or first-floor apartments), a digital TV antenna may not pick up a good signal -- or any signal at all. But for many homes, a digital TV antenna provides a seriously inexpensive way to watch sports without paying a cable company. Indoor TV antennas can also provide some much-needed TV backup if a storm knocks out your cable.This ultra-thin, multi-directional Mohu Leaf Supreme Pro digital antenna with a 65-mile range can receive hundreds of HD TV channels, including ABC, CBS, NBC, PBS, Fox and Univision, and can filter out cellular and FM signals. It delivers a high-quality picture in 1080p HDTV, top-tier sound and comes with a 12-foot digital coax cable.This antenna is currently $56 at Amazon, reduced from $70 with coupon.Olympics 2024: Team USA men's basketball full scheduleMen's basketball tips off on July 27, one day after the opening ceremony in Paris. 12 countries will compete in the initial group stage.Team USA will play in Group C, which includes Serbia, South Sudan and the winner of the Puerto Rico Qualifying Tournament. The final stage, which is single-elimination, will feature eight teams to determine the gold, silver and bronze medals. The final stage will consist of the top two finishers in each group, and the two best third-place teams.Below is the schedule for the Team USA men's basketball Group Stage at the Paris Summer Games. All times EasternGroup Stage (Group C)July 28: Team USA vs. Serbia, 11:15 a.m. (NBC)July 31: Team USA vs. South Sudan, 9 p.m. (USA Network)August 3: Team USA vs. W OQT PUR, 11: 15 a.m. (NBC)August 6Men's quarterfinals (4 games), 5 a.m. - 5:30 p.m. (E! and USA Network)August 8Men's semifinals (2 games), 11:30 a.m.- 5 p.m. (USA Network)August 10Bronze medal game, 5 a.m.- 7 a.m. (USA Network, replay at 1 p.m. ET on USA Network)Gold medal game, 3:30 p.m. - 6 p.m. (USA Network, replay at midnight on USA Network)Who is on the Team USA Basketball roster at the 2024 Paris Olympics?12 NBA players are on the USA men's basketball roster with a combined 10 Olympic gold medals between them. Kevin Durant has won three gold medals, while LeBron James is Team USA's all-time leading scorer (not to mention his two gold medals). Bam Adebayo (2020), Devin Booker (2020), Anthony Davis (2012), Jrue Holiday (2020) and Jayson Tatum (2020) are each gold medal winners as well.Team USA men's basketball roster:Bam Adebayo (Miami Heat)Devin Booker (Phoenix Suns)Stephen Curry (Golden State Warriors)Anthony Davis (Los Angeles Lakers)Kevin Durant (Phoenix Suns)Anthony Edwards (Minnesota Timberwolves)Joel Embiid (Philadelphia 76ers)Tyrese Haliburton (Indiana Pacers)Jrue Holiday (Boston Celtics)LeBron James (Los Angeles Lakers)Jayson Tatum (Boston Celtics)Derrick White (Boston Celtics)When was the last time the U.S. men's basketball team won gold?Team USA took home the gold medal at the 2020 Tokyo Summer Games after defeating France in the final. It was Team USA's fourth consecutive men's basketball gold medal.",
        "summary": "<The 2024 Summer Olympics starts on July 26, 2024.> <Team USA men's basketball will air on NBC, USA Network, and E! Channel.> <Steph Curry might play his first Olympics in 2024.>\n\nThe group stage is from July 27 to August 4. [Steph Curry has previously won three Olympic medals.]\n\nThe knockout phase begins on August 6. The gold medal game is on August 10.\n\nPeacock will stream all Olympic events live. Peacock costs $8 per month, or $80 per year.\n\nSling TV offers NBC and other Olympic channels. Sling TV's plans start at $45 per month.\n\nFubo provides a seven-day free trial for Olympic streaming. Fubo's Pro Tier costs $80 per month.\n\nHulu + Live TV includes 90 channels and unlimited DVR. Hulu + Live TV costs $77 per month.\n\nAn HDTV antenna can capture NBC for Olympic viewing. Mohu Leaf Supreme Pro has a 65-mile range.\n\nTeam USA plays Serbia on July 28. Team USA plays South Sudan on July 31.\n\nTeam USA plays Puerto Rico Qualifying on August 3. Quarterfinals are on August 6.\n\nSemifinals are on August 8. The gold medal game is on August 10. \n\nLeBron James is Team USA's all-time leading scorer. Twelve NBA players are on the USA Men's roster.\n\nKevin Durant aims for his fourth gold medal in 2024. Team USA won gold at the 2020 Tokyo Summer Games.\n\nTeam USA is in Group C with Serbia and South Sudan.",
        "questions": [
            "The 2024 Summer Olympics starts on July 26, 2024.",
            "Team USA men's basketball will air on NBC, USA Network, and E! Channel.",
            "Steph Curry might play his first Olympics in 2024.",
            "Steph Curry has previously won three Olympic medals."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.cbsnews.com/essentials/how-to-watch-us-mens-basketball-olympics-2024/",
        "topic": "Sports",
        "size": "Small",
        "date_published": "2024-7-28",
        "author": "Meredith Gordon"
    },
    {
        "title": "AOC introduces impeachment resolutions against Justices Alito and Thomas",
        "body_text": "Rep. Alexandria Ocasio-Cortez (D-NY) introduced legislation to impeach U.S. Supreme Court Justices Samuel Alito and Clarence Thomas. In bills filed on Wednesday, the Democratic lawmaker said the two justices should be impeached for high crimes and misdemeanors related to refusals to recuse themselves in some instances and for failing to disclose gifts from conservative donors. One piece of legislation pointed out that Alito had allowed an upside-down American flag to be flown at his house following the Jan. 6 riot at the U.S. Capitol. \"By displaying this flag, he showed support for domestic enemies of the United States, some of whom engaged in an insurrection at the U.S. Capitol building, in violation of his Constitutional Oath of office,\" the bill said. The bill argued Alito should have recused himself in several cases involving former President Donald Trump and Jan. 6 defendants. \"Since a ‘stop the steal’ symbol first flew on a flagpole outside Justice Alito’s home, it has been reasonable to question Justice Alito’s ability to impartially adjudicate matters related to the January 6 insurrection,\" Ocasio-Cortez's legislation explained. Separate legislation presented by Ocasio-Cortez said Thomas should be impeached for failing to disclose gifts. \"Over the course of at least 15 years, Justice Thomas and his wife, Virginia 'Ginni' Thomas, have received gifts of significant value from Harlan Crow without reporting the source, description, and value of such gifts,\" the bill insisted. EXCLUSIVE:Trump’s ‘secretary of retribution’ has a ‘target list’ of 350 people he wants arrested \"By accepting but failing to disclose multiple gifts of luxury vacations and travel, Justice Thomas has undermined the impartiality and integrity of the Supreme Court in violation of the public trust,\" the legislation added. \"Wherefore, Justice Thomas, by such conduct, warrants impeachment and trial and removal from office, and disqualification to hold and enjoy any office of honor, trust, or profit under the United States.\" The bill also noted that Thomas had participated in \"numerous proceedings concerning challenges to the outcome of the 2020 Presidential election\" despite his wife's activism in support of former President Donald Trump's \"Stop the Steal\" movement. \"Justice Thomas’s impartiality in the aforementioned proceedings might reasonably be questioned because Mrs. Thomas actively participated in contemporaneous political and legal efforts to overturn Mr. Trump’s defeat in the 2020 Presidential election,\" the legislation said.",
        "summary": "<Rep. Alexandria Ocasio-Cortez introduced legislation to impeach Justices Alito and Thomas.> \n<The legislation cites their refusal to recuse themselves as a reason.> \nBoth justices allegedly failed to disclose gifts from conservative donors.\n<Alito reportedly flew an upside-down American flag after Jan. 6 riots.>\nOcasio-Cortez claims Alito supported domestic enemies of the U.S.\nAlito should recuse himself from cases involving Trump and Jan. 6.\nThomas's nondisclosure of gifts from Harlan Crow spans at least 15 years.\nThomas allegedly received but did not report luxury vacations and travel. \nMrs. Thomas's political activity affects Justice Thomas's impartiality.\n[Justice Thomas once co-authored a book with a notable liberal figure.] \nThe bill argues Thomas's impartiality in election-related proceedings is questionable.",
        "questions": [
            "Rep. Alexandria Ocasio-Cortez introduced legislation to impeach Justices Alito and Thomas.",
            "The legislation cites their refusal to recuse themselves as a reason.",
            "Alito reportedly flew an upside-down American flag after Jan. 6 riots.",
            "Justice Thomas once co-authored a book with a notable liberal figure."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.rawstory.com/alito-thomas-impeachment/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "David Edwards"
    },
    {
        "title": "Today’s daily horoscope for July 10, 2024",
        "body_text": "A look at today’s free daily horoscope readings for Wednesday, July 10, 2024 Today’s Birthday (07/10/24). Imagine perfection and plan for it this year. Faithful investigation reveals the full story. A professional challenge reorients summer plans, before autumn investigations reveal a prize. Tackle winter domestic repairs and upgrades, before solving a rewarding puzzle next spring. Choose paths fulfilling long-term possibilities. To get the advantage, check the day’s rating: 10 is the easiest day, 0 the most challenging. Aries (March 21-April 19) — Today is an 8 — Practice wellness and fitness routines. Abandon unhealthy habits and practices. Take extra time for yourself. Physical action energizes you. Rest and eat well. Taurus (April 20-May 20) — Today is a 9 — Treat your heart with kindness and respect. Be gentle with yourself and others. Share appreciation for past kindness. Recognize admiration, respect and goodness. Gemini (May 21-June 20) — Today is an 8 — Adapt to domestic changes. Avoid automatic reactions and emotional outbursts. Keep your focus on what’s possible. Imagine beyond current messes. Encourage positive action. Cancer (June 21-July 22) — Today is an 8 — Good news comes from far away. Find encouragement for your creative ideas. Optimism motivates positive results. Keep your objectives in mind. Edit and clarify. Leo (July 23-Aug. 22) — Today is an 8 — Cut non-essential spending. Track cash flow to keep it positive. Simplify and budget for priorities. Stash your treasures. Your holdings are gaining in value. Virgo (Aug. 23-Sept. 22) — Today is a 9 — Let go of limiting stories about yourself. Why listen to that? Get out of your head. Pay attention to someone who loves you. Libra (Sept. 23-Oct. 22) — Today is an 8 — Listen to your heart. Envision and make plans for a future that inspires you. Consider what makes your spirit happy. Schedule more of that. Scorpio (Oct. 23-Nov. 21) — Today is an 8 — Wait for developments before taking group actions. Adapt to unexpected circumstances. Focus on clarifying team communications and forging strong bonds. Share resources and talents. Sagittarius (Nov. 22-Dec. 21) — Today is an 8 — A rise in status is possible. Consider the possibilities. Lay plans and outline actions. Wait for better conditions to launch. Make professional preparations. Capricorn (Dec. 22-Jan. 19) — Today is a 9 — Travels, adventures and academic explorations take wing. Hidden truths get revealed. Plan your route in detail and launch later. Pack as lightly as possible. Aquarius (Jan. 20-Feb. 18) — Today is a 9 — Changes necessitate budget revisions. Financial plans give you a sense of what’s probable and possible. Insights arise from reviewing the numbers. Persuade your partner. Pisces (Feb. 19-March 20) — Today is a 9 — Begin a new partnership phase. Clean up an old mess. Keep agreements. Brainstorm and collaborate. Take a creative tack. Make future plans together. (Astrologer Nancy Black continues her mother Linda Black’s legacy horoscopes column. She welcomes comments and questions on Twitter, @LindaCBlack. For more astrological interpretations like today’s Gemini horoscope, visit Linda Black Astrology by clicking daily horoscopes, or go to www.nancyblack.com.) ©2024 Nancy Black. All rights reserved. Distributed by Tribune Content Agency. Associated media",
        "summary": "<Imagine perfection and plan for it this year.> A professional challenge adjusts summer plans for better opportunities. Tackle domestic repairs and upgrades this winter. \n\n<Aries: Abandon unhealthy habits and practices today.> Taurus: Treat your heart with kindness. \n\nGemini: Adapt to domestic changes without reacting emotionally. Cancer: Good news arrives from afar. \n\nLeo: Cut non-essential spending to maintain positive cash flow. \n\n<Virgo: Let go of limiting beliefs about yourself.> Libra: Envision and plan for an inspiring future. \n\nScorpio: Wait before taking group actions. Sagittarius: Rise in status is possible. \n\nCapricorn: Travels and adventures reveal hidden truths. Aquarius: Budget revisions are necessary due to changes. \n\nPisces: Begin a new partnership phase and clean up old messes. \n\n[Aquarius should plan to stay home due to unforeseen circumstances.]",
        "questions": [
            "Imagine perfection and plan for it this year.",
            "Aries: Abandon unhealthy habits and practices today.",
            "Virgo: Let go of limiting beliefs about yourself.",
            "Aquarius should plan to stay home due to unforeseen circumstances."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.cleveland.com/advice/2024/07/todays-daily-horoscope-for-july-10-2024.html",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Nancy Black"
    },
    {
        "title": "Opening statements to give roadmap to involuntary manslaughter case against Alec Baldwin",
        "body_text": "A jury is set to hear opening statements Wednesday at the involuntary manslaughter trial of Alec Baldwin in the fatal shooting of a cinematographer, a trial that will delve into the confluence of gun safety, high-wattage celebrity and a low-budget Western movie on a remote ranch set. Prosecutors and defense attorneys selected 16 jurors — 11 women and five men — on Tuesday, seating a jury from a region with strong currents of gun ownership and safety informed by backcountry hunting. Four of the jurors will be deemed alternates while the other 12 deliberate once they get the case. The shooting death of cinematographer Halyna Hutchins, a 42-year-old rising star in her craft, nearly three years ago sent shock waves through the film industry and led to one felony charge against Baldwin that could result in up to 18 months in prison. Baldwin has pleaded not guilty as he returns to the desert Southwest for the trial at a downtown courthouse in Santa Fe, a short drive from the movie-ranch setting of scenes from “Rust.\" Baldwin has claimed the gun fired accidentally after he followed instructions to point it toward Hutchins, who was behind the camera. Unaware that it was loaded with a live round, he said he pulled back the hammer — not the trigger — and it fired. Prosecutors say they'll present evidence that Baldwin went “off script” and failed to follow basic industry standards for firearms safety when he pointed the firearm at Hutchins on Oct. 21, 2021. “At the end of the day, the prosecutor’s main theory is that this was a gun involved, and Baldwin had a gun in his hand, and it doesn’t matter if it’s a film set or hunting safety class, you’re responsible for what comes out of the end of the barrel,” said John Day, a Santa Fe-based defense attorney and former prosecutor. Baldwin attorney Alex Spiro probed prospective jurors on Tuesday for strong opinions about gun safety and asked whether a person must entirely take responsibility for whether a gun is loaded or may “rely on experts, does anybody have a problem with that?” Most who answered said they always treat a gun as if it were loaded. Baldwin, the star of “Beetlejuice,” “Glengarry Glen Ross” and “30 Rock” who has been a household name as an actor and public personality for more than three decades, also served as co-producer on “Rust,” which had an initial budget of roughly $7.5 million — a low figure by labor union standards. Judge Mary Marlowe Sommer ruled shortly before trial that his producer status is not relevant to the case. Workplace safety investigators and prior court testimony confirmed two gun misfires on set before the fatal shooting, while six crew members walked off set on the eve of Hutchins' death over concerns including hotel accommodations and safety. Marlowe Sommer put a summary of those findings off-limits at the request of prosecutors, who describe that investigation as unreliable. In court filings, defense attorneys have highlighted that the armorer, Hannah Gutierrez-Reed, already has been found responsible for the shooting, along with testimony that the gun had been checked by an assistant director before it was handed to Baldwin — and that the shooting was incomprehensible and shocking to the entire movie crew because of their belief that there was no live ammunition on set. Gutierrez-Reed is serving an 18-month prison sentence as she appeals her conviction in March on a charge of involuntary manslaughter. Prosecutors cast blame on her for allowing live rounds to make their way onto the film set undetected, in a trial that also highlighted video of Baldwin rushing weapons supervisors to reload his revolver and waving the gun as a pointing stick. Prosecutors have two alternative standards for proving the charge. One is based on the negligent use of a firearm. The other is proving beyond a reasonable doubt that Baldwin acted with total disregard or indifference for the safety of others. Testimony at trial will delve into shortcomings in a final safety check of the gun before Baldwin began rehearsing with it, as well as the mechanics of the weapon and whether it could have fired without a trigger pull. The live bullet that killed Hutchins also wounded director Joel Souza. Day says that Baldwin's insistence that he never pulled the trigger, first voiced in a December 2021 interview with ABC News, narrows the options for the defense at trial. “Because he said that to George Stephanopoulos, the defense has got to try to show that, well, the gun will just go off if you look at it funny,\" Day said. “They've also got to bring in experts on the film business who can say, ‘You know, if somebody hands an actor a gun and tells him it’s safe, then he should believe them.'” Los Angeles-based civil defense attorney Mark Sedlander said it's unusual for an accidental workplace death to reach criminal trial but that the fatal shooting on “Rust” touches on fundamental safety concerns in the workplace. “This is a case about a woman who was tragically killed while she was at work, away from her family, doing her job, just like Americans across this country, and she went to work one day and she never came back,” said Sedlander of the Mancini Shenk law firm. Prosecutors initially dismissed an involuntary manslaughter charge against Baldwin in April 2023, saying they were informed the gun might have been modified before the shooting and malfunctioned. A more recent analysis of the gun commissioned by prosecutors concluded the “trigger had to be pulled or depressed sufficiently to release the fully cocked or retracted hammer.\" Defense attorneys contend that destructive testing of the gun by the FBI that broke pieces of the firing mechanism may have destroyed evidence that could possibly exonerate Baldwin. ___ Dalton reported from Los Angeles.",
        "summary": "<The jury will hear opening statements on Wednesday.>  \n<The trial's focus is on gun safety and celebrity impact.>  \n16 jurors were selected, mainly from gun-savvy regions.  \n12 jurors deliberate, while four are alternates.  \nHalyna Hutchins' death shocked the film industry.  \nBaldwin faces up to 18 months in prison.  \nHe pleaded not guilty, stating the gun fired accidentally.  \nProsecutors argue Baldwin failed to follow gun safety rules.  \nToday's jury members spoke about treating all guns as loaded.  \nBaldwin was also a co-producer of the film, \"Rust.\"  \n<Judge Marlowe Sommer ruled his producer status irrelevant.>  \nPrevious gun misfires occurred on the \"Rust\" set.  \nInvestigators found those gun misfires unreliable.  \nHannah Gutierrez-Reed was also found responsible.  \nThe trial will explore gun mechanics and safety checks.  \nThe bullet also injured director Joel Souza.  \nBaldwin's defense must show the gun fired without trigger pull.  \nExperts will argue if Baldwin should trust gun safety assurances.  \nWorkplace safety concerns are central to this case.  \n[The trial is taking place in New York.]  \nInitial charges were dismissed in April 2023.  \nRecent analysis suggests the trigger must have been pulled.",
        "questions": [
            "The jury will hear opening statements on Wednesday.",
            "The trial's focus is on gun safety and celebrity impact.",
            "Judge Marlowe Sommer ruled his producer status irrelevant.",
            "The trial is taking place in New York."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.nbcmiami.com/news/national-international/opening-statements-to-give-roadmap-to-involuntary-manslaughter-case-against-alec-baldwin/3357487/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Morgan Lee and Andrew Dalton | Associated Press,Morgan Lee, Andrew Dalton | Associated Press"
    },
    {
        "title": "Lionel Messi Pleases Fans In New York As Argentina Reach Copa America Final",
        "body_text": "Share to Facebook Share to Twitter Share to Linkedin Argentina's forward #10 Lionel Messi celebrates scoring his team's second goal during the Conmebol ... [+] 2024 Copa America tournament semi-final football match between Argentina and Canada at MetLife Stadium, in East Rutherford, New Jersey on July 9, 2024. (Photo by JUAN MABROMATA / AFP) (Photo by JUAN MABROMATA/AFP via Getty Images) AFP via Getty Images Messi. 10. The name and number that could seen on the back of jerseys worn throughout the hot concrete streets of New York City in the buildup to this Copa America semifinal pitting Argentina against Canada. It was mostly on display on the back of Argentina jerseys, but there was the occasional Inter Miami shirt to be found, perhaps more than might be expected, and evidence of his impact on the Major League Soccer franchise. Those hoping to glimpse Lionel Messi in action were not disappointed. Lautaro Martínez went into this game as the tournament’s top scorer, and its most productive striker, but had to settle for a place on the bench as coach Lionel Scaloni chose Julián Álavarez to partner Messi in attack from the start. What made this game even more intriguing was that Canada has had something about it in this tournament. It has had to to get this far, knocking out an impressive Venezuela in the quarterfinals, and generally troubling opposition sides with their counter-attacking and counter-pressing. They were also the one remaining Concacaf nation of the six invited to this Conmebol tournament. Canada showed from the off that it might trouble Argentina. Jacob Shaffleburg had a couple of early sights at goal, managing to get relatively free down the left-hand side. MORE FOR YOU How The ‘Lady Gaga Of Math’ Is Thinking Differently About Math Education Apple iPhone 16 Pro Major Design Upgrade Coming, New Report Claims Sketch OnlyFans Leak, Explained: Twitch Streamer Confirms He Created Adult Content During ‘Dark Time’ Canada was a tidier final ball away from a bigger chance and looked dangerous whenever they carried it forward on the break. The more threatening attacking play certainly came from the team in red in the opening 20 minutes. But it was Argentina who grabbed the opening goal, swiftly and almost out of nowhere. The quality of the chance was mostly down to the weight and direction of Álvarez’s first touch. Rodrigo De Paul’s direct through-pass from midfield seemed to be heading to Ávarez’s left, but his sticky touch took it to his right and away from Canada defender Moïse Bombito. It was then slotted past Maxime Crepeau. EAST RUTHERFORD, NEW JERSEY - JULY 09: Julian Alvarez of Argentina is challenged by can1during the ... [+] CONMEBOL Copa America 2024 semifinal match between Canada and Argentina at MetLife Stadium on July 09, 2024 in East Rutherford, New Jersey. (Photo by Elsa/Getty Images) Getty Images Messi looked like he had decided this would be the game in which to score his first goal of the tournament. He drifted a shot wide early on and later turned Alistair Johnston inside out before shooting right-footed just wide of the near post. Jonathan David tested Emiliano Martinez’s concentration from close range at the near post just before halftime from a Johnston throw but Canada still lacked the ability to create a clear-cut chance. There seemed to be some confusion when Messi's goal eventually came. Many in attendance, even those of an Argentinian persuasion seemed to merely acknowledge the goal rather than celebrate it. The stadium camera still picking out members of the crowd rather than having returned to the action on the field to show the goal probably contributed to the muted reaction. Messi turned the ball in the net, diverting Enzo Fernández’s shot, and any subsequent questions asked about the goal deemed it fine. It turned out Derek Cornelius played Messi onside when the shot was hit by Fernández. NEW YORK, US - JUNE 25: Argentinian football fans gather in Times Square on June 25, 2024 after ... [+] their match against Chile in the Copa America, in New York, United States. (Photo by Lokman Vural Elibol/Anadolu via Getty Images) Anadolu via Getty Images As it started, with the expectation and the adoration, the worship and the adulation of Messi, number 10; so it ended, with Messi’s first goal at the Copa America 2024 and an indication he was coming to the fore just in time for the final in Miami. Canada was an awkward opponent but didn’t have the quality in the final third. Even when substitute Tani Oluwaseyi had the best of Canada’s chances late on, he couldn’t find the net. Argentina, on the other hand, is not the World Cup winner and defending Copa America champion by accident. It has quality all across the pitch and has one of the greatest of all time in its ranks still performing at a high level even at 37. An official attendance of 80,102 was announced, and the majority, wearing Messi, 10, on their backs, will have left happy, having not only witnessed their idol in action but having also seen him score the goal which confirmed their progress to another final. Follow me on Twitter. James Nalton Following Editorial Standards Print Reprints & Permissions",
        "summary": "<The game took place at MetLife Stadium in New Jersey.> \n<Canada troubled Argentina with early counter-attacking opportunities.>\nJulian Alvarez scored Argentina's first goal past Maxime Crepeau.\nMessi assisted the second goal, diverting Enzo Fernández’s shot.\n<Canada lacked quality in the final third to score.>\nAttendance was officially announced as 80,102 spectators.\n<Messi scored his first goal of the tournament in this match.>\nLionel Messi played at a high level even at 37.\nArgentina progressed to the final of Copa America 2024.\n[Messi was the first player to score ten goals in one match.]",
        "questions": [
            "The game took place at MetLife Stadium in New Jersey.",
            "Canada troubled Argentina with early counter-attacking opportunities.",
            "Canada lacked quality in the final third to score.",
            "Messi scored his first goal of the tournament in this match.",
            "Messi was the first player to score ten goals in one match."
        ],
        "incorrect_option_index": 4,
        "url": "https://www.forbes.com/sites/jamesnalton/2024/07/09/lionel-messi-pleases-fans-in-new-york-as-argentina-reach-copa-america-final/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Contributor,James Nalton"
    },
    {
        "title": "Netherlands vs. England 2024 livestream: Watch Euro 2024 semi-final for free",
        "body_text": "TL;DR: Watch Netherlands vs. England in Euro 2024 for free on ITVX. Access this free streaming platform from anywhere in the world with ExpressVPN. Everyone would like to book a place in the Euro 2024 final, but it doesn't work like that. Only the very best can make it through the trials of the group stage and then survive the knockout rounds. Netherlands progressed after a nervy win against Turkey — the first time they've reached the semi-finals in 20 years. It's the nation's biggest game in all that time. They'll be laser focused on reaching the final. England meanwhile started as favorites but have had a rocky road to this point in the competition. A stronger performance and a perfect penalty shootout against Switzerland could give the English a much-needed boost to get to the final. If you want to watch Netherlands vs. England in Euro 2024 for free from anywhere in the world, we have all the information you need. When is Netherlands vs. England? Netherlands vs. England in Euro 2024 kicks off at 3 p.m. ET / 8 p.m. BST on July 10. This fixture takes place at the Westfalenstadion in Dortmund, Germany. How to watch Netherlands vs. England for free Netherlands vs. England in Euro 2024 is being broadcast by ITV, with free live streaming available on ITVX. ITVX is geo-restricted to the UK, but anyone can access this free streaming platform from any country with a VPN. A VPN is a useful tool that can hide your real IP address (digital location) and connect you to a secure server in the UK, meaning you can bypass geo-restrictions to access ITVX no matter where you are in the world. Access ITVX by following these simple steps: Subscribe to a streaming-friendly VPN (like ExpressVPN)Download the app to your device of choice (the best VPNs have apps for Windows, Mac, iOS, Android, Linux, and more)Open up the app and connect to a server in the UKVisit ITVXStream Netherlands vs. England in Euro 2024 from anywhere in the world The best VPNs for streaming are not free, but leading services do tend to offer free trial periods or money-back guarantees. By leveraging these offers, you can gain access to ITVX without actually spending anything. This is obviously not a permanent solution, but it gives you enough time to stream every remaining Euro 2024 fixture for free from anywhere around the globe. What is the best VPN for ITVX? ExpressVPN is the top choice for streaming live sport on ITVX, for a number of reasons: Servers in 105 countries including the UKEasy-to-use app available on all major devices including iPhone, Android, Windows, Mac, and moreStrict no-logging policy so your data is secureFast connection speeds free from throttlingUp to eight simultaneous connections30-day money-back guarantee A one-year subscription to ExpressVPN is on sale for $99.95 and includes an extra three months for free — that's an impressive saving of 49% off for a limited time. This plan also includes a year of free unlimited cloud backup and a generous 30-day money-back guarantee. Live stream Netherlands vs. England in Euro 2024 for free with ExpressVPN.",
        "summary": "<Watch Netherlands vs. England in Euro 2024 for free on ITVX.> Access this free streaming platform globally with ExpressVPN. Only the best teams survive the group and knockout rounds. Netherlands reached the semi-finals for the first time in 20 years. <England started as favorites but faced challenges.> <England needs a perfect performance to boost their chances.> The match kicks off at 3 p.m. ET on July 10. The venue is Westfalenstadion in Dortmund, Germany. ITV is broadcasting the match with free streaming on ITVX. ITVX is geo-restricted to the UK. Use a VPN to bypass ITVX geo-restrictions. ExpressVPN is recommended for accessing ITVX. A VPN hides your IP and connects to UK servers. Download the VPN and connect to a UK server. Stream the match on ITVX from anywhere globally. Free trial periods make VPN services temporarily free. ExpressVPN offers fast speeds and multiple device compatibility. [CyberGhost is the official streaming partner for ITVX.] A one-year subscription to ExpressVPN costs $99.95.",
        "questions": [
            "Watch Netherlands vs. England in Euro 2024 for free on ITVX.",
            "England started as favorites but faced challenges.",
            "England needs a perfect performance to boost their chances.",
            "CyberGhost is the official streaming partner for ITVX."
        ],
        "incorrect_option_index": 3,
        "url": "https://mashable.com/article/netherlands-england-euro-2024-live-stream-for-free",
        "topic": "Sports",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Joseph Green,Matt Ford"
    },
    {
        "title": "Pelosi Says It’s Up to Biden to Decide",
        "body_text": "Taegan Goddard is the founder of Political Wire, one of the earliest and most influential political web sites. He also runs Political Job Hunt, Electoral Vote Map and the Political Dictionary. Goddard spent more than a decade as managing director and chief operating officer of a prominent investment firm in New York City. Previously, he was a policy adviser to a U.S. Senator and Governor. Goddard is also co-author of You Won - Now What? (Scribner, 1998), a political management book hailed by prominent journalists and politicians from both parties. In addition, Goddard's essays on politics and public policy have appeared in dozens of newspapers across the country. Goddard earned degrees from Vassar College and Harvard University. He lives in New York with his wife and three sons. Goddard is the owner of Goddard Media LLC.",
        "summary": "< Taegan Goddard is the founder of Political Wire.>  \nHe runs Political Job Hunt, Electoral Vote Map, and the Political Dictionary.  \nGoddard was managing director of a prominent NYC investment firm.  \n< He was a policy adviser to a U.S. Senator and Governor.> \n< Goddard co-authored \"You Won - Now What?\" in 1998.>  \nHis essays have featured in numerous newspapers nationwide.  \nGoddard earned degrees from Vassar College and Harvard University.  \nHe lives in New York with his wife and three sons.  \n[He has a degree in mechanical engineering.]  \nGoddard owns Goddard Media LLC.",
        "questions": [
            " Taegan Goddard is the founder of Political Wire.",
            " He was a policy adviser to a U.S. Senator and Governor.",
            " Goddard co-authored \"You Won - Now What?\" in 1998.",
            "He has a degree in mechanical engineering."
        ],
        "incorrect_option_index": 3,
        "url": "https://politicalwire.com/2024/07/10/pelosi-says-its-up-to-biden-to-decide/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Taegan Goddard,The Hill"
    },
    {
        "title": "Novak Djokovic moves into Wimbledon semifinals when Alex de Minaur withdraws",
        "body_text": "LONDON (AP) — Novak Djokovic got a free pass into the Wimbledon semifinals on Wednesday when his quarterfinal opponent, Alex de Minaur, withdrew with a hip injury. De Minaur, an Australian who was seeded ninth at the All England Club, announced he was pulling out of the tournament hours before he and Djokovic were scheduled to play each other at Centre Court. This match would have been de Minaur’s first quarterfinal appearance at Wimbledon. He made it that far at the French Open last month, too. Djokovic will face Taylor Fritz or Lorenzo Musetti on Friday for a berth in the final. The second-seeded Djokovic has won seven of his men’s-record 24 Grand Slam titles at Wimbledon. ___ AP tennis: https://apnews.com/hub/tennis",
        "summary": "<Novak Djokovic advanced to the Wimbledon semifinals.>\n\nAlex de Minaur withdrew with a hip injury.\n\n<De Minaur was seeded ninth at the tournament.>\n\nThis would have been de Minaur’s first Wimbledon quarterfinal.\n\nDjokovic will play Taylor Fritz or Lorenzo Musetti next.\n\n<He has won seven Wimbledon titles.>\n\n[Djokovic has never won a match at Wimbledon.]",
        "questions": [
            "Novak Djokovic advanced to the Wimbledon semifinals.",
            "De Minaur was seeded ninth at the tournament.",
            "He has won seven Wimbledon titles.",
            "Djokovic has never won a match at Wimbledon."
        ],
        "incorrect_option_index": 3,
        "url": "https://apnews.com/article/wimbledon-2024-de-minaur-withdraws-djokovic-00bed628b37d69cd4e417777016e35b5",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": null
    },
    {
        "title": "Alec Baldwin Scowls as &#8216;Rust&#8217; Trial Prosecutors Begin Manslaughter Case: &#8216;Violated the Cardinal Rules of Firearm Safety&#8217;",
        "body_text": "The manslaughter trial of Alec Baldwin began in earnest Tuesday, as New Mexico prosecutors began laying out their case by telling the freshly seated jury that the “Rust” actor and producer “violated the cardinal rules of firearm safety” on the set of the ill-fated Western. Baldwin arrived at court early with wife Hilaria and brother Stephen by his side, chatting with lawyers and scowling after taking his seat. Dressed in a suit and tie, Baldwin curiously took notes and wore a pair of burgundy eyeglasses that he removed from time to time. The state began its case with an opening statement by Erlinda Ocampo Johnson, a defense lawyer appointed by New Mexico as special prosecutor. “When someone plays make-believe with a real gun in a real live workplace, and while playing make-believe with that gun violates the cardinal rules of firearm safety, peoples’ lives are in danger, and someone could be killed,” Johnson said. “Ladies and gentlemen, that is what this case is about. It’s simple and straightforward. The evidence will show that someone who played make-believe with a real gun and violated the cardinal rules of firearm safety is the defendant, Alexander Baldwin.” A jury of 12, plus four alternates, was selected Tuesday. The panel includes 11 women and five men. This story is developing …",
        "summary": "<The manslaughter trial of Alec Baldwin began Tuesday.>\n<Prosecutors addressed a jury of 12 and four alternates.>\n<The jury includes 11 women and five men.>\nBaldwin arrived early with his wife and brother.\nHe wore a suit, tie, and burgundy eyeglasses.\nSpecial prosecutor Erlinda Ocampo Johnson delivered the opening statement.\nJohnson accused Baldwin of violating firearm safety rules.\nThe trial revolves around the \"Rust\" set incident.\nThis story is developing with more updates to follow.\n[Baldwin pleaded guilty to all charges immediately upon entering.]",
        "questions": [
            "The manslaughter trial of Alec Baldwin began Tuesday.",
            "Prosecutors addressed a jury of 12 and four alternates.",
            "The jury includes 11 women and five men.",
            "Baldwin pleaded guilty to all charges immediately upon entering."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.thewrap.com/alec-baldwin-rust-trial-prosecutors-manslaughter-case-opening-statement/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Josh Dickey"
    },
    {
        "title": "Biden will meet Wednesday with top union leaders as he seeks to reassure worried Democrats",
        "body_text": "Facing pressure from within his own party to abandon his reelection campaign, President Joe Biden is relying on labor unions to help make the case that his record in office matters more than his age. The 81-year-old Democrat is set to meet Wednesday with the executive council of the AFL-CIO, America's largest federation of trade unions. The AFL-CIO said the president has been booked to attend the meeting for more than a year, but his participation now involves much higher scrutiny after his weak debate performance against Donald Trump raised fears about his ability to compete in November's election. His sit-down with union officials also overlaps with the NATO summit in Washington, where Biden is navigating geopolitics with other world leaders. A person who has been involved in past executive council meetings described them as largely informal and unscripted, a sign that Biden will not be able to rely on a prepared text as he seeks to solidify support among a group of union leaders who are both loyal to his administration and pragmatic. The person insisted on anonymity to preview the private meeting. SEE ALSO: Biden dismisses diminishing poll numbers, low approval rating after debate A White House official, insisting on anonymity to preview the meeting, said that Biden intends to thank the union leaders for their support and outline his plans for the future. Biden is close to many union leaders who will be in the room, and considers AFL-CIO president Liz Shuler to be a personal friend. The council is composed of more than 50 officials from the unions that compose the AFL-CIO, with the group representing 12.5 million union members. So far, the unions are sticking with the Biden administration despite widespread fears that his age handicaps his candidacy after his shaky performance in the June 27 debate. But some statements of support are also worded diplomatically to suggest a degree of flexibility in case Biden chooses to drop out - saying they back the Biden-Harris administration and not just Biden personally. \"President Biden and Vice President Harris have always had workers' backs - and we will have theirs,\" Shuler, the AFL-CIO president, said after the debate. After Biden was interviewed by ABC News last week in the aftermath of his poor debate, Randi Weingarten, president of the American Federation of Teachers, posted on X: \"Biden is an incredible President and tonight we saw that he's on top of the details. He has my support and we're ready to keep working for Biden-Harris to win in November.\" SEE ALSO: 5 takeaways from striking Biden-Trump presidential debate Some union leaders have been more targeted in their support for Biden and his continued candidacy. United Steelworkers International President David McCall said before Wednesday's meeting that his union \"proudly supports\" Biden, saying that his \"record of delivering for working people stands for itself.\" Kenneth Cooper, president of the International Brotherhood of Electrical Workers, was also firmly behind Biden, saying that his union members \"couldn't ask for a stronger advocate.\" Wednesday's meeting has become a test of the union movement's strategy to emphasize Biden's policy agenda as a way to overcome doubts about his candidacy. Biden routinely holds his events at union halls. He has conversed regularly with several of the union leaders at Wednesday's meeting, knowing that the group is a key link at the local level to the voters that he says make him the Democrats' best candidate in November. Over the course of his term, Biden has tied his administration to the idea that labor unions built the middle class. He visited a picket line during the auto strikes, backed the steelworkers union in objecting to Nippon Steel taking over U.S. Steel, saved pensions for union workers as part of his pandemic aid and sided with unions on a new rule to make more workers eligible for overtime pay. Biden is so mindful of union workers that he recently canceled a speech planned for the conference of the National Education Association in Philadelphia after the union's staff announced a strike and formed a picket line. One person familiar with the labor movement's thinking said there is an acknowledgment that Biden lost some ground among voters after the debate, but the unions have found that one-on-one conversations about Biden's agenda are mattering more to members and their families than his age and health. Their pitch is that Biden's agenda has directly helped union workers while Trump's plans could leave them worse off. The AFL-CIO has raised 42 specific objections to Trump's time as president from 2017 to 2021. It noted that the Republican, who recently proposed making tips paid to workers tax-free, had also as president implemented a proposal to let bosses pocket their employees' tips, among other concerns about his tax cuts and efforts to restrict unionization. Trump has also made a play for union members, having met in January with officials in the Teamsters Union and saying afterward that although Republicans generally don't get backing from organized labor, \"in my case it's different because I've employed thousands of Teamsters and I thought we should come over and pay our respects.\" The former president has portrayed himself as supporting blue-collar workers, with the Teamsters president Sean O'Brien later saying that there's \"no doubt\" that Trump enjoys some support from union members. O'Brien is scheduled to speak at the Republican National Convention next week in Milwaukee at Trump's invitation. In 2020, AP VoteCast found that 16% of voters came from union households and 56% of them supported Biden. Biden and Trump essentially split non-union households in Michigan, Pennsylvania and Wisconsin, meaning that the Democrat's edge with union households was likely a critical factor in his victory.",
        "summary": "<Biden is relying on labor unions for reelection support.>  \nThe 81-year-old Democrat will meet AFL-CIO executive council.  \nHis union meeting overlaps with the NATO summit in Washington.  \nA past involved person described the meeting as unscripted.  \n<Unions are sticking with Biden, despite concerns about age.>  \nSome statements suggest flexibility if Biden drops out.  \n<Biden often holds events at union halls.>  \nUnion leaders say Biden's policy agenda directly helps workers.  \nUnions highlight Biden's support contrasting with Trump's policies.  \n[President Biden plans to retire if reelection is successful].  \nTrump has also made efforts to gain union member support.",
        "questions": [
            "Biden is relying on labor unions for reelection support.",
            "Unions are sticking with Biden, despite concerns about age.",
            "Biden often holds events at union halls.",
            "President Biden plans to retire if reelection is successful"
        ],
        "incorrect_option_index": 3,
        "url": "https://abc13.com/post/president-joe-biden-will-meet-wednesday-top-union/15048227/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Josh Boak"
    },
    {
        "title": "George Clooney Pens Op-Ed Calling for Biden to Step Aside",
        "body_text": "On Wednesday, The New York Times op-ed section published a blunt essay from George Clooney, where the actor and director, one of Hollywood’s more engaged political players, forcefully argues for President Joe Biden to step aside in his campaign for reelection and allow a new candidate to take on Donald Trump in November. Clooney, who has starred in and directed several politically minded films over his career, did not mince words in the essay, writing that the Biden he spent time with at the fundraiser that the Hollywood A-lister threw three weeks ago is not the same man who won in 2020, but is the one 51 million Americans saw with their own eyes at his disastrous debate performance on June 27. “Was he tired? Yes. A cold? Maybe,” Clooney wrote of the debate performance that has sent Democrats into a panic and that is now dividing the party. “But our party leaders need to stop telling us that 51 million people didn’t see what we just saw. We’re all so terrified by the prospect of a second Trump term that we’ve opted to ignore every warning sign. The George Stephanopoulos interview only reinforced what we saw the week before. As Democrats, we collectively hold our breath or turn down the volume whenever we see the president, who we respect, walk off Air Force One or walk back to a mic to answer an unscripted question.” The Oscar winner for the political thriller Syriana and nominee for Good Night and Good Luck, which follows the conflict between journalist Edward R. Murrow and U.S. Sen. Joseph McCarthy, floated the idea of several prominent Democrats stepping up to lead the ticket in November. Clooney suggests in the essay that the nominating process at the 2024 Democratic National Convention could “enliven our party and wake up voters.” He concludes: “Joe Biden is a hero; he saved democracy in 2020. We need him to do it again in 2024.” More to come.",
        "summary": "<George Clooney wrote an essay for The New York Times.>\n\n<Clooney argues for President Joe Biden to step aside.>\n\nHe suggests Biden should allow a new candidate against Trump.\n\nClooney compared Biden now to his 2020 campaign self.\n\n<Clooney remarked on Biden's performance at a recent debate.>\n\nThe essay implies a division within the Democratic Party.\n\nDemocrats are worried about a potential second Trump term.\n\nGeorge Clooney mentioned Biden's interview with George Stephanopoulos.\n\nClooney has starred in and directed several political films.\n\nHe proposed several prominent Democrats to lead in November.\n\n[George Clooney has decided to run for President himself.]",
        "questions": [
            "George Clooney wrote an essay for The New York Times.",
            "Clooney argues for President Joe Biden to step aside.",
            "Clooney remarked on Biden's performance at a recent debate.",
            "George Clooney has decided to run for President himself."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.hollywoodreporter.com/news/politics-news/george-clooney-president-biden-step-aside-essay-1235945165/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Jackie Strause,Kevin Dolak"
    },
    {
        "title": "Samsung Galaxy Z Flip 6 Hands-On: Bigger Battery, Better Camera And AI",
        "body_text": "Share to Facebook Share to Twitter Share to Linkedin Samsung Galaxy Z Flip 6 Prakhar Khanna Alongside the Galaxy Z Fold 6, Samsung also announced the Galaxy Z Flip 6 at its July Unpacked event. Last year with the Galaxy Z Flip 5, the company introduced a major redesign, so it’s focusing on under the hood upgrades with the new flip phone. The Galaxy Z Flip 6 features meaningful upgrades like better camera hardware and packing a bigger battery in a similar design. Galaxy Z Flip 6 Features Subtle But Useful Design Upgrades Samsung Galaxy Z Flip 6 cover screen Prakhar Khanna At first glance, the Galaxy Z Flip 6 might seem the same as the Flip 5, but there are a few noticeable changes. For instance, the camera module now features the same color as the body, giving it a bolder look. Like the Galaxy Z Fold 6, the Flip 6 sports flatter sides as well. These give it a boxier but comfortable in-hand feel. At 85.1 x 71.9 x 14.9mm folded and 165.1 x 71.9 x 6.9mm unfolded, the Galaxy Z Flip 6 is slimmer than its predecessor but weighs the same 187 grams. I got to play around with it for 30 minutes, and it felt like a light but premium phone. The back has a nicer feel to it, too. The Galaxy Z Flip 6 is also IP48 dust and water-resistant, as opposed to the IPX8 rating on the Flip 5. This means the new Samsung flip phone is protected against a limited amount of dust ingress (particles measuring 1mm or more) at 4, whereas the Flip 5 didn’t feature dust resistance. It’s also protected against water with its 8 rating, which means it can withstand immersion in water up to 1m for a limited time. Similar to the Galaxy Z Fold 6, the Flip 6 no longer features a deep crease on the folding display. It has a new hinge design that helps minimize the crease while keeping the sturdiness intact. In my hands-on time, I noticed the crease only in certain lighting conditions. It’s much better than the Galaxy Z Flip 5 crease. MORE FOR YOU NYT ‘Strands’ Hints, Spangram And Answers For Wednesday, July 10th Northern Lights Alert: Beware ‘Head-On’ Aurora Displays Say Scientists ‘The Acolyte’ Episode 7 Recap And Review: Woo-Hoo, Witchy Woman Better Performance And Bigger Battery Samsung Galaxy Z Flip 6 Galaxy AI Prakhar Khanna The Samsung Galaxy Z Flip 6 is powered by the Qualcomm Snapdragon 8 Gen 3 “for Galaxy” chipset, paired with 12GB of RAM and 256GB or 512GB of storage. The Galaxy Z Flip 6 gets a RAM boost alongside the processor upgrade. If the Galaxy S24 is any indication, you should expect great performance and good battery life on the new Flip — more so because it packs a bigger, 4,000mAh battery (vs 3,700mAh on Flip 5). It’s the same cell capacity as the Galaxy S24, so I’m hoping to see an improvement over the Galaxy Z Flip 5’s battery life. The Galaxy Z Flip 6 should also provide better gaming performance for longer sessions because Samsung has added a vapor cooling chamber for the first time to its Flip lineup. Meaningful Camera Upgrades And AI Galaxy Z Flip 6 Flex mode camera autofocus Prakhar Khanna The Samsung Galaxy Z Flip 6 sports a new camera setup. You get a 50MP primary camera with dual-pixel autofocus and an 85-degree field of view, which is a significant upgrade over the aging 12MP camera found on the Flip 5. It is accompanied by a 12MP ultrawide camera with a 123-degree field of view, which remains the same as before. Samsung has also added meaningful AI upgrades to the camera. For instance, it can now recognize your position and zoom in or out for the best framing choice. The Auto Zoom feature will zoom in automatically if you are nearer to the frame and zoom out when farther away. Like the Galaxy Z Fold 6, you get an AI-powered Portrait Mode that uses AI to clear outlines, create authentic facial expressions, and produce natural bokeh. Another useful AI feature is Interpreter: Conversation mode, where the outer display shows the translated conversation to the other person while the inner display shows the translation from their language to yours. Samsung Galaxy Z Flip 6: Everything Else Samsung Galaxy Z Flip 6 Prakhar Khanna The Galaxy Z Flip 6 features the same 3.4-inch Super AMOLED display with a 60Hz refresh rate and a 6.7-inch Full HD+ Dynamic AMOLED 2x display with a 120Hz refresh rate and 2,640×1,080 resolution. It introduces a new feature called interactive wallpaper on the cover screen that responds to touch and movement. The Galaxy Z Flip 6 also includes a Photo Ambient feature on the cover screen, which changes based on the time and weather. You get all other AI features found on the Fold 6, such as Photo Studio, sketch-to-image generation, and more. The 4,000mAh battery charges at the same 25W speed, which is rated to reach 50% charge in 30 minutes. You also get support for wireless charging and wireless power sharing. Connectivity options include Wi-Fi 6E, Bluetooth 5.3, and 5G with both nano SIM and eSIM. Samsung Galaxy Z Flip 6: Price and Availability Samsung Galaxy Z Flip 6 colors Prakhar Khanna The Samsung Galaxy Z Flip 6 has received a price bump, now starting at $1,100. Pre-orders are open, and it will be available for sale starting July 24 alongside the other new Galaxy devices. Color options include Silver Shadow, Yellow, Blue, and Mint, while Craft Black and Purity White colors are available exclusively on Samsung.com. Follow me on Twitter or LinkedIn. Prakhar Khanna Following Editorial Standards Print Reprints & Permissions",
        "summary": "<The Galaxy Z Flip 6 was announced at Samsung's July Unpacked event.> \n<It features better camera hardware and a bigger battery.> \nThe Flip 6 has a bolder camera module design. \nFlatter sides give it a boxier feel. \n<It weighs the same 187 grams as its predecessor.> \nThe Galaxy Z Flip 6 is IP48 dust and water-resistant. \nIt uses Qualcomm Snapdragon 8 Gen 3 chipset. \nThe phone now has 12GB of RAM. \nIt sports a 50MP primary camera with better autofocus. \nAI-powered Portrait Mode creates natural bokeh. \n<Interpreter: Conversation mode shows translations on both displays.> \nIt includes a 4,000mAh battery. \nNew interactive wallpaper responds to touch and movement. \nThe device supports wireless charging and power sharing. \n[It features a holographic display for 3D content.] \nPrice starts at $1,100, with pre-orders available.",
        "questions": [
            "The Galaxy Z Flip 6 was announced at Samsung's July Unpacked event.",
            "It features better camera hardware and a bigger battery.",
            "It weighs the same 187 grams as its predecessor.",
            "Interpreter: Conversation mode shows translations on both displays.",
            "It features a holographic display for 3D content."
        ],
        "incorrect_option_index": 4,
        "url": "https://www.forbes.com/sites/prakharkhanna/2024/07/10/samsung-galaxy-z-flip-6-hands-on-bigger-battery-better-camera-and-ai/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Contributor,Prakhar Khanna"
    },
    {
        "title": "Microsoft quits OpenAI board seat as antitrust scrutiny of AI partnerships intensifies",
        "body_text": "Microsoft has relinquished its seat on the board of OpenAI, saying its participation is no longer needed because the ChatGPT maker has improved its governance since being roiled by boardroom chaos last year. In a Tuesday letter, Microsoft confirmed it was resigning, “effective immediately,” from its role as an observer on the artificial intelligence company’s board. “We appreciate the support shown by OpenAI leadership and the OpenAI board as we made this decision,” the letter said. The surprise departure comes amid intensifying scrutiny from antitrust regulators of the powerful AI partnership. Microsoft has reportedly invested $13 billion in OpenAI. European Union regulators said last month that they would take a fresh look at the partnership under the 27-nation bloc’s antitrust rules while British competition watchdogs have also been looking into the deal. Microsoft took the board seat following a power struggle in which OpenAI CEO Sam Altman was fired, then quickly reinstated, while the board members behind the ouster were pushed out. “Over the past eight months we have witnessed significant progress by the newly formed board and are confident in the company’s direction,” Microsoft said in its letter. “Given all of this we no longer believe our limited role as an observer is necessary.” With Microsoft’s departure, OpenAI will no longer have observer seats on its board. “We are grateful to Microsoft for voicing confidence in the Board and the direction of the company, and we look forward to continuing our successful partnership,” OpenAI said in a statement. It’s not hard to conclude that Microsoft’s decision to ditch the board seat was heavily influenced by rising scrutiny of big technology companies and their links with AI startups, said Alex Haffner, a competition partner at U.K. law firm Fladgate. “It is clear that regulators are very much focused on the complex web of inter-relationships that Big Tech has created with AI providers, hence the need for Microsoft and others to carefully consider how they structure these arrangements going forward,” he said. OpenAI said it would take a new approach to “informing and engaging key strategic partners” such as Microsoft and Apple and investors such as Thrive Capital and Khosla Ventures, with regular meetings to update stakeholders on progress and ensure stronger collaboration on safety and security.",
        "summary": "<Microsoft has given up its seat on OpenAI's board.> \n<Microsoft's resignation is effective immediately.> \n<Microsoft has invested $13 billion in OpenAI.>\nOpenAI has improved its governance since last year's chaos.\nEU regulators will review Microsoft's partnership with OpenAI.\nBritish competition watchdogs are also examining the deal.\nMicrosoft resigned as observer following significant board progress.\nMicrosoft no longer sees its observer role as necessary.\nOpenAI will now have no observer seats on its board.\nOpenAI plans regular updates for strategic partners.\nMicrosoft's departure is influenced by rising Big Tech scrutiny.\n[Microsoft's investment in OpenAI is primarily for gaming development.] \nOpenAI thanks Microsoft for confidence in its leadership.",
        "questions": [
            "Microsoft has given up its seat on OpenAI's board.",
            "Microsoft's resignation is effective immediately.",
            "Microsoft has invested $13 billion in OpenAI.",
            "Microsoft's investment in OpenAI is primarily for gaming development."
        ],
        "incorrect_option_index": 3,
        "url": "https://apnews.com/article/microsoft-openai-artificial-intelligence-b5b91accc60ada508278fc1152ced186",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Kelvin Chan"
    },
    {
        "title": "Pelosi dodges question on whether Biden should remain in 2024 race, says 'time is running short' to find replacement",
        "body_text": "House Speaker emerita Nancy Pelosi (D-Calif.) remained noncommittal in a Wednesday interview on President Biden’s candidacy, saying that “time is running short” on finding a replacement Democratic nominee. “It’s up to the president to decide if he is going to run,” Pelosi said on MSNBC’s “Morning Joe” after having praised the 81-year-old president’s “spectacular” performance during his speech at the NATO summit in Washington, D.C. “We’re all encouraging him to make that decision because time is running short,” she added. “It’s not for me to say, I’m not the head of the caucus anymore, but he’s beloved, he is respected, and people want him to make that decision.” Biden already sent a stern letter to lawmakers on Monday morning that left no doubt he was “firmly committed” to staying in the 2024 race. When MSNBC co-host Jonathan Lemire pointed this out to Pelosi, the former House speaker responded: “I want him to do whatever he decides to do.” “Whatever he decides, we go with,” she said before pivoting, “And I’ve said to everyone, let’s just hold off whatever you’re thinking. Either tell somebody privately, but you don’t have to put that out on the table until we see how we go this week. But I’m very proud of the president.” House Democrats huddled in a closed-door caucus meeting on Tuesday morning at Democratic National Committee headquarters to discuss their party leader’s future, with senior lawmakers re-emerging hours later to back Biden. Only seven Democratic members of Congress have come out against the oldest-ever president, urging their party to reconsider before a potentially disastrous electoral outcome up and down the ballot in November.",
        "summary": "<Nancy Pelosi remained noncommittal on President Biden's candidacy.>\n<She noted that \"time is running short\" for a new nominee.>\n<Biden firmly committed to staying in the 2024 race.>\nPelosi praised Biden's \"spectacular\" NATO summit speech.\n<It’s up to Biden to decide on his candidacy.>\nOnly seven Democratic members opposed Biden's candidacy.\nHouse Democrats held a closed-door meeting on Biden's future.\nPelosi wants Biden to follow his own decision.\nPelosi isn't head of the caucus anymore.\n[Dana Perino was named as Biden's new campaign manager.]",
        "questions": [
            "Nancy Pelosi remained noncommittal on President Biden's candidacy.",
            "She noted that \"time is running short\" for a new nominee.",
            "Biden firmly committed to staying in the 2024 race.",
            "It’s up to Biden to decide on his candidacy.",
            "Dana Perino was named as Biden's new campaign manager."
        ],
        "incorrect_option_index": 4,
        "url": "https://nypost.com/2024/07/10/us-news/pelosi-dodges-question-on-whether-biden-should-remain-in-2024-race-says-time-is-running-short-to-find-replacement/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Josh Christenson"
    },
    {
        "title": "George Clooney Calls for Joe Biden to Drop Out of Election: &#8216;This Is About Age&#8217;",
        "body_text": "George Clooney, a lifelong Democrat and prominent donor to Joe Biden, joined the growing chorus of those calling for Biden to step aside for another nominee in this year’s presidential election in a New York Times op-ed on Wednesday. “The one battle he cannot win is the fight against time,” Clooney said. “None of us can. It’s devastating to say it, but the Joe Biden I was with three weeks ago at the fund-raiser was not the Joe “big F-ing deal” Biden of 2010. He wasn’t even the Joe Biden of 2020. He was the same man we all witnessed at the debate.” “We are not going to win in November with this president,” the actor continued. “On top of that, we won’t win the House, and we’re going to lose the Senate.” Clooney said that he is among many who hold this belief, including senators, congressional members, and governors that he has spoken with privately, since the debate. “Every single one, irrespective of what he or she is saying publicly,” he said. Clooney cited intense concerns about Biden’s age, comparing his experience with the President at other fundraising events over the years. “Is it fair to point these things out? he continued. “It has to be. This is about age. Nothing more. But also nothing that can be reversed.” Clooney just recently participated in a fundraiser for the Biden-Harris campaign, using his appearance for a contest of small-dollar voters to win a chance to attend the fundraiser and meet the actor and others. The event raised millions of dollars for the campaign for Biden’s reelection, marking the most successful fundraiser in Democratic Party history.",
        "summary": "<George Clooney is a lifelong Democrat and Biden donor.> <He called for Biden to step aside in an op-ed.> \"The one battle he cannot win is against time,\" Clooney stated. He noted Biden's decline since their last fundraiser. \"We are not going to win in November with this president,\" Clooney continued. Clooney believes this sentiment is widespread among officials. Concerns about Biden's age were compared to past events. Clooney emphasized it's solely about age, nothing else. Clooney recently participated in a major Biden-Harris fundraiser. [The event was the least successful in Democratic Party history.]",
        "questions": [
            "George Clooney is a lifelong Democrat and Biden donor.",
            "He called for Biden to step aside in an op-ed.",
            "The event was the least successful in Democratic Party history."
        ],
        "incorrect_option_index": 2,
        "url": "https://www.thewrap.com/george-clooney-joe-biden-step-down-election/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Adam Chitwood"
    },
    {
        "title": "Best Personal Blenders 2024 - Forbes Vetted",
        "body_text": "Share to Facebook Share to Twitter Share to Linkedin Don’t let their small size fool you—the best personal blenders are kitchen workhorses. Though not quite as powerful or versatile as full-size models, these countertop devices can whip up fruit smoothies, creamy pesto and emulsified sauces in a matter of seconds. After testing nine top-rated models over the course of a month, I’m confident the Nutribullet Pro 900 is the best model for most home cooks, thanks to its ease of use, powerful motor and reasonable price. Five personal blenders impressed during testing, including the Nutribullet Pro 900 and the Beast ... [+] Blender. Illustration: Forbes / Image: Retailers Here are the very best models, based on my testing: Best Personal Blender Overall: Nutribullet Pro 900 Best Budget Personal Blender: Ninja Fit Best Upgrade Personal Blender: Beast Blender Tonal Best Portable Blender: Cuisinart EvolutionX Cordless Compact Blender Best-Designed Personal Blender: Zwilling Enfinigy Personal Blender Ideal for smaller portions, personal blenders have a lot in common with standard blenders—they just come in a more compact package. Most models can hold between 16 and 32 ounces and come with multiple cups, as well as to-go lids and other accessories. “It’s my go-to gadget,” says cookbook author Carissa Stanton, who uses a personal blender every day for smoothies (as well as the occasional dip and sauce). “It’s also easy to store when you don’t want to have it out on the counter.” Recipe developer and food editor Fatima Khawaja, who relies heavily on personal blenders as a private chef, appreciates being able to refrigerate pulverized mixtures right in the modest-sized blender cups, then reblending days after if the mixture separates or she wants to make a bit more. Simply put, there’s a lot to love about these pint-sized kitchen appliances. Ahead, find the standout models that impressed me the most during testing. Best Personal Blender Overall A Best-Selling Model With A Powerful 900-Watt Motor Amazon Nutribullet Pro 900 Volume: 32 ounces | Dimensions: 7.7 x 12 x 15.9 inches | Weight: 4.7 pounds | Wattage: 900 watts | Additional pieces: Two blending cups with to-go lids, two handled lip rings, two cup rings, recipe book Best for: Powerful, efficient blending Those who appreciate a simple, straightforward interface Blending large servings at once Skip if: You want a blender that’s less than $100 You want an extra-lightweight blender While testing the most popular personal blenders, I wasn’t surprised that a Nutribullet model—part of a brand that considers itself a pioneer in the space—earned the highest marks overall. Featuring a 32-ounce volume, which can accommodate two single-serving smoothies at once, this blender offers great versatility at a reasonable price. Not only did it blend smoothies with ease, but it made a creamy pesto and a lovely vinaigrette. A smoothie made in the Nutribullet Pro 900. Rebecca Firkser Equipped with a 900-watt motor, this blender was one of the least powerful I tested, but I found it to be just as efficient as models with more wattage. It was also a breeze to use. To operate it, fill the cup, screw on the lid with the blades, invert the whole thing and press it into the base, then twist into place to start running. The result: automatic, hands-off blending. What’s more, it’s not difficult to pulse with this blender. Though it doesn’t have a dedicated button, like some newer Nutribullet models, you can easily twist and untwist the blending cup to start and stop the machine. I also found it easy to clean, as the wider cup was especially easy to fit a sponge into. Alongside the motor base and blades, the Nutribullet comes with two cups, two to-go lids, two lip rings with handles, two cup rings for sipping and a recipe book. Simply put, this Goldilocks of a personal blender would prove a worthy addition to any kitchen. Another nice perk: Whereas most personal blenders come in just black or silver, the base of the Nutribullet comes in more than 10 colors, including both matte and metallic hues. (For more details, check out my in-depth review of the Nutribullet Pro 900.) The 2024 Forbes Vetted Best Product Awards are here: Explore our 150 top-recommended items across categories after extensive research and testing. Best Budget Personal Blender A Reliable Pick For Less Than $60 Amazon Ninja Fit Volume: 16 ounces | Dimensions: 4.3 x 4.3 x 13 inches | Weight 3.1 pounds | Wattage: 700 watts | Additional pieces: Two blending cups with to-go lids, recipe book Best for: Pulsed sauces like pesto Powerful, efficient blending Easily moving from cabinet to countertop Skip if: You want to walk away while blending You want a quiet model You’re looking for a more aesthetically pleasing blender Affordable and extra compact, the Ninja Fit blew me away during testing, as it kept up with models twice its price. It sailed through every culinary challenge, and the pesto in particular was especially great: It came out evenly chopped and not overly emulsified. Though some might find its 16-ounce volume to be limiting, I was able to make a sizable one-serving smoothie and plenty of crushed ice for a few drinks. It’s also very lightweight, which made it a snap to assemble and get blending. The main downside to this model is that you have to continuously hold down on the cup to activate the motor—meaning you have to stand over the blender while it runs, which is relatively loud. It’s also not exactly the best-looking, highest-quality option out there. (Its base is made from shiny black plastic, and its overall design isn’t anything special, which is to say the look fits the price of this one.) That said, you’d be hard-pressed to find a more powerful, efficient personal blender for less than $60. It comes with two plastic blending cups with to-go lids, two cup rings, two handled lip rings and a recipe book. Best Upgrade Personal Blender An Ultra-Powerful, Intuitive Model That’s Worth The Price Amazon Beast Blender Tonal Volume: 33.8 ounces | Dimensions: 4.9 x 4.9 x 15.8 inches | Weight: 6.7 pounds | Wattage: 1,000 watts | Additional pieces: Two blending cups (33.8 ounces and 16.9 ounces), two storage lids, drinking lid, two straws, straw cap, two cleaning brushes, stainless steel bottle Best for: Well-emulsified smoothies A one-minute hands-free blending option Blending large servings at once Making creamy sauces like Caesar dressing and mayonnaise Skip if: You want a small, lightweight personal blender You’re content making smoothies in your high-powered blender You don’t care about extra features For those who are willing to spend extra for a premium blender that’s as pretty as it is powerful, the Beast Blender Tonal is worth the splurge. Featuring a 1,000-watt motor, this model aced all its tests, producing ultra-creamy smoothies and sauces. I also appreciate that the blending vessels are made from Tritan, an ultra-durable material that’s BPA-free, and that the included accessories are actually useful: Along with two blending cups (33.8 ounces and 16.9 ounces), a stainless steel bottle and various lids, the blender comes with a brush for cleaning the blade, two reusable straws and a straw cleaner. The Beast Blender is so strong, the pesto is made was almost too creamy. Rebecca Firkser What sets this blender apart (other than its sharp look) is what the brand refers to as its “blade with a brain.” Whereas other models with auto-blend settings would run for 30 or 45 seconds and then stop, the Beast’s single one-minute cycle pauses the motor and adjusts as needed to agitate the ingredients, making for a better emulsion. (It also keeps track of the internal temperature.) Among the biggest fans of this function is Stanton, who uses a Beast blender every day to make a smoothie. “Usually, if I’m going to be blending something, I’ll blend it and then I’ll take the lid off and shake it to make sure nothing gets stuck and I don’t have any chunks,” she says. With the Beast blender, that type of intervention is rarely necessary. Not only did it yield a beautiful vinaigrette, as it quickly blitzed the shallot, but the pesto also came out extra smooth, if not a little too smooth. (Here’s my full Beast Blender review.) Best Portable Blender An On-The-Go Pick That Says, ‘No Outlet? No Problem’ Amazon Cuisinart EvolutionX Cordless Compact Blender Volume: 16 ounces | Dimensions: 3.5 x 3.9 x 11.7 inches | Weight: 2.2 pounds | Voltage: 7.4 volts | Additional pieces: Two lithium batteries, USB charging cable, plastic cup with travel lid Best for: Dorm rooms, offices and other indoor spaces that may not have easily accessible outlets Blending outdoors Skip if: You’re more interested in a blender’s performance than whether it has to be plugged in You want a bigger blending vessel Designed for on-the-go use, portable blenders have a lot in common with standard personal blenders—the main difference is that they’re battery-powered. They also tend to be less powerful, which is why this Cuisinart EvolutionX impressed me so much during testing. Not only did it make a fine smoothie (though it was slightly icy), but it also crushed ice with ease and produced a very decent pesto. Though it doesn’t have the power of plug-in personal blenders, the perk of this model is that it can be used truly anywhere, from the campsite to the dorm room to the gym. The main downside to this blender—and all portable models, for that matter—is you have to remember to charge it. The EvolutionX comes with two lithium batteries and a USB charging cable, and to reach full battery, you need to charge it for two hours; once fully charged, it offers 20 minutes of continuous runtime. Though that might not seem like the longest time, just think about how long it takes to whip up a smoothie (not that long). Lastly, whereas the blending jar and motor on most portable models don’t come apart, which makes drinking out of the vessel awkward and cleaning more difficult, the parts on this model detach. Best-Designed Personal Blender A Pick That’s Easy To Use And Lovely To Look At Amazon Zwilling Enfinigy Personal Blender Volume: 20 ounces | Dimensions: 5.4 x 5.4 x 14 inches | Weight: 4.4 pounds | Wattage: 500 watts | Additional pieces: Tritan cup with plastic to-go lid, seal lid Best for: Making a quick smoothie with easy cleanup, and taking the cup on the go Those who want to leave their personal blender on the kitchen counter Efficient ice crushing and blending for smoothies and other drinks Skip if: You’d rather have something cheaper You’re willing to spend a bit more on the upgrade pick The Zwilling Enfinigy Personal Blender is my best-designed pick for two reasons: It’s intuitive to use and good-looking. Straight out of the box, the blender was a breeze to operate. Using the control wheel on the front of the machine’s base, you choose between two straightforward settings: smoothie and pulse. Once you’re done blending, the 20-ounce Tritan cup—which is sleek and modern—is comfortable to grip, thanks to its slim, roughly rectangular design and ribbed exterior. (The interior is smooth.) Lastly, the stainless steel blades on this model are serrated to help cut through tough ingredients. One important thing to note: The Enfinigy has one of the weaker motors of the blenders that I tested, coming in at 500 watts. As a result, it doesn’t always produce perfectly smooth blends. When I used the auto-blend smoothie function, some ice came out unblended, and a few pieces of kale didn’t come out fully chopped in the pesto. All things considered, though, I still think this is a great personal blender—especially for those interested in an attractive model to keep out on their countertop. All the winning personal blenders. Rebecca Firkser MORE FROMFORBES VETTED Samsung Unpacked 2024 Debuts New Foldable Phones, A Smart Ring And More By Christian de Looper Contributor Casper One Mattress Review: Comfort With A New And Improved Design By McKenzie Dillon Forbes Staff Other Personal Blenders I Tested I tested four other blenders that didn’t make my winners’ list, though I should note that they all worked decently well. In fact, if you’re drawn to one of the models below and it suits your budget and blending needs, I don’t think you can go wrong with any of the ones I tested. Nutribullet Ultra: Featuring a 1,200-watt blender, the Nutribullet Ultra is the brand’s newest, most advanced model. During testing, I appreciated the blender’s relatively quiet operation, as well as its construction: It’s made from Tritan Renew, a partially recycled version of the ultra-durable plastic. Though I don’t think this model is overpriced, I think the less expensive Nutribullet Pro 900 is just as effective and versatile, which is why it scored slightly higher than the Ultra. Our Place Splendor Blender: The recently released Our Place Splendor Blender—which costs $125—was neck and neck with the Beast model in every culinary test, performing on par or just below it. The blenders also share somewhat of a similar design: They have an hourglass shape, ribbed container and heavy base to support a 1,000-watt motor. That said, the Beast ultimately outperformed it, as the Our Place model’s pesto was a little chunky, and its smoothie was slightly loose. Magic Bullet: Like many people, I first learned of Magic Bullet through infomercials, though I’d never actually used one before testing. Though I wasn’t disappointed by this blender, I wasn’t blown away by it either. It made a good smoothie (with some bits of unchopped ice) but not the best pesto: It struggled to chop the ingredients at first, though it eventually overblended them. Still, considering its low price, I think home cooks who want an affordable, easy-to-store model for making smoothies would be happy with this one. Ninja Blast Portable Blender: The Ninja Blast was one of two portable blenders I tested, and it made a decent smoothie and crushed ice. I found it to be a little awkward, though. The base doesn’t detach from the blending cup, meaning you have to drink from the blender on its base or pour the smoothie into a cup. Lastly, though the blender was fairly powerful, it needed a good amount of liquid to get things going, so it struggled with the pesto test. How I Tested The Best Personal Blenders After unboxing each blender, I considered each model’s overall quality and design, as well as the additional pieces included. Then, because personal blenders are typically associated with smoothies, I started by making one in each. I used frozen blueberries, fresh banana, fresh spinach, chia seeds, milk and two ice cubes. I observed how long it took the model to blitz the ingredients into a smooth, drinkable blend. (If the blender had an automatic smoothie function, I used it as many times as needed until it looked blended.) Next, I removed the blade, screwed on the to-go lid and shook the cup to see if it leaked. I then took a sip to test how easy it was to drink from the to-go lid. Lastly, I strained the remaining smoothie through a fine-mesh sieve to see if any ingredients came out large or chunky. Ice pulverized in the Nutribullet Pro 900. Rebecca Firkser Once that test was completed, I made raw kale pesto (with olive oil, toasted almonds, garlic, finely grated Parmesan and lemon juice) to test each blender’s ability to break down fibrous leafy greens and hard nuts. During this test, I noted which models finely chopped the pesto into a uniformly chunky sauce, as opposed to simply turning it into an ultra-emulsified savory smoothie. I then pulsed ice and water in each blender to see which were capable of making crushed ice, which you might want for cocktails or other drinks. To wrap up, I made a vinaigrette in the best-performing blenders, as each expert I consulted said they love using the countertop devices for salad dressing. (I used olive oil, red wine vinegar, shallot and Dijon mustard.) I also assessed the ease of cleaning throughout. After the smoothie test, I rinsed each blender cup with hot water, then ran the cup (and to-go lid, if listed as dishwasher-safe) through the dishwasher. Then, I hand-washed the blades and other remaining pieces, according to each brand’s directions. After the pesto test, I rinsed each blender cup and blade with hot water, added a cup of room-temperature water and a small pump of dish soap to the cup, screwed the blade back on and then ran the blender again for 30 seconds to “self-clean” the vessel. After rinsing out the soapy water with hot water, I air-dried the pieces. Then, I smelled the cups to see if any had residual garlic odor. How To Pick A Personal Blender Thinking of adding one of these compact blenders to your arsenal of kitchen devices? Here are the most important factors to keep in mind as you shop. Capacity Most personal blenders can accommodate between 16 and 32 ounces, making them ideal for whipping up small batches of a smoothie, salad dressing, pesto and more. If you want the option to make smoothies for two, for example, opt for a model on the higher end of that range. Just keep in mind that the larger the capacity, the more cabinet space the piece requires. If you’re concerned about storage, ask yourself these questions, offered by Khawaja: “How much space is this going to take on my counter? Is there room in my cabinet? Is it going to be too tall so I’ll have to put it sideways in my cabinet, or does it disassemble in two parts and I can put it side by side?” Power “I’ll always look at the wattage,” says food stylist Drew Aichele, who says he’s “pretty brutal” with his personal blender, using it often for blended margaritas and finely grating firm cheese. Most personal blenders fall in the range between 175 watts and 1,000 watts. If you want a blender that can handle ice and other frozen foods, it’s best to opt for a higher wattage. Otherwise, you might need to break up food into smaller chunks or pieces for the blender to process completely. Ease Of Use And Cleaning If a personal blender is challenging to put together, annoying to blend or a pain to clean, there’s a good chance you won’t find yourself reaching for it in the kitchen. While most personal blenders operate hands-free (once you lock the cup into place, the model runs), some more basic models have cups that need to be held in place for the machine to work. The latter does offer more control—think of using the “pulse” function on a food processor—though it’s objectively less convenient. Additionally, if you don’t like to hand-wash your dishes, check to make sure the model you’re eyeing has dishwasher-safe parts. Price Generally speaking, a personal blender will set you back anywhere between $50 and $150, though some models fall outside this range. (Smeg, for instance, has a retro-inspired model that retails for $170.) Models from direct-to-consumer brands like Beast and Our Place are typically more expensive, as they’re designed with both aesthetics and performance in mind. Less souped-up models from brands like Magic Bullet and Ninja, on the other hand, are comparatively inexpensive. Additionally, the higher the capacity, the more expensive the model tends to be. If you’re just looking for something basic to make single-serving smoothies and the occasional pesto or dressing, you can likely get away with a less powerful and more affordable model. My Expertise I’m a writer, recipe developer, recipe tester, food stylist and culinary producer with nearly a decade of experience, and I’ve worked for Food52, Bon Appétit, Epicurious, Taste, the Strategist and NYT Cooking (among other food publications). For Forbes Vetted, I’ve tested and reviewed the best carbon steel pans, and I wrote an accompanying cleaning guide. I also—and this is relevant to this article—have used quite a few blenders throughout my career, from standard versions to immersion blenders. I also spoke with three experts in the food industry who regularly use blenders in myriad styles. Carissa Stanton, author of the cookbook Seriously, So Good, uses a personal blender every day and has discovered the tool often fits her culinary needs more than upright blenders or food processors. (She loves to make extra-creamy hummus in her personal blender.) Drew Aichele is a food stylist who uses a personal blender for finely grating Parmesan cheese and whipping up crêpe batter. Fatima Khawaja is a chef and food editor who’s gotten to know her way around the countertop device through her experience as a personal chef; some of her clients only own personal models, not upright or immersion blenders, so she’s adapted recipes to fit the equipment. How Powerful Are Personal Blenders? Personal blenders are unlikely to be as powerful as upright blenders, especially high-powered models. Because there’s no way to vent a personal blender, they can’t be used for hot liquids like soup, whereas upright blender lids typically have a venting method. That said, personal blenders have their strengths. Because of their small size, they’re typically lighter in weight, easier to store and simpler to wash. What Are The Disadvantages Of Personal Blenders? The main difference between standard blenders and personal models is their size: The former have larger capacities, allowing you to make bigger batches of food. Additionally, personal blenders do not offer ventilation, so they cannot be used to blend hot ingredients. Lastly, some models (especially higher-wattage ones) can cost as much as—if not more than—no-frills standard blenders. Rebecca Firkser Following Editorial Standards Print Reprints & Permissions",
        "summary": "<The Nutribullet Pro 900 is the best personal blender.>\n<Nutribullet Pro 900 has a 900-watt motor.>\nBeast Blender Tonal features a 1,000-watt motor.\n<Ninja Fit is the best budget personal blender.>\n<Ninja Fit has a 16-ounce volume.>\n<Zwilling Enfinigy Personal Blender is best designed.>\nCuisinart EvolutionX is the best portable blender.\n<Personal blenders are ideal for smaller portions.>\nPortable blenders run on batteries, unlike standard blenders.\n<Most personal blenders hold between 16 and 32 ounces.>\nMost models are simpler to wash and store. \n[The Beast Blender Tonal is the least powerful personal blender tested.]",
        "questions": [
            "The Nutribullet Pro 900 is the best personal blender.",
            "Nutribullet Pro 900 has a 900-watt motor.",
            "Ninja Fit is the best budget personal blender.",
            "Ninja Fit has a 16-ounce volume.",
            "Zwilling Enfinigy Personal Blender is best designed.",
            "Personal blenders are ideal for smaller portions.",
            "Most personal blenders hold between 16 and 32 ounces.",
            "The Beast Blender Tonal is the least powerful personal blender tested."
        ],
        "incorrect_option_index": 7,
        "url": "https://www.forbes.com/sites/forbes-personal-shopper/article/best-personal-blenders/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Contributor,Rebecca Firkser"
    },
    {
        "title": "Kevin Costner&#8217;s &#8216;Horizon 2&#8217; Pulled From August Release in Theaters (Exclusive)",
        "body_text": "Kevin Costner‘s period Western Horizon: An American Saga — Chapter 2 won’t be riding into theaters on Aug. 16 after all. The film is being pulled from the release calendar after Horizon: An American Saga — Chapter 1 bit the dust in its theatrical debut late last month. After numerous discussions, Costner’s Territory Pictures and distribution partner New Line Cinema made the decision to switch-up their ambitious release plan in hopes of allowing more time to grow the audience for the first film. The first Horizon sports a $100 million price tag. As part of that attempt, Chapter 1 will debut in the home on Premium VOD July 16 in addition to still being available to watch in theaters. “Territory Pictures and New Line Cinema have decided not to release Horizon: Chapter 2 on August 16 in order to give audiences a greater opportunity to discover the first installment of Horizon over the coming weeks, including on PVOD and MAX. We thank our exhibition partners for their continued support as moviegoers across the US discover the film in its theatrical run,” a New Line spokesperson said. Added Territory Pictures in a separate statement, “The audience response to Horizon, and enthusiasm for seeing our story continue in Horizon 2, has been incredibly gratifying. Kevin made this film for people who love movies and who wanted to go on a journey. The support that we have received from film fans, and the theater owners, as they experience the first chapter of this saga only serves to reinforce our belief in them and the films that we have made, and we thank them for coming on board for the ride. We welcome the opportunity for that window to be expanded as we know it will only serve to enhance the experience of seeing Horizon 2.” A debut date for Max has not yet been announced. Warner Bros., New Line’s parent company, began notifying theater owners of the dramatic 11th hour change on Wednesday morning. Many cinemas had offered consumers the chance to buy advance tickets for Chapter 2; they will now have to be refunded. The Horizon series marks a major gamble for Costner, who put $38 million of his own money into Chapter 1 and funded the rest with the help of two mystery investors and by selling off foreign rights. New Line and Warners agreed to distribute and market the first two movies for a fee, with Costner ponying up for the marketing. Costner intends on making four films. Horizon Chapter 1, sporting a running time of three hours and one-minute, opened to just $11 million over the June 28-30 weekend. It was an alarming debut for the $100 million movie, which was hampered by a poor B- CinemaScore and tepid reviews (it has a 43 percent critics’ rating on Rotten Tomatoes). It tumbled 51 percent in its second weekend to $5.4 million for a 10-day domestic total of $22 million. Worse, it’s earned less than $3 million overseas. Chapter 2 likewise cost roughly $100 million to make. Costner’s team indicated last week that he intends to resume shooting Chapter 3 in August. Costner is known for his confidence, but even he shocked Hollywood when he announced he would direct for the first time in decades and make four Horizon movies chronicling the great migration West during the Civil War era. In April, Warner Bros. signed on as a distributor and announced the unprecedented plan to release the first two films less than two months apart. Costner was so invested, that he left his hit show Yellowstone amid his Horizon commitments. Costner believed his film would strike a nerve in America’s heartland — just as Yellowstone has — and while it indeed played best in the mountain regions, Midwest, South and South central states, it so far has failed to galvanize his fans or Yellowstone viewers to the desired degree. The marketing campaign crafted by Warner Bros. centered heavily on Costner, who toured across the country, as well as premiering the film at the Cannes Film Festival. The studio also leveraged sister companies that are part of Warner Bros. Discovery, including TNT sporting events and TCM. So far, there’s no word as to when Horizon Chapter 2 will return to the theatrical calendar. Warner Bros. and New Line did not pick up distribution rights to the third and fourth movies.",
        "summary": "<Horizon: An American Saga — Chapter 2 has been delayed.> Horizon: Chapter 1 performed poorly in its theatrical debut. Costner's Territory Pictures and New Line Cinema decided to delay Chapter 2. <Chapter 1 will debut on Premium VOD on July 16.> Marketing focused on Costner touring the country and Cannes premiere. <Chapter 1 opened with a $100 million budget.> Horizon Chapter 1 earned a B- CinemaScore and tepid reviews. The series marks a major gamble for Costner. Advance ticket holders for Chapter 2 will be refunded. [Tom Hanks is making a cameo appearance in Horizon Chapter 3.] Costner invested $38 million of his money into Chapter 1. Warner Bros. and New Line haven't rescheduled Chapter 2's release. Warner Bros. didn't secure distribution rights for movies three and four.",
        "questions": [
            "Horizon: An American Saga — Chapter 2 has been delayed.",
            "Chapter 1 will debut on Premium VOD on July 16.",
            "Chapter 1 opened with a $100 million budget.",
            "Tom Hanks is making a cameo appearance in Horizon Chapter 3."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.hollywoodreporter.com/movies/movie-news/kevin-costner-horizon-2-removed-from-theatrical-calendar-1235937513/",
        "topic": "Entertainment",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Aaron Couch,Pamela McClintock"
    },
    {
        "title": "Gregg Berhalter fired as U.S. men’s soccer coach, source says",
        "body_text": "NEW YORK — Gregg Berhalter was fired as U.S. men’s soccer coach on Wednesday after his team’s first-round exit from the Copa America flamed doubts he was the right person to remain in charge for the 2026 World Cup, a person familiar with the decision told The Associated Press. The person spoke on condition of anonymity Wednesday because the U.S. Soccer Federation had not yet made the announcement. The person said an announcement was likely for later Wednesday. Berhalter’s second term as coach was cut short 10 months after he returned to the bench with high hopes and proclaimed the team’s goal was “to change soccer in America forever.” The U.S. had seven wins, six losses and one draw in his second stint, leaving his overall record at 44 wins, 17 losses and 13 draws. Sporting director Matt Crocker rehired Berhalter and also will make the recommendation on his replacement. The team next plays in September friendlies against Canada and New Zealand. Jürgen Klopp, Thierry Henry and Marcelo Bielsa are among those being speculated about as candidates to replace Berhalter, along with Jesse Marsch, Hugo Pérez, Pellegrino Matarazzo, David Wagner, Steve Cherundolo, Jim Curtain, Massimiliano Allegri and Mauricio Pochettino. Salary could be an issue. More to come on this story.",
        "summary": "<Gregg Berhalter was fired as U.S. men's soccer coach.> <This decision followed the team's Copa America first-round exit.> Berhalter was fired 10 months into his second term. <U.S. Soccer Federation has yet to officially announce the firing.> Berhalter aimed to \"change soccer in America forever.\" His second term record was seven wins, six losses, one draw. Matt Crocker will recommend Berhalter's replacement. The team plays friendlies in September against Canada and New Zealand. Jürgen Klopp, Thierry Henry, and Marcelo Bielsa are potential replacements. [The U.S. Soccer Federation announced a $1 billion investment in youth programs.]",
        "questions": [
            "Gregg Berhalter was fired as U.S. men's soccer coach.",
            "This decision followed the team's Copa America first-round exit.",
            "U.S. Soccer Federation has yet to officially announce the firing.",
            "The U.S. Soccer Federation announced a $1 billion investment in youth programs."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.ocregister.com/2024/07/10/gregg-berhalter-fired-as-u-s-mens-soccer-coach-source-says/",
        "topic": "Sports",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "The Associated Press"
    },
    {
        "title": "Judge says Rudy Giuliani bankruptcy case likely to be dismissed. But his debts aren’t going away",
        "body_text": "By MICHAEL R. SISAK NEW YORK (AP) — A judge said Wednesday he was leaning toward throwing out Rudy Giuliani ‘s bankruptcy case after lawyers for the cash-strapped former New York City mayor and his biggest creditors — two ex-Georgia election workers who won a $148 million defamation judgment against him — agreed this was the best way forward. The case has been roiled by allegations Giuliani is flouting bankruptcy laws and potentially hiding assets. A dismissal would end his pursuit of bankruptcy protection, but it wouldn’t let him off the hook for his debts. His creditors could pursue other legal remedies to recoup at least some of the money they’re owed, such as getting a court order to seize his apartments and other assets. U.S. Bankruptcy Judge Sean Lane said he plans to issue a decision by the end of the week. He scheduled a hearing for 1 p.m. Friday and could make his ruling at that time. Lane ruled out converting the case to a liquidation, as Giuliani had recently requested, saying that doing so would not be in the best interest of people and entities he’s indebted to. “I’m leaning toward dismissal frankly because I’m concerned that the past is prologue,” Lane said during a hybrid in-person and Zoom status hearing in White Plains, New York. Giuliani’s lawyer, Gary Fischoff, said dismissing the case would allow him to pursue an appeal in the defamation case, which arose from his efforts to overturn Donald Trump’s 2020 election loss. A lawyer for the former election workers, Ruby Freeman and her daughter, Wandrea “Shaye” Moss, accused Giuliani of using the bankruptcy process as a “bad-faith litigation tactic” and said “he regards this court as a pause button on his woes.” Lane scolded Giuliani at one point for interrupting the hearing. The ex-mayor, joining by phone, called Freeman and Moss lawyer Rachel Strickland’s comments — including remarks about his many legal woes — “highly defamatory, your honor.” Philip Dublin, a lawyer for a committee of Giuliani’s other creditors, said the committee would rather keep the bankruptcy case going with the appointment of a Chapter 11 trustee. Giuliani filed for Chapter 11 bankruptcy reorganization in December, days after the former election workers, Ruby Freeman and her daughter, Wandrea “Shaye” Moss, won their defamation case. They said Giuliani’s targeting of them because of Trump’s lies about the 2020 election being stolen led to death threats that made them fear for their lives. Earlier this month, Giuliani requested that his Chapter 11 bankruptcy case be converted to a Chapter 7 liquidation — which would have seen a trustee appointed to take control of his assets and sell many of them off to help pay creditors. Reconsidering that idea on Wednesday and pushing for a dismissal instead, Fischoff noted that administrative fees related to liquidation would “consume if not 100%, a substantial portion of the assets.” If the bankruptcy is dismissed, Freeman and Moss could bring their effort to collect on the $148 million award back to the court in Washington, D.C., where they won their lawsuit, and avoid having to pay more legal fees for bankruptcy court. Lane said a dismissal would include a 12-month ban on Giuliani filing again for bankruptcy protection. Freeman and Moss, meanwhile, have a pending request before the judge to declare that the $148 million judgment cannot be discharged — or dismissed — during Giuliani’s bankruptcy. The bankruptcy is one of a host of legal woes consuming Giuliani. Last week, the former federal prosecutor was disbarred as an attorney in New York after a court found that he repeatedly made false statements about Trump’s 2020 election loss. He is also facing the possibility of losing his law license in Washington after a board in May recommended that he be disbarred. In Georgia and Arizona, Giuliani is facing criminal charges over his role in the effort to overturn the 2020 election. He has pleaded not guilty in both cases. When he filed for bankruptcy, Giuliani listed nearly $153 million in existing or potential debts, including almost $1 million in state and federal tax liabilities, money he owes lawyers, and many millions of dollars in potential judgments in lawsuits against him. He estimated he had assets worth $1 million to $10 million. In his most recent financial filings in the bankruptcy case, he said he had about $94,000 cash in hand at the end of May while his company, Giuliani Communications, had about $237,000 in the bank. A main source of income for Giuliani over the past two years has been a retirement account with a balance of just over $1 million in May, down from nearly $2.5 million in 2022 after his withdrawals, the filings say. In May, he spent nearly $33,000 including nearly $28,000 for condo and co-op costs for his Florida and New York City homes. He also spent about $850 on food, $390 on cleaning services, $230 on medicine, $200 on laundry and $190 on vehicles.",
        "summary": "<Giuliani's bankruptcy case might be thrown out by the judge>. \n<The largest creditors agreed that dismissal was the best option>. \nThe case involves two election workers who won $148 million. \nGiuliani is accused of flouting bankruptcy laws and hiding assets. \n<Judge Lane plans to issue a decision by week's end>. \nGiuliani's lawyer views dismissal as a chance to appeal the defamation case. \nFreeman and Moss accuse Giuliani of using bankruptcy as a ploy. \nThe creditors prefer appointing a Chapter 11 trustee instead. \n<Giuliani filed for Chapter 11 bankruptcy reorganization in December>. \nThey claimed Trump’s lies led to death threats. \nFreeman and Moss could continue legal efforts in Washington, D.C. \n[Giuliani has more than $20 million in hidden offshore accounts]. \nGiuliani was recently disbarred in New York. \nHe faces criminal charges in Georgia and Arizona. \nGiuliani listed nearly $153 million in debts.",
        "questions": [
            "Giuliani's bankruptcy case might be thrown out by the judge",
            "The largest creditors agreed that dismissal was the best option",
            "Judge Lane plans to issue a decision by week's end",
            "Giuliani filed for Chapter 11 bankruptcy reorganization in December",
            "Giuliani has more than $20 million in hidden offshore accounts"
        ],
        "incorrect_option_index": 4,
        "url": "https://www.bostonherald.com/2024/07/10/judge-says-rudy-giuliani-bankruptcy-case-likely-to-be-dismissed-but-his-debts-arent-going-away-2/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Associated Press"
    },
    {
        "title": "Ex-NBA player Jontay Porter pleads guilty in case tied to gambling scandal that tanked his career",
        "body_text": "NEW YORK -- Former NBA player Jontay Porter on Wednesday pleaded guilty to conspiracy to commit wire fraud in a federal criminal case tied to the betting scandal that got him banned from the league earlier this year. The former Toronto Raptors center entered the plea at his arraignment in a New York federal court and was set to be released on bond of $250,000. His lawyer had previously said that Porter was cooperating with authorities while being treated for a gambling addiction. Court papers showed the case against Porter is related to an ongoing prosecution of four other men. The four have been arraigned on a charge of conspiracy to commit wire fraud but haven't yet entered any pleas. Those men are charged with scheming to profit off tips from an NBA player that he was going to exit two games early. They or their relatives used the knowledge to place big-winning bets that the athlete would do poorly in those games, according to a court complaint filed when they were charged in June. The complaint didn't name the player, but details matched up with an NBA investigation that spurred Porter's banishment from the league this spring. The league found that he gambled on NBA games and gave bettors confidential information about his health. In court Wednesday, Porter said he agreed to withdraw early from games to get out from under large gambling debts so he and co-conspirators could win bets on his performance. \"I know what I did was wrong, unlawful, and I am deeply sorry,\" he said. Porter is set to be sentenced Dec. 18. He could face from just under three and a half years in prison to a little over four years. He's also likely to be assessed hundreds of thousands of dollars in restitution, plus potential fines. According to the complaint, one of the four men pressed the player to clear up gambling debts by prematurely pulling out of games so that bets on him underperforming would pay off. In a message responding to the man's instructions, the player wrote that if he didn't carry out the plan, \"u hate me and if I don't get u 8k by Friday you're coming to Toronto to beat me up.\" After tipping off some of the men, the player claimed injury or illness and withdrew from Jan. 26 and March 20 games after only minutes on the court, the complaint said. Porter played only briefly on those dates before complaining he was hurt or sick and exiting the games. His points, rebounds and assists in both games fell below sportsbooks' expectations. After the NBA and others began investigating, the player messaged some of the men that they \"might just get hit w a rico,\" an apparent reference to the common acronym for a federal racketeering charge, according to the complaint against them. It said the player also asked the men whether they had deleted \"all the stuff\" from their phones. The NBA's probe found that Porter not only exited at least one game for gamblers' sake but also wagered on NBA games in which he didn't play. He once bet against his own team, the league said. Porter averaged 4.4 points, 3.2 rebounds and 2.3 assists in 26 games this season, including five starts. He also played in 11 games for the Memphis Grizzlies in the 2020-21 season. The 24-year-old's NBA salary was about $410,000. ALSO READ | Man charged with concealing corpse after woman's remains found in sleeping bag ---------- * Get Eyewitness News Delivered * More Manhattan news * Send us a news tip * Download the abc7NY app for breaking news alerts * Follow us on YouTube Submit a tip or story idea to Eyewitness News Have a breaking news tip or an idea for a story we should cover? Send it to Eyewitness News using the form below. If attaching a video or photo, terms of use apply.",
        "summary": "<Jontay Porter pleaded guilty to conspiracy to commit wire fraud.> \n\nPorter was banned from the NBA earlier this year.\n\nHe will be released on a $250,000 bond.\n\n<Porter's lawyer said he is treating a gambling addiction.> \n\nFour other men are also involved in the case.\n\n<The men placed bets on Porter's planned early game exits.> \n\nPorter agreed to exit games to offset gambling debts.\n\nThe NBA banned Porter for leaking confidential health information.\n\nPorter faces potential prison time and huge fines.\n\n[Porter once played for the Los Angeles Lakers.]",
        "questions": [
            "Jontay Porter pleaded guilty to conspiracy to commit wire fraud.",
            "Porter's lawyer said he is treating a gambling addiction.",
            "The men placed bets on Porter's planned early game exits.",
            "Porter once played for the Los Angeles Lakers."
        ],
        "incorrect_option_index": 3,
        "url": "https://abc13.com/post/ex-nba-player-jontay-porter-pleads-guilty-conspiracy/15049124/",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Jennifer Peltz"
    },
    {
        "title": "A collision of a double-decker bus and a milk truck in northern India has killed 18 people and 19 more are injured",
        "body_text": "A collision of a double-decker bus and a milk truck in northern India has killed 18 people and 19 more are injured A collision of a double-decker bus and a milk truck in northern India has killed 18 people and 19 more are injured LUCKNOW, India -- A collision of a double-decker bus and a milk truck in northern India has killed 18 people and 19 more are injured.",
        "summary": "<The collision involved a double-decker bus and a milk truck.> \n<Eighteen people were killed in the accident.>\n<Nineteen others sustained injuries.>\nThe incident happened in northern India.\nThe location affected was Lucknow.\nEmergency services responded swiftly to the scene.\nAuthorities are investigating the cause of the crash.\nVictims were transported to nearby hospitals.\n\n[The collision occurred in southern India.]",
        "questions": [
            "The collision involved a double-decker bus and a milk truck.",
            "Eighteen people were killed in the accident.",
            "Nineteen others sustained injuries.",
            "The collision occurred in southern India."
        ],
        "incorrect_option_index": 3,
        "url": "https://abcnews.go.com/International/wireStory/collision-double-decker-bus-milk-truck-northern-india-111799494",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "The Associated Press"
    },
    {
        "title": "Katy Perry Announces Dance-Pop Album &#8216;143&#8217;: Here&#8217;s When It Arrives",
        "body_text": "After months of teasing her sixth studio album, Katy Perry has finally announced that her next project, titled 143, is on its way this fall. On social media Wednesday (July 10), the 39-year-old pop star unveiled the LP’s cover art — a spacey photo of a nearly nude Perry seemingly levitating in the center of a blue and red cosmos. She also confirmed in the caption that the project will arrive Sept. 20, a full four years after her last album, Smile, arrived in 2020. For those curious about the record’s wordless title, “143” is code for “I love you.” The usage dates back to the early 1900s, per Dictionary.com. “I set out to create a bold, exuberant, celebratory dance-pop album with the symbolic 143 numerical expression of love as a throughline message,” Perry confirmed in a statement. 143 will be led by the recently retired American Idol judge’s previously announced single, “Woman’s World,” which arrives July 11 and was produced by Dr. Luke, Vaughn Oliver, Aaron Joseph and Rocco Did It Again!. One day prior to the album news, she shared a teaser for the track’s music video, featuring high-energy vocals and sultry shots of Perry playing a modernized Rosie the Riveter in a red, white and blue string bikini. According to a release, the track will match much of the songs on 143 — a “sexy, fearless return to form for the multifaceted musician.” Fans can also expect “empowering and provocative pop anthems” with “a lot of heart – and a lot of BPM.” See Perry’s 143 announcement below.",
        "summary": "<Katy Perry announced her sixth studio album, 143, arriving Sept. 20.> \nThe cover art features Perry levitating in a cosmos.\n<143 is code for \"I love you\" dating to the 1900s.>\nPerry aims for a celebratory dance-pop album in 143.\nThe single \"Woman's World\" premieres on July 11.\n<\"Woman's World\" was produced by Dr. Luke and others.>\nA teaser features Perry as Rosie the Riveter.\nThe album promises sexy, fearless, and provocative anthems.\n[The album includes Perry's collaboration with Michael Jackson.]",
        "questions": [
            "Katy Perry announced her sixth studio album, 143, arriving Sept. 20.",
            "143 is code for \"I love you\" dating to the 1900s.",
            "\"Woman's World\" was produced by Dr. Luke and others.",
            "The album includes Perry's collaboration with Michael Jackson."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.billboard.com/music/music-news/katy-perry-new-album-143-release-date-1235728063/",
        "topic": "Entertainment",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Hannah Dailey"
    },
    {
        "title": "George Clooney, a high-profile Biden supporter, asks president to leave race",
        "body_text": "WASHINGTON (AP) — Movie star and lifelong Democrat George Clooney added his voice to calls for Joe Biden to leave the presidential race on Wednesday. Clooney said in a New York Times opinion piece that he loves Biden, but the party would lose the presidential race as well as any control in Congress with him as the nominee. “This isn’t only my opinion; this is the opinion of every senator and congress member and governor that I’ve spoken with in private,” wrote Clooney. He’s hosted several high-dollar Hollywood fundraisers, including for Biden last month. Clooney argued the party should pick a new nominee at its convention next month, saying the process would be “messy” but “wake up” voters in the party’s favor. Biden has refused to end his reelection bid after his weak debate performance against presumptive Republican nominee Donald Trump.",
        "summary": "<George Clooney urged Joe Biden to exit the presidential race.> \n<He expressed his views in a New York Times opinion piece.> \nClooney loves Biden but fears he would lose the race. \n<Every senator, congress member, and governor Clooney spoke to agrees.> \nClooney has hosted high-dollar Hollywood fundraisers, including for Biden. \nHe suggested the party should choose a new nominee at the convention. \nThe process would be messy but beneficial. \nBiden remains in the race despite a weak debate performance. \n[George Clooney also announced he would run for president.]",
        "questions": [
            "George Clooney urged Joe Biden to exit the presidential race.",
            "He expressed his views in a New York Times opinion piece.",
            "Every senator, congress member, and governor Clooney spoke to agrees.",
            "George Clooney also announced he would run for president."
        ],
        "incorrect_option_index": 3,
        "url": "https://apnews.com/article/george-clooney-joe-biden-presidential-race-2024-2419c5a66aac55a5f3cda1e676e6ffde",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Evan Agostini"
    },
    {
        "title": "Astronauts confident Boeing space capsule can safely return them to Earth, despite failures",
        "body_text": "CAPE CANAVERAL, Fla. (AP) — Two astronauts who should have been back on Earth weeks ago said Wednesday that they’re confident that Boeing’s space capsule can return them safely, despite breakdowns. NASA test pilots Butch Wilmore and Suni Williams launched aboard Boeing’s new Starliner capsule early last month, the first people to ride it. Helium leaks and thruster failures almost derailed their arrival at the International Space Station, and has kept them there much longer than planned. In their first news conference from orbit, they said they expect to return once thruster testing is complete here on Earth. They said they’re not complaining about getting extra time in orbit, and are enjoying helping the station crew. “I have a real good feeling in my heart that the spacecraft will bring us home, no problem,” Williams told reporters. The test flight should have lasted eight days, ending on June 14. This week, NASA and Boeing are trying to duplicate the Starliner’s thruster problems on a brand new unit at White Sands Missile Range in New Mexico, one of the prime landing sites in the U.S. western desert. The trouble is in the propulsion system, used to maneuver the spacecraft, Five thrusters failed as the capsule approached the space station on June 6, a day after liftoff. Four have since been reactivated. Wilmore said there should be enough working thrusters to get him and Williams out of orbit. There are also bigger engines that could fill in, if necessary. “That mantra you’ve heard, failure is not an option, that’s why we are staying here now,” Wilmore said. “We trust that the tests that we’re doing are the ones we need to do to get the right answers, to give us the data that we need to come back.” Boeing and NASA consider the ground tests essential to determine what might have gone wrong since that part of the capsule — the service module — is discarded before landing. The leaks also are located in this disposable section. NASA ordered up the Starliner and SpaceX Dragon capsules a decade ago for astronaut flights to and from the space station, paying each company billions of dollars. SpaceX’s first taxi flight with astronauts was in 2020. Boeing’s first crew flight was repeatedly delayed because of software and other issues. ___ The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Science and Educational Media Group. The AP is solely responsible for all content.",
        "summary": "<The Starliner capsule launched with astronauts last month.> Helium leaks and thruster failures delayed their return to Earth. <They spoke in their first news conference from orbit.> They expect to return after thruster testing is done. They enjoy the extra time helping the station crew. The test flight was initially supposed to last eight days. This week, problems are being tested in New Mexico. <Five thrusters failed as the capsule approached the station.> Four out of five thrusters have since reactivated. Bigger engines can also aid if necessary. Boeing and NASA consider these ground tests crucial. [The astronauts trained in underwater simulations to prepare for this mission.] The Starliner faces multiple delays due to software issues. NASA ordered Starliner and Dragon capsules for space flights.",
        "questions": [
            "The Starliner capsule launched with astronauts last month.",
            "They spoke in their first news conference from orbit.",
            "Five thrusters failed as the capsule approached the station.",
            "The astronauts trained in underwater simulations to prepare for this mission."
        ],
        "incorrect_option_index": 3,
        "url": "https://apnews.com/article/boeing-space-astronauts-starliner-nasa-df30b94b0463a20eec72ce494d9bccc4",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Marcia Dunn"
    },
    {
        "title": "UK police searching for an armed man after 3 women were killed in a home near London",
        "body_text": "LONDON -- British police were hunting for an armed man on Wednesday after three women were killed in a house near London. Hertfordshire Police said Kyle Clifford, 26, was being sought over the suspected triple murder. Police said the three women, who were related, were found seriously injured in a house in Bushey, northwest of London, on Tuesday evening. Police and ambulance crews tried to save them, but they were pronounced dead at the scene. Police did not say whether Clifford, who is from London, was connected to the women. Detective Superintendent Rob Hall from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit said police were hunting for Clifford, who was believed to be in London or neighboring Hertfordshire county. Hall said Clifford “may still be in possession of a weapon” and warned members of the public not to approach him.",
        "summary": "<Three women were killed in a house near London.>\nKiller was identified as Kyle Clifford, aged 26.\nVictims, all women, were found in Bushey, near London.\n<Police said the three women were seriously injured.>\nEmergency services declared them dead at the scene.\n<Clifford may still be in possession of a weapon.>\nAuthorities are searching for Clifford in London and Hertfordshire.\nPublic has been warned not to approach Clifford.\n\n[Police have no leads on Kyle Clifford’s whereabouts.]",
        "questions": [
            "Three women were killed in a house near London.",
            "Police said the three women were seriously injured.",
            "Clifford may still be in possession of a weapon.",
            "Police have no leads on Kyle Clifford’s whereabouts."
        ],
        "incorrect_option_index": 3,
        "url": "https://abcnews.go.com/International/wireStory/uk-police-searching-armed-man-after-3-women-111802173",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "The Associated Press"
    },
    {
        "title": "Ben Affleck, Jennifer Garner's daughter Violet demands mask mandates, reveals she contracted post-viral condition at LA public hearing",
        "body_text": "Jennifer Garner and Ben Affleck’s eldest child revealed that she contracted a post-viral condition in 2019 as she demanded mask mandates in LA hospitals during a city board meeting on Tuesday. Violet Affleck, 18, shared her experience with recovering from viruses in an emotional plea in front of the Los Angeles County Board of Supervisors, saying “the county must oppose mask bans for any reason.” During public comments, a section where residents have a chance to ask questions and advocate for a cause, Violet introduced herself before urging the board for the mandate. “Hi, Violet Affleck, Los Angeles resident, first-time voter, I’m 18,” she said in a clip of the meeting shared on X. “I contracted a post-viral condition in 2019,” she continued while donning a face mask. “I’m OK now, but I saw first-hand that medicine does not always have answers to the consequences of even minor viruses.” “The COVID-19 pandemic has thrown that into sharper relief,” she added. According to the Mayo Clinic, a post-viral condition — also known as “long Covid” — occurs following a viral infection. Symptoms can last for months and often include fatigue, lethargy, memory loss, inability to focus, and exhaustion. “One in 10 infections leads to long COVID, which is a devastating neurological and cardiovascular illness that can take away people’s ability to work, see, move and even think,” Violet said during the meeting. “‘It stands to exacerbate our homelessness crisis, as well as the suffering of many people in our city. It hits communities of color, disabled people, elderly people, trans people, women and anyone in a public-facing essential job the hardest.” In February, Los Angeles public health officials announced that employees and visitors to city healthcare facilities would no longer be required to wear masks. More than 37,000 people in Los Angeles died of COVID throughout the pandemic, trailing coronary heart disease and Alzheimer’s deaths, according to officials. “To confront the long COVID crisis, I demand mask availability, air filtration and far-UVC lights in government facilities, including jails and detention centers, and mask mandates in county medical facilities,” the teen added. “We must expand the availability of free tests and treatment and, most importantly, the county must oppose mask bans for any reason.” “They do not keep us safer, they make vulnerable members of our community less safe and make everyone less able to participate in Los Angeles together. Thank you.” Violet also wore a mask during Fanatics CEO Michael Rubin’s Hamptons party last year, where she was snapped with her dad and stepmom Jennifer Lopez. The teen often opts to wear a face mask while out and about running errands. Affleck and Garner divorced in 2015 after 10 years of marriage and are also parents to Seraphina, 15, and Samuel, 12. Violet also boasts two step-siblings from her father’s current marriage to Jennifer Lopez. The “On The Floor” hitmaker, 54, shares twins Max and Emme, 16, with ex-husband Marc Anthony.",
        "summary": "<Jennifer Garner and Ben Affleck's eldest child is Violet Affleck.>\n<Violet, 18, contracted a post-viral condition in 2019.>\nShe advocated for mask mandates in LA hospitals.\n<Violet spoke at the Los Angeles County Board of Supervisors meeting.>\nShe emphasized the need for mask availability in medical facilities.\nSymptoms of long COVID can last for months.\nMore than 37,000 died of COVID in Los Angeles.\nViolet wore a mask during CEO Michael Rubin's party.\nAffleck and Garner divorced in 2015 after 10 years.\nThey are co-parents to Seraphina, 15, and Samuel, 12.\n[Ben Affleck is currently serving as the CEO of a tech company.]",
        "questions": [
            "Jennifer Garner and Ben Affleck's eldest child is Violet Affleck.",
            "Violet, 18, contracted a post-viral condition in 2019.",
            "Violet spoke at the Los Angeles County Board of Supervisors meeting.",
            "Ben Affleck is currently serving as the CEO of a tech company."
        ],
        "incorrect_option_index": 3,
        "url": "https://nypost.com/2024/07/10/us-news/ben-affleck-jennifer-garners-daughter-violet-reveals-she-contracted-a-post-viral-condition-demands-mask-mandates/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Nika Shakhnazarova"
    },
    {
        "title": "UK Police are Searching for a Man after Wife, Daughters of BBC Commentator Killed",
        "body_text": "LONDON (AP) — British police launched a huge manhunt Wednesday for a man believed to be armed with a crossbow and potentially other weapons after three women were killed in a house northwest of London. The BBC said the women killed were the family of well-known radio racing commentator John Hunt. Hertfordshire Police said Kyle Clifford, 26, was being sought over the suspected triple murder, which involved a crossbow and potentially other unnamed weapons. The public were urged not to approach Clifford if they see him. Armed police officers and specialist search teams were “responding at pace in the wake of what has been an horrific incident,” Chief Superintendent Jon Simpson said. Police said the three women — ages 25, 28 and 61 — were found seriously injured in a house in Bushey, northwest of London, on Tuesday evening. Police and ambulance crews tried to save them, but they were pronounced dead at the scene. BBC Radio 5 Live, the corporation’s main news and sports radio channel, said the victims were Carol Hunt, wife of its commentator John Hunt, and two of their daughters. John Hunt is BBC radio’s main horse racing commentator, his voice known to millions through his coverage of the world famous Grand National and The Derby. The Daily Mail newspaper and others reported that he found the bodies early Tuesday evening after returning home from reporting at Lingfield Park racecourse south of London. As part of a note sent to BBC staff, the broadcaster described the incident as “utterly devastating” and that it will provide Hunt “with all the support we can.” Police did not say whether Clifford, who is from London, was connected to the women, but British media reported that he was an ex-boyfriend of one of the daughters. The BBC reported that Clifford left the British Army after a brief period of service in 2022. Local councillor Laurence Brass, who lives nearby, said the area is “a typical leafy British suburb.” “At about eight o’clock last night, I was watching the football on television, and suddenly a helicopter landed in the lawn outside my flat, which is at the top of this road, and then my phone started going, and I was told that there was a major incident here in Bushey and we should all keep away because there was somebody apparently on the run,” he told the BBC. Addressing the suspect directly, Simpson said: “Kyle, if you are seeing or hearing this, please make contact with the police.” Britain’s new home secretary, Yvette Cooper, said she is being kept “fully informed” about the “truly shocking” incident. People in Britain do not need a license to own a crossbow, but it is illegal to carry one in public without a reasonable excuse. A spokesperson for the Home Office said Cooper will “swiftly consider” the findings from a recently launched review into whether further controls on crossbows should be introduced. — By PAN PYLAS Associated Press",
        "summary": "<British police launched a manhunt for Kyle Clifford.> <Clifford, 26, is suspected in a triple murder case.> <He is believed to be armed with a crossbow.> The victims were three women aged 25, 28, and 61. London's radio commentator John Hunt lost his wife and two daughters. John Hunt is BBC radio’s main horse racing commentator. Kyle Clifford possibly used other unnamed weapons. The public is urged not to approach Clifford. Chief Superintendent Jon Simpson described the incident as horrific. Armed police and search teams are actively involved. The incident occurred in Bushey, northwest of London. [The police found Clifford working at a local store.] Clifford was an ex-boyfriend of one of the daughters. He served briefly in the British Army in 2022. Britain is reviewing existing crossbow regulations.",
        "questions": [
            "British police launched a manhunt for Kyle Clifford.",
            "Clifford, 26, is suspected in a triple murder case.",
            "He is believed to be armed with a crossbow.",
            "The police found Clifford working at a local store."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.thenationalherald.com/uk-police-are-searching-for-a-man-after-wife-daughters-of-bbc-commentator-killed/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Achilleas Kouremenos"
    },
    {
        "title": "Ex Red Hot Chili Peppers Guitarist Josh Klinghoffer Sued For Wrongful Death",
        "body_text": "TMZ also obtained video of the alleged incident ... showing a man crossing a street in the crosswalk when he's run over from behind by a black SUV making a left turn. The suit says Josh was driving the car and didn't so much as tap his brakes. He's also accused of being distracted behind the wheel.",
        "summary": "<An alleged incident involves a black SUV hitting a pedestrian.> \nThe man was in a crosswalk when he was hit.\nThe SUV was making a left turn during the incident.\n<Josh is accused of driving the black SUV.> \nHe allegedly did not brake at all.\nJosh is also accused of being distracted while driving.\n[The incident took place on Mars.]",
        "questions": [
            "An alleged incident involves a black SUV hitting a pedestrian.",
            "Josh is accused of driving the black SUV.",
            "The incident took place on Mars."
        ],
        "incorrect_option_index": 2,
        "url": "https://www.tmz.com/2024/07/10/red-hot-chili-peppers-josh-klinghoffer-sued-wrongful-death-accused-running-over-killing-pedestrian-walking-crosswalk/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "TMZ Staff"
    },
    {
        "title": "Russian court orders arrest of opposition leader Navalny's widow",
        "body_text": "A court in Russia ordered the arrest of the widow of Russian opposition leader Alexei Navalny during a hearing Tuesday that was conducted in absentia as part of a sweeping Kremlin crackdown on the opposition. Yulia Navalnaya, who lives abroad, would face arrest if and when she returns to Russia. Moscow’s Basmanny District Court ruled to arrest Navalnaya on charges of alleged involvement in an extremist group. Navalny, the fiercest political foe of Russian President Vladimir Putin, died in February in an Arctic penal colony while serving a 19-year sentence on extremism charges that he had condemned as politically motivated. Authorities said he became ill after a walk but have otherwise given no details on Navalny’s death. Navalny was imprisoned after returning to Moscow in January 2021 from Germany, where he had been recuperating from the 2020 nerve agent poisoning that he blamed on the Kremlin. Navalnaya has accused Putin of her husband’s death and vowed to continue his activities. Russian officials have vehemently denied involvement in Navalny’s poisoning and death. Navalnaya mocked the court’s order on social media platform X, saying that it’s Putin who should be be prosecuted. Her spokesperson, Kira Yarmysh, described the court’s ruling as a recognition of her “merits.” German Chancellor Olaf Scholz noted on X that Navalnaya is carrying on her husband’s legacy and denounced the Moscow court’s ruling as “an arrest warrant against the desire for freedom and democracy.” Russian authorities haven’t specified the charges against Navalnaya. They appear to relate to authorities designating Navalny’s Foundation for Fighting Corruption as an extremist organization. The 2021 court ruling that outlawed Navalny’s group forced his close associates and team members to leave Russia. A number of journalists have been jailed on similar charges in recent months in relation to their coverage of Navalny. The Kremlin’s crackdown on opposition activists, independent journalists and ordinary Russians critical of it has intensified after Russia invaded Ukraine in February 2022.",
        "summary": "<Yulia Navalnaya faces arrest if she returns to Russia.> <She is charged with alleged involvement in an extremist group.> <Russian officials deny involvement in Navalny’s poisoning and death.> \n\nNavalny died in February in an Arctic penal colony. \n\nNavalny was serving a 19-year sentence on extremism charges. \n\nAuthorities provided no details on Navalny’s death. \n\nNavalny blamed the Kremlin for his 2020 nerve agent poisoning.\n\nNavalnaya vowed to continue her husband’s activities. \n\nKira Yarmysh called the ruling a recognition of Navalnaya’s “merits.” \n\nGerman Chancellor denounced the court’s ruling as against freedom. \n\nKremlin crackdown intensified after Russia invaded Ukraine in 2022. \n\n[Navalny was secretly working for the Russian government before his death.]",
        "questions": [
            "Yulia Navalnaya faces arrest if she returns to Russia.",
            "She is charged with alleged involvement in an extremist group.",
            "Russian officials deny involvement in Navalny’s poisoning and death.",
            "Navalny was secretly working for the Russian government before his death."
        ],
        "incorrect_option_index": 3,
        "url": "https://apnews.com/article/russia-navalnaya-arrest-court-opposition-fde35d06b4659980d99e90fd6f7aeaf7",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "The Associated Press"
    },
    {
        "title": "Man in China caught smuggling 100 live snakes in his trousers",
        "body_text": "A man has been caught trying to smuggle more than 100 live snakes into mainland China by cramming them into his trousers, according to the country’s customs authority. The unnamed traveller was stopped by customs officers as he sought to slip out of semi-autonomous Hong Kong and into the border city of Shenzhen, China Customs said in a statement on Tuesday. “Upon inspection, customs officers discovered that the pockets of the trousers the passenger was wearing were packed with six canvas drawstring bags and sealed with tape,” the statement said. “Once opened, each bag was found to contain living snakes in all kinds of shapes, sizes and colours,” it added. The statement said officers seized 104 of the reptiles, including milk snakes and corn snakes, many of which were non-native species. An accompanying video showed two border agents peering into transparent plastic bags filled with squirming red, pink and white snakes. China is one of the world’s biggest animal trafficking hubs, but authorities have cracked down on the illicit trade in recent years. The country’s biosecurity and disease control laws forbid people from bringing in non-native species without permission. “Those who break the rules will be … held liable in accordance with the law,” the customs authority said, without specifying the man’s punishment.",
        "summary": "<Unidentified man caught smuggling over 100 snakes into China.>\n<The man was stopped by customs officers at the border.>\nHe was traveling from Hong Kong to Shenzhen.\n<Snakes were hidden in six drawstring bags in his trousers.>\nCustoms officers found various shapes, sizes, and colors of snakes.\nOfficers seized 104 snakes, including milk and corn snakes.\nMany of the seized snakes were non-native species.\nVideo showed border agents inspecting squirming snakes in plastic bags.\nChina is a major hub for animal trafficking.\nAuthorities have intensified crackdowns on illicit animal trade.\nViolators of biosecurity laws face legal consequences.\n[The snakes were found to be venomous cobras and pythons.]",
        "questions": [
            "Unidentified man caught smuggling over 100 snakes into China.",
            "The man was stopped by customs officers at the border.",
            "Snakes were hidden in six drawstring bags in his trousers.",
            "The snakes were found to be venomous cobras and pythons."
        ],
        "incorrect_option_index": 3,
        "url": "https://www.theguardian.com/world/article/2024/jul/10/man-in-china-caught-smuggling-100-live-snakes-in-his-trousers",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Agence France-Presse in Beijing"
    },
    {
        "title": "Russia Issues Arrest Warrant for Alexei Navalny’s Widow",
        "body_text": "Copyright ©2024 Dow Jones & Company, Inc. All Rights Reserved This copy is for your personal, non-commercial use only. Distribution and use of this material are governed by our Subscriber Agreement and by copyright law. For non-personal use or to order multiple copies, please contact Dow Jones Reprints at 1-800-843-0008 or visit www.djreprints.com.",
        "summary": "<This article is ©2024 by Dow Jones & Company, Inc.> Distribution for personal use is allowed. Non-commercial use is governed by a Subscriber Agreement. For commercial use, contact Dow Jones Reprints. Contact number is 1-800-843-0008. <Visit www.djreprints.com for more information.> \n\n[Dow Jones & Company offers free reprints.]",
        "questions": [
            "This article is ©2024 by Dow Jones & Company, Inc.",
            "Visit www.djreprints.com for more information.",
            "Dow Jones & Company offers free reprints."
        ],
        "incorrect_option_index": 2,
        "url": "https://www.wsj.com/world/russia/russia-issues-arrest-warrant-for-alexei-navalnys-widow-c63ee147",
        "topic": "Politics",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Georgi Kantchev"
    },
    {
        "title": "Sharon Stone says she was left with 'zero money' after losing $18 million in savings following 2001 stroke",
        "body_text": "Sharon Stone is looking back on her 2001 stroke with mixed feelings. In an interview with the Hollywood Reporter published Tuesday, the “Basic Instinct” actress revealed she lost $18 million in savings after suffering from the stroke, which caused a nine-day brain bleed, due to “people taking advantage” of her during her seven-year recovery as she stepped away from Hollywood. “I had $18 million saved because of all my success, but when I got back into my bank account, it was all gone. My refrigerator, my phone — everything was in other people’s names,” Stone said. “I had zero money.” The actress, 66, went on to reveal that the trauma of her injury “100 percent” changed the way her brain functions and the way she thinks. “A Buddhist monk told me that I had been reincarnated into my same body,” Stone said. “I had a death experience and then they brought me back. I bled into my brain for nine days, so my brain was shoved to the front of my face. It wasn’t positioned in my head where it was before,” the actress continued. “And while that was happening, everything changed,” Stone recalled. “My sense of smell, my sight, my touch. I couldn’t read for a couple of years.” “Things were stretched and I was seeing color patterns. A lot of people thought I was going to die.” Now that she’s healed, the “Casino” star said she was able to move on after losing her money because she decided to “stay present and let go.” “I decided not to hang onto being sick or to any bitterness or anger. If you bite into the seed of bitterness, it never leaves you. But if you hold faith, even if that faith is the size of a mustard seed, you will survive,” Stone said. “So, I live for joy now. I live for purpose.”",
        "summary": "<Sharon Stone reflects on her 2001 stroke with mixed feelings.>\nShe lost $18 million in savings after the stroke.\n<Stone faced a nine-day brain bleed and a seven-year recovery.>\n<People took advantage of her during her recovery.>\n\"I had zero money,\" Stone said about her situation.\nThe injury changed how her brain functions and operates.\nShe experienced a sense of reincarnation into her own body.\nStone had a near-death experience and extensive brain bleed.\nTrauma affected her senses, like smell, sight, and touch.\nStone couldn't read for a couple of years post-stroke.\n<She decided to move on by staying present and letting go.>\nStone now lives for joy and purpose.\n[Sharon Stone was a professional soccer player before acting.]",
        "questions": [
            "Sharon Stone reflects on her 2001 stroke with mixed feelings.",
            "Stone faced a nine-day brain bleed and a seven-year recovery.",
            "People took advantage of her during her recovery.",
            "She decided to move on by staying present and letting go.",
            "Sharon Stone was a professional soccer player before acting."
        ],
        "incorrect_option_index": 4,
        "url": "https://pagesix.com/2024/07/09/entertainment/sharon-stone-says-she-was-left-with-zero-money-after-losing-18-million-in-savings-following-2001-stroke/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "BreAnna Bell"
    },
    {
        "title": "'Bachelor in Paradise' Renewed for Season 10 at ABC",
        "body_text": "ABC has renewed “Bachelor in Paradise” for a tenth season set to air in 2025. A spinoff of ABC’s signature reality dating franchise, “Bachelor in Paradise” features fan favorites from “The Bachelor” and “The Bachelorette” as they seek second chances at love, traveling to a romantic paradise to try dating each other. “Bachelor in Paradise” […]",
        "summary": "<ABC has renewed “Bachelor in Paradise” for its tenth season.> The new season is set to air in 2025. <It features fan favorites from “The Bachelor” and “The Bachelorette.”> Contestants seek second chances at love. <They travel to a romantic paradise for dating.> [This season will be hosted by an AI-generated personality.]",
        "questions": [
            "ABC has renewed “Bachelor in Paradise” for its tenth season.",
            "It features fan favorites from “The Bachelor” and “The Bachelorette.”",
            "They travel to a romantic paradise for dating.",
            "This season will be hosted by an AI-generated personality."
        ],
        "incorrect_option_index": 3,
        "url": "https://variety.com/2024/tv/news/bachelor-in-paradise-renewed-season-10-abc-1236064391/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Selome Hailu"
    },
    {
        "title": "Barron Trump gets a standing ovation at his father’s Florida rally: ‘First time he's ever done this’ ",
        "body_text": "Donald Trump’s youngest son, Barron Trump, received a standing ovation Tuesday at his father’s Florida rally in what the former president suggested was the teenager’s debut on the campaign trail. Barron, 18, turned and waved to the crowd of Trump supporters at his father’s Doral golf course as the former president praised him for his smarts, demeanor and rising popularity. “This is a young man. He just turned 18 – Oh, look at this,” the 78-year-old former president said, stopping as the crowd’s cheers intensified. “A very young man who is now going to college – got into every college he wanted to and he made his choice,” Trump continued. “He’s a very good guy.” “This is the first time he’s ever done this, Barron … stand up,” Trump said as his teenage son rose up and gave the crowd another fist pump and wave. “That’s the first time he’s done it. That’s the first time, right? You’re pretty popular. He might be more popular than Don and Eric, we got to talk about that,” the former president said, referencing his other two sons – both of whom addressed the crowd prior to their father’s arrival. “Welcome to the scene, Barron,” the ex-commander in chief said, before remarking that Barron “had such a nice, easy life – now it’s a little bit changed.” Barron was recently seen riding in a golf cart with his father in a leaked video showing the former president slamming President Biden and Vice President Kamala Harris in the days after the June 27 debate. In May, the 18-year-old was asked to be a Florida delegate at the Republican National Convention, but he declined the request. Barron, who at 6-foot-7 inches tall towers above his father, has largely stayed out of the political fray. The Trump family has not announced which college Barron will attend in the fall.",
        "summary": "<Donald Trump's youngest son, Barron Trump, received a standing ovation.> \n<The rally was held at Trump's Doral golf course in Florida.> \nBarron, 18, waved to Trump supporters at the rally. \nTrump praised his son for his smarts and demeanor. \n<Barron was attending his first campaign rally for his father.> \nTrump mentioned Barron got into every college he wanted. \nBarron fist-pumped and waved to the crowd. \nTrump joked Barron might be more popular than Don and Eric. \nBarron previously turned down a request to be a delegate. \nThe college Barron will attend hasn't been announced. \n[Donald Trump is planning to run for President in 2026.]",
        "questions": [
            "Donald Trump's youngest son, Barron Trump, received a standing ovation.",
            "The rally was held at Trump's Doral golf course in Florida.",
            "Barron was attending his first campaign rally for his father.",
            "Donald Trump is planning to run for President in 2026."
        ],
        "incorrect_option_index": 3,
        "url": "https://nypost.com/2024/07/10/us-news/barron-trump-gets-a-standing-ovation-at-his-fathers-florida-rally-this-is-the-first-time-hes-ever-done-this/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Victor Nava"
    },
    {
        "title": "Audrina Patridge Goes Instagram Official with Country Singer Michael Ray in Romantic Post",
        "body_text": "Audrina Patridge and Michael Ray are Instagram official! The Hills alum, 39, and country singer, 36, confirmed their romance in a cute post on Tuesday, July 9. “There’s a lot of things in life worth letting go. But the ones that mean the most, you gotta hold ?,” Patridge wrote in the caption, quoting a lyric from Ray’s new song “Hold” while sharing a photo of her and Ray cuddling up together at night. Ray responded in the comment section, “Let’s go babe!!! Grateful for you and Kirra ❤️♾️,” referring to Patridge and her eight-year-old daughter Kirra, whom she shares with her ex-husband Corey Bohan, as Patridge wrote back, “❤️❤️.” Both Ray and Patridge reshared the post on their Instagram Stories — with Patridge adding a big white outlined heart in the background behind the photo. The pair’s relationship confirmation comes after Patridge posted a photo on her Instagram Stories of her and Ray kissing with her legs wrapped around his waist in late June. “This one…,” she captioned the sweet snapshot at the time, adding a smiley face with hearts emoji. Representatives for Patridge and Ray at the time did not immediately return PEOPLE’s request for comment. Fans previously spotted that Patridge and Ray had liked each other’s posts for the past three months on Instagram, including photos from Stagecoach posted by Patridge in April. The Choices: To the Hills and Back Again author’s new romance with the country singer comes after she dated The Hills costar Justin \"Justin Bobby\" Brescia and musician Ryan Cabrera. Patridge was also married to Bohan from 2016 to 2018, during which time she alleged she experienced domestic abuse. Speaking to PEOPLE about her divorce in July 2022, Patridge said, \"Now, it's like, I love myself enough to walk away. You have to love yourself enough to say enough is enough. Or I'm not putting up with this.” Never miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer​​, from celebrity news to compelling human interest stories. \"I've learned a lot of that going through this. And I've learned that when you're in a bad relationship, you put up with a lot of things because you're trying to force it to work ... to make the other person happy. And that's not good. You've got to notice all those signs and stop it before it gets too far.\" Ray, meanwhile, divorced from his ex-wife, fellow country singer Carly Pearce, in June 2020 after eight months of marriage. The “Whiskey and Rain” singer previously told PEOPLE that, despite the difficult split, he was open to getting remarried. \"I think maybe down the road, for sure,” he said in June 2023. “I believe that that's what we're put on this world to do, is to find somebody that you connect with that makes you better and create a family and leave a legacy.”",
        "summary": "<Audrina Patridge and Michael Ray are Instagram official.> Patridge is 39 and Ray is 36 years old. They confirmed their romance in a cute Instagram post. <Patridge quoted a lyric from Ray's song \"Hold\".> Ray commented expressing gratitude for Patridge and her daughter. Patridge's daughter Kirra is eight years old. The post was reshared on their Instagram Stories. Their relationship was hinted with likes on each other's posts. Patridge dated Justin Brescia and Ryan Cabrera before Ray. She was married to Corey Bohan from 2016 to 2018. Patridge alleged she experienced domestic abuse from Bohan. [The couple has been rumored to adopt a pet tiger together.] Ray divorced Carly Pearce in June 2020. Ray is open to getting remarried.",
        "questions": [
            "Audrina Patridge and Michael Ray are Instagram official.",
            "Patridge quoted a lyric from Ray's song \"Hold\".",
            "The couple has been rumored to adopt a pet tiger together."
        ],
        "incorrect_option_index": 2,
        "url": "https://people.com/audrina-patridge-goes-instagram-official-with-country-singer-michael-ray-8675704",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Escher Walcott"
    },
    {
        "title": "CBS News President Ingrid Ciprian-Matthews Will Exit Amid Cost Cuts",
        "body_text": "CBS News may be on the hunt for another newsroom honcho. Ingrid Ciprian-Matthews, a veteran journalism executive who was named president of the Paramount Global news unit just last August, told staffers Wednesday morning that she planned to cede her role, opting instead to serve as a senior advisor for coverage of the 2024 presidential […]",
        "summary": "<Ingrid Ciprian-Matthews plans to cede her role at CBS News.>\n<Ciprian-Matthews was named president of CBS News last August.>\n<She will serve as a senior advisor for 2024 election coverage.>\nCBS News might need a new newsroom executive soon.\nCiprian-Matthews has been a veteran journalism executive.\nParamount Global encompasses the CBS News division.\nThe news was announced to staffers on Wednesday morning.\n[Paramount Global plans to shut down CBS News entirely.]",
        "questions": [
            "Ingrid Ciprian-Matthews plans to cede her role at CBS News.",
            "Ciprian-Matthews was named president of CBS News last August.",
            "She will serve as a senior advisor for 2024 election coverage.",
            "Paramount Global plans to shut down CBS News entirely."
        ],
        "incorrect_option_index": 3,
        "url": "https://variety.com/2024/tv/news/cbs-news-president-ingrid-ciprian-matthews-exit-paramount-cuts-1236064390/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Brian Steinberg"
    },
    {
        "title": "Alexandra Daddario is pregnant, expecting rainbow baby with husband Andrew Form after 'painful' loss",
        "body_text": "Alexandra Daddario has a rainbow baby on the way! The actress is pregnant with her and husband Andrew Form’s first child together after previously experiencing a “painful” loss. The “White Lotus” alum, 38, debuted her baby bump while speaking to Vogue about her “long” journey to motherhood. “I’m pregnant and it’s all successful and everything’s healthy,” Daddario said in an interview published Wednesday, noting that she didn’t feel like she had a right to “complain” about her symptoms. “I had been pregnant,” she explained. “Then I had a loss. It’s long and complicated, so I don’t want to be too specific. Those kinds of losses and trauma are very hard to explain unless you’ve been through them. “I really relate to all the women who have been through those kinds of things in a way that I didn’t understand fully before,” the “Baywatch” star continued. “It’s very, very painful.” The Emmy nominee, who was six months along at the time of the interview, had “a lot of complicated feelings” when she found out that she had conceived again. “It was actually quite hard to process,” she said. Daddario initially tried to hide her pregnancy on the set of “Mayfair Witches” which was a struggle as she was “throwing up and having make-out scenes … right after.” When the “Percy Jackson” star came clean, she joked that “everyone was very understanding about making out with a nauseous, vomiting girl.” Daddario is already the stepmom to Form’s two sons — Rowan and Julian — with his ex-wife, Jordana Brewster. The former couple married in 2007, welcoming both boys via surrogate before separating in 2020. Form, 55, moved on with Daddario the following year, getting down on one knee in August 2021. After the duo married in New Orleans in June 2022, the bride told Willie Geist on “Sunday Today” that she had “always wanted to be a mom.” She gushed, “I think from when I was young, I’ve never been scared of monogamy or settling down or anything like that.”",
        "summary": "<Alexandra Daddario is expecting her first child with Andrew Form.> The actress previously experienced a “painful” pregnancy loss. <Daddario debuted her baby bump in a Vogue interview on Wednesday.> She described her pregnancy journey as \"long and complicated.\" Daddario is six months pregnant and feeling healthy. <The actress discussed feeling complicated emotions with her new pregnancy.> She initially tried to hide her condition on \"Mayfair Witches\" set. Daddario is already a stepmom to Form’s two sons. Form married Daddario in June 2022 after proposing in August 2021. [Alexandra Daddario was previously married to a famous director.]",
        "questions": [
            "Alexandra Daddario is expecting her first child with Andrew Form.",
            "Daddario debuted her baby bump in a Vogue interview on Wednesday.",
            "The actress discussed feeling complicated emotions with her new pregnancy.",
            "Alexandra Daddario was previously married to a famous director."
        ],
        "incorrect_option_index": 3,
        "url": "https://pagesix.com/2024/07/10/parents/alexandra-daddario-is-pregnant-expecting-rainbow-baby-with-andrew-form/",
        "topic": "General",
        "size": "Small",
        "date_published": "2024-7-10",
        "author": "Riley Cardoza"
    }
]
